IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
<module name="DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_0" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_0" offset="0x0" width="32" description="">
		<bitfield id="CONTROLLER_ID" width="16" begin="31" end="16" resetval="0x4166" description="Holds the controller product id number. READ-ONLY " range="31 - 16" rwaccess="R"/> 
		<bitfield id="DRAM_CLASS" width="4" begin="11" end="8" resetval="0x0" description="Defines the class of DRAM memory which is connected to the controller. " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="START" width="1" begin="0" end="0" resetval="0x0" description="Initiate command processing in the controller. Set to 1 to initiate. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_1" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_1" offset="0x4" width="32" description="">
		<bitfield id="CONTROLLER_VERSION_0" width="32" begin="31" end="0" resetval="0x1562047427" description="Holds the controller version id. READ-ONLY " range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_2" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_2" offset="0x8" width="32" description="">
		<bitfield id="CONTROLLER_VERSION_1" width="32" begin="31" end="0" resetval="0x24225296" description="Holds the controller version id. READ-ONLY " range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_3" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_3" offset="0xC" width="32" description="">
		<bitfield id="READ_DATA_FIFO_DEPTH" width="8" begin="31" end="24" resetval="0x64" description="Reports the depth of the controller core read data queue. READ-ONLY " range="31 - 24" rwaccess="R"/> 
		<bitfield id="MAX_CS_REG" width="2" begin="17" end="16" resetval="0x2" description="Holds the maximum number of chip selects available. READ-ONLY " range="17 - 16" rwaccess="R"/> 
		<bitfield id="MAX_COL_REG" width="4" begin="11" end="8" resetval="0x10" description="Holds the maximum width of column address in DRAMs. READ-ONLY " range="11 - 8" rwaccess="R"/> 
		<bitfield id="MAX_ROW_REG" width="5" begin="4" end="0" resetval="0x17" description="Holds the maximum width of memory address bus. READ-ONLY " range="4 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_4" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_4" offset="0x10" width="32" description="">
		<bitfield id="WRITE_DATA_FIFO_PTR_WIDTH" width="8" begin="23" end="16" resetval="0x5" description="Reports the width of the controller core write data latency queue pointer. READ-ONLY " range="23 - 16" rwaccess="R"/> 
		<bitfield id="WRITE_DATA_FIFO_DEPTH" width="8" begin="15" end="8" resetval="0x32" description="Reports the depth of the controller core write data latency queue. READ-ONLY " range="15 - 8" rwaccess="R"/> 
		<bitfield id="READ_DATA_FIFO_PTR_WIDTH" width="8" begin="7" end="0" resetval="0x6" description="Reports the width of the controller core read data queue pointer. READ-ONLY " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_5" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_5" offset="0x14" width="32" description="">
		<bitfield id="ASYNC_CDC_STAGES" width="8" begin="31" end="24" resetval="0x2" description="Reports the number of synchronizer delays specified for the asynchronous boundary crossings. READ-ONLY " range="31 - 24" rwaccess="R"/> 
		<bitfield id="MEMCD_RMODW_FIFO_PTR_WIDTH" width="8" begin="23" end="16" resetval="0x5" description="Reports the width of the controller core read/modify/write FIFO pointer. READ-ONLY " range="23 - 16" rwaccess="R"/> 
		<bitfield id="MEMCD_RMODW_FIFO_DEPTH" width="16" begin="15" end="0" resetval="0x32" description="Reports the depth of the controller core read/modify/write FIFO. READ-ONLY " range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_6" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_6" offset="0x18" width="32" description="">
		<bitfield id="AXI0_WRCMD_PROC_FIFO_LOG2_DEPTH" width="8" begin="31" end="24" resetval="0x3" description="Reports the depth of the AXI port 0 write command processing FIFO. Value is the log2 value of the depth. READ-ONLY " range="31 - 24" rwaccess="R"/> 
		<bitfield id="AXI0_WR_ARRAY_LOG2_DEPTH" width="8" begin="23" end="16" resetval="0x7" description="Reports the depth of the AXI port 0 write data array. Value is the log2 value of the depth. READ-ONLY " range="23 - 16" rwaccess="R"/> 
		<bitfield id="AXI0_RDFIFO_LOG2_DEPTH" width="8" begin="15" end="8" resetval="0x1" description="Reports the depth of the AXI port 0 read data FIFO. Value is the log2 value of the depth. READ-ONLY " range="15 - 8" rwaccess="R"/> 
		<bitfield id="AXI0_CMDFIFO_LOG2_DEPTH" width="8" begin="7" end="0" resetval="0x1" description="Reports the depth of the AXI port 0 command FIFO. Value is the log2 value of the depth. READ-ONLY " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_7" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_7" offset="0x1C" width="32" description="">
		<bitfield id="TINIT_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT value in cycles. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_8" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_8" offset="0x20" width="32" description="">
		<bitfield id="TINIT3_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT3 value in cycles. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_9" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_9" offset="0x24" width="32" description="">
		<bitfield id="TINIT4_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT4 value in cycles. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_10" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_10" offset="0x28" width="32" description="">
		<bitfield id="TINIT5_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT5 value in cycles. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_11" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_11" offset="0x2C" width="32" description="">
		<bitfield id="TINIT_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT value in cycles. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
