IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_12" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_12" offset="0x30" width="32" description="">
		<bitfield id="TINIT3_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT3 value in cycles. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_13" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_13" offset="0x34" width="32" description="">
		<bitfield id="TINIT4_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT4 value in cycles. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_14" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_14" offset="0x38" width="32" description="">
		<bitfield id="TINIT5_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT5 value in cycles. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_15" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_15" offset="0x3C" width="32" description="">
		<bitfield id="TINIT_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT value in cycles. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_16" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_16" offset="0x40" width="32" description="">
		<bitfield id="TINIT3_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT3 value in cycles. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_17" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_17" offset="0x44" width="32" description="">
		<bitfield id="TINIT4_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT4 value in cycles. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_18" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_18" offset="0x48" width="32" description="">
		<bitfield id="NO_AUTO_MRR_INIT" width="1" begin="24" end="24" resetval="0x0" description="Disable MRR commands during initialization. Set to 1 to disable. " range="24" rwaccess="R/W"/> 
		<bitfield id="TINIT5_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM TINIT5 value in cycles. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_19" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_19" offset="0x4C" width="32" description="">
		<bitfield id="DFI_FREQ_RATIO_F2" width="2" begin="25" end="24" resetval="0x0" description="Defines how dfi_freq_ratio is driven on the DFI bus.  For LPDDR5, specifies the DFI clock to WCK ratio.  For all other memory classes, specifies the controller clock to DFI PHY clock ratio.  Program to zero for a 1:1 ratio, one for a 1:2 ratio, and two for a 1:4 ratio. FC=2 " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="DFI_FREQ_RATIO_F1" width="2" begin="17" end="16" resetval="0x0" description="Defines how dfi_freq_ratio is driven on the DFI bus.  For LPDDR5, specifies the DFI clock to WCK ratio.  For all other memory classes, specifies the controller clock to DFI PHY clock ratio.  Program to zero for a 1:1 ratio, one for a 1:2 ratio, and two for a 1:4 ratio. FC=1 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="DFI_FREQ_RATIO_F0" width="2" begin="9" end="8" resetval="0x0" description="Defines how dfi_freq_ratio is driven on the DFI bus.  For LPDDR5, specifies the DFI clock to WCK ratio.  For all other memory classes, specifies the controller clock to DFI PHY clock ratio.  Program to zero for a 1:1 ratio, one for a 1:2 ratio, and two for a 1:4 ratio. FC=0 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="MRR_ERROR_STATUS" width="1" begin="0" end="0" resetval="0x0" description="Indicates that an MRR was issued while in self-refresh. Value of 1 indicates a violation. READ-ONLY " range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_20" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_20" offset="0x50" width="32" description="">
		<bitfield id="PHY_INDEP_TRAIN_MODE" width="1" begin="24" end="24" resetval="0x0" description="Enable PHY independent training mode commands during initialization. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="ODT_VALUE" width="2" begin="17" end="16" resetval="0x0" description="When using LPDDR4, this value will be driven out on the dfi_odt signal. " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="NO_MRW_INIT" width="1" begin="8" end="8" resetval="0x0" description="Disable MRW commands during initialization. Set to 1 to disable. " range="8" rwaccess="R/W"/> 
		<bitfield id="DFI_CMD_RATIO" width="1" begin="0" end="0" resetval="0x1" description="Indicates the controller clock to DFI PHY clock ratio for the DFI command interface.  For LPDDR5, this is always a 1:1 ratio.  For all other memory classes, this will be the same as the dfi_freq_ratio.  Zero specifies a 1:1 ratio and one specifies a 1:2 ratio. READ-ONLY " range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_21" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_21" offset="0x54" width="32" description="">
		<bitfield id="DFIBUS_FREQ_F1" width="5" begin="28" end="24" resetval="0x0" description="Defines the DFI bus frequency. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="DFIBUS_FREQ_F0" width="5" begin="20" end="16" resetval="0x0" description="Defines the DFI bus frequency. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_INDEP_INIT_MODE" width="1" begin="8" end="8" resetval="0x0" description="Enable PHY independent initailization mode commands during initialization. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="TSREF2PHYMSTR" width="6" begin="5" end="0" resetval="0x0" description="Specifies the minimum time after a self-refresh exit command on the DFI bus that the Controller will wait for the PHY to assert the dfi_phymstr_req signal, before completing other commands. Used when the low power control logic is expected to pass control to the PHY for training when exiting SREF. " range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_22" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_22" offset="0x58" width="32" description="">
		<bitfield id="FREQ_CHANGE_TYPE_F2" width="2" begin="25" end="24" resetval="0x0" description="Defines the encoded frequency driven out on the cntrl_freq_change_req_type signal during a frequency change operation. FC=2 " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="FREQ_CHANGE_TYPE_F1" width="2" begin="17" end="16" resetval="0x0" description="Defines the encoded frequency driven out on the cntrl_freq_change_req_type signal during a frequency change operation. FC=1 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="FREQ_CHANGE_TYPE_F0" width="2" begin="9" end="8" resetval="0x0" description="Defines the encoded frequency driven out on the cntrl_freq_change_req_type signal during a frequency change operation. FC=0 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="DFIBUS_FREQ_F2" width="5" begin="4" end="0" resetval="0x0" description="Defines the DFI bus frequency. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_23" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_23" offset="0x5C" width="32" description="">
		<bitfield id="TRST_PWRON" width="32" begin="31" end="0" resetval="0x0" description="Duration of memory reset during power-on initialization. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_24" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_24" offset="0x60" width="32" description="">
		<bitfield id="CKE_INACTIVE" width="32" begin="31" end="0" resetval="0x0" description="Number of cycles after reset before CKE will be active. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_25" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_25" offset="0x64" width="32" description="">
		<bitfield id="TDLL_F1" width="16" begin="31" end="16" resetval="0x0" description="DRAM TDLL value in cycles. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TDLL_F0" width="16" begin="15" end="0" resetval="0x0" description="DRAM TDLL value in cycles. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
