IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_26" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_26" offset="0x68" width="32" description="">
		<bitfield id="DQS_OSC_PER_CS_OOV_TRAINING_STATUS" width="2" begin="25" end="24" resetval="0x0" description="Set the CS information for which DQS oscillator is having out of variance value. READ-ONLY " range="25 - 24" rwaccess="R"/> 
		<bitfield id="LPC_SW_ENTER_DQS_OSC_IN_PROGRESS_ERR_STATUS" width="1" begin="16" end="16" resetval="0x0" description="Error response for Software issued Low power command while DQS Oscillator is in progress. READ-ONLY" range="16" rwaccess="R"/> 
		<bitfield id="TDLL_F2" width="16" begin="15" end="0" resetval="0x0" description="DRAM TDLL value in cycles. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_27" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_27" offset="0x6C" width="32" description="">
		<bitfield id="DQS_OSC_MPC_CMD" width="24" begin="31" end="8" resetval="0x0" description="Set MPC encoding for DQS Oscillator TEST mode. " range="31 - 8" rwaccess="R/W"/> 
		<bitfield id="DQS_OSC_TST" width="1" begin="0" end="0" resetval="0x0" description="Enable DQS Oscillator TEST mode. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_28" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_28" offset="0x70" width="32" description="">
		<bitfield id="DQS_OSC_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="Enable DQS oscillator measurement function in DRAM. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="MRR_MSB_REG" width="8" begin="15" end="8" resetval="0x0" description="Set MSB MRR register number for DQS Oscillator TEST mode. " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MRR_LSB_REG" width="8" begin="7" end="0" resetval="0x0" description="Set LSB MRR register number for DQS Oscillator TEST mode. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_29" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_29" offset="0x74" width="32" description="">
		<bitfield id="FUNC_VALID_CYCLES" width="4" begin="19" end="16" resetval="0x0" description="Number of cycles to hold dfi_function_valid asserted. " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="DQS_OSC_PERIOD" width="15" begin="14" end="0" resetval="0x0" description="Number of cycles to run the oscillator measurement. Must reflect cycles programmed into mode register. " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_30" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_30" offset="0x78" width="32" description="">
		<bitfield id="DQS_OSC_NORM_THRESHOLD" width="32" begin="31" end="0" resetval="0x0" description="Number of long counts until the normal priority request is asserted for DQS Oscillator. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_31" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_31" offset="0x7C" width="32" description="">
		<bitfield id="DQS_OSC_HIGH_THRESHOLD" width="32" begin="31" end="0" resetval="0x0" description="Number of long counts until the high priority request is asserted for DQS Oscillator. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_32" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_32" offset="0x80" width="32" description="">
		<bitfield id="DQS_OSC_TIMEOUT" width="32" begin="31" end="0" resetval="0x0" description="Number of long counts until the timeout is asserted for DQS Oscillator. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_33" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_33" offset="0x84" width="32" description="">
		<bitfield id="DQS_OSC_PROMOTE_THRESHOLD" width="32" begin="31" end="0" resetval="0x0" description="Number of long counts until a software request for the DQS Oscillator is promoted to high priority. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_34" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_34" offset="0x88" width="32" description="">
		<bitfield id="TOSCO_F0" width="8" begin="31" end="24" resetval="0x0" description="Number of cycles for tOSCO timing parameter, the time for the DQS Oscillator measurement to be available in the mode registers. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="DQS_OSC_REQUEST" width="1" begin="16" end="16" resetval="0x0" description="Software request for DQS Oscillator measurement function in DRAM. WRITE-ONLY " range="16" rwaccess="W"/> 
		<bitfield id="OSC_VARIANCE_LIMIT" width="16" begin="15" end="0" resetval="0x0" description="Allowed difference between base value and DQS Oscillator measurement. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_35" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_35" offset="0x8C" width="32" description="">
		<bitfield id="DQS_OSC_BASE_VALUE_0_CS0" width="16" begin="31" end="16" resetval="0x0" description="Base value for device 0 on chip 0. READ-ONLY DEV=0 " range="31 - 16" rwaccess="R"/> 
		<bitfield id="TOSCO_F2" width="8" begin="15" end="8" resetval="0x0" description="Number of cycles for tOSCO timing parameter, the time for the DQS Oscillator measurement to be available in the mode registers. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TOSCO_F1" width="8" begin="7" end="0" resetval="0x0" description="Number of cycles for tOSCO timing parameter, the time for the DQS Oscillator measurement to be available in the mode registers. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_36" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_36" offset="0x90" width="32" description="">
		<bitfield id="DQS_OSC_BASE_VALUE_0_CS1" width="16" begin="31" end="16" resetval="0x0" description="Base value for device 0 on chip 1. READ-ONLY DEV=0 " range="31 - 16" rwaccess="R"/> 
		<bitfield id="DQS_OSC_BASE_VALUE_1_CS0" width="16" begin="15" end="0" resetval="0x0" description="Base value for device 1 on chip 0. READ-ONLY DEV=1 " range="15 - 0" rwaccess="R"/>
	</register>
