IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_37" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_37" offset="0x94" width="32" description="">
		<bitfield id="DQS_OSC_IN_PROGRESS_STATUS" width="1" begin="24" end="24" resetval="0x0" description="DQS Oscillator is in progress.Set '1' DQS OSC is in progress  READ-ONLY " range="24" rwaccess="R"/> 
		<bitfield id="DQS_OSC_STATUS" width="4" begin="19" end="16" resetval="0x0" description="Holds the overflow and out of variance status associated with the resp. interrupts. Bit [0] set indicates overflow of DQS oscillator,bit [1] set indicates overflow of WCKO oscillator,bit [2]                                              set indicates oov of DQS oscillator,bit [3] set indicates oov of WCKO oscillator. READ-ONLY " range="19 - 16" rwaccess="R"/> 
		<bitfield id="DQS_OSC_BASE_VALUE_1_CS1" width="16" begin="15" end="0" resetval="0x0" description="Base value for device 1 on chip 1. READ-ONLY DEV=1 " range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_38" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_38" offset="0x98" width="32" description="">
		<bitfield id="CA_PARITY_LAT_F0" width="4" begin="27" end="24" resetval="0x0" description="DRAM CA parity latency value in cycles. FC=0 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="ADDITIVE_LAT_F0" width="6" begin="21" end="16" resetval="0x0" description="DRAM additive latency value in cycles. FC=0 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="WRLAT_F0" width="7" begin="14" end="8" resetval="0x0" description="DRAM WRLAT value in cycles. FC=0 " range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="CASLAT_LIN_F0" width="7" begin="6" end="0" resetval="0x0" description="Sets latency from read command send to data receive from/to controller. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller. FC=0 " range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_39" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_39" offset="0x9C" width="32" description="">
		<bitfield id="TMRD_PAR_MAX_PL_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM TMRD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_MAX_PL_F0" width="8" begin="23" end="16" resetval="0x0" description="DRAM TMOD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=0 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRD_PAR_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM TMRD value when CA parity is enabled in cycles. FC=0 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMOD value when CA parity is enabled in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_40" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_40" offset="0xA0" width="32" description="">
		<bitfield id="CA_PARITY_LAT_F1" width="4" begin="27" end="24" resetval="0x0" description="DRAM CA parity latency value in cycles. FC=1 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="ADDITIVE_LAT_F1" width="6" begin="21" end="16" resetval="0x0" description="DRAM additive latency value in cycles. FC=1 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="WRLAT_F1" width="7" begin="14" end="8" resetval="0x0" description="DRAM WRLAT value in cycles. FC=1 " range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="CASLAT_LIN_F1" width="7" begin="6" end="0" resetval="0x0" description="Sets latency from read command send to data receive from/to controller. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller. FC=1 " range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_41" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_41" offset="0xA4" width="32" description="">
		<bitfield id="TMRD_PAR_MAX_PL_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM TMRD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=1 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_MAX_PL_F1" width="8" begin="23" end="16" resetval="0x0" description="DRAM TMOD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=1 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRD_PAR_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TMRD value when CA parity is enabled in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMOD value when CA parity is enabled in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_42" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_42" offset="0xA8" width="32" description="">
		<bitfield id="CA_PARITY_LAT_F2" width="4" begin="27" end="24" resetval="0x0" description="DRAM CA parity latency value in cycles. FC=2 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="ADDITIVE_LAT_F2" width="6" begin="21" end="16" resetval="0x0" description="DRAM additive latency value in cycles. FC=2 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="WRLAT_F2" width="7" begin="14" end="8" resetval="0x0" description="DRAM WRLAT value in cycles. FC=2 " range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="CASLAT_LIN_F2" width="7" begin="6" end="0" resetval="0x0" description="Sets latency from read command send to data receive from/to controller. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller. FC=2 " range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_43" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_43" offset="0xAC" width="32" description="">
		<bitfield id="TMRD_PAR_MAX_PL_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM TMRD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_MAX_PL_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TMOD value with maximum CA parity for frequency copy 2 in cycles. Used during changes of CA parity latency value in DRAM. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRD_PAR_F2" width="8" begin="15" end="8" resetval="0x0" description="DRAM TMRD value when CA parity is enabled in cycles. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMOD_PAR_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMOD value when CA parity is enabled in cycles. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_44" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_44" offset="0xB0" width="32" description="">
		<bitfield id="TRRD_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM TRRD value in cycles. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TCCD_L_F0" width="5" begin="20" end="16" resetval="0x0" description="DRAM CAS-to-CAS value within the same bank group in cycles. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TCCD" width="5" begin="12" end="8" resetval="0x0" description="DRAM CAS-to-CAS value in cycles. " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TBST_INT_INTERVAL" width="3" begin="2" end="0" resetval="0x0" description="DRAM burst interrupt interval value in cycles. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_45" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_45" offset="0xB4" width="32" description="">
		<bitfield id="TRC_F0" width="9" begin="16" end="8" resetval="0x0" description="DRAM TRC value in cycles. FC=0 " range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="TRRD_L_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRRD_L value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
