IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_46" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_46" offset="0xB8" width="32" description="">
		<bitfield id="TWTR_L_F0" width="6" begin="29" end="24" resetval="0x0" description="DRAM TWTR_L value in cycles. FC=0 " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="TWTR_F0" width="6" begin="21" end="16" resetval="0x0" description="DRAM TWTR value in cycles. FC=0 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRAS_MIN_F0" width="9" begin="8" end="0" resetval="0x0" description="DRAM TRAS_MIN value in cycles. FC=0 " range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_47" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_47" offset="0xBC" width="32" description="">
		<bitfield id="TCCD_L_F1" width="5" begin="28" end="24" resetval="0x0" description="DRAM CAS-to-CAS value within the same bank group in cycles. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TFAW_F0" width="9" begin="16" end="8" resetval="0x0" description="DRAM TFAW value in cycles. FC=0 " range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="TRP_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRP value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_48" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_48" offset="0xC0" width="32" description="">
		<bitfield id="TRC_F1" width="9" begin="24" end="16" resetval="0x0" description="DRAM TRC value in cycles. FC=1 " range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="TRRD_L_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TRRD_L value in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRRD_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRRD value in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_49" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_49" offset="0xC4" width="32" description="">
		<bitfield id="TWTR_L_F1" width="6" begin="29" end="24" resetval="0x0" description="DRAM TWTR_L value in cycles. FC=1 " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="TWTR_F1" width="6" begin="21" end="16" resetval="0x0" description="DRAM TWTR value in cycles. FC=1 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRAS_MIN_F1" width="9" begin="8" end="0" resetval="0x0" description="DRAM TRAS_MIN value in cycles. FC=1 " range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_50" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_50" offset="0xC8" width="32" description="">
		<bitfield id="TCCD_L_F2" width="5" begin="28" end="24" resetval="0x0" description="DRAM CAS-to-CAS value within the same bank group in cycles. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TFAW_F1" width="9" begin="16" end="8" resetval="0x0" description="DRAM TFAW value in cycles. FC=1 " range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="TRP_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRP value in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_51" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_51" offset="0xCC" width="32" description="">
		<bitfield id="TRC_F2" width="9" begin="24" end="16" resetval="0x0" description="DRAM TRC value in cycles. FC=2 " range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="TRRD_L_F2" width="8" begin="15" end="8" resetval="0x0" description="DRAM TRRD_L value in cycles. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRRD_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRRD value in cycles. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_52" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_52" offset="0xD0" width="32" description="">
		<bitfield id="TWTR_L_F2" width="6" begin="29" end="24" resetval="0x0" description="DRAM TWTR_L value in cycles. FC=2 " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="TWTR_F2" width="6" begin="21" end="16" resetval="0x0" description="DRAM TWTR value in cycles. FC=2 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRAS_MIN_F2" width="9" begin="8" end="0" resetval="0x0" description="DRAM TRAS_MIN value in cycles. FC=2 " range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_53" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_53" offset="0xD4" width="32" description="">
		<bitfield id="TRTP_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM TRTP value in cycles. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TFAW_F2" width="9" begin="16" end="8" resetval="0x0" description="DRAM TFAW value in cycles. FC=2 " range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="TRP_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRP value in cycles. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_54" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_54" offset="0xD8" width="32" description="">
		<bitfield id="TMOD_F0" width="8" begin="23" end="16" resetval="0x0" description="Number of cycles after MRS command and before any other command. FC=0 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRD_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM TMRD value in cycles. FC=0 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRTP_AP_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRTP for auto-precharge value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_55" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_55" offset="0xDC" width="32" description="">
		<bitfield id="TCKE_F0" width="5" begin="28" end="24" resetval="0x0" description="Minimum CKE pulse width. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TRAS_MAX_F0" width="20" begin="19" end="0" resetval="0x0" description="DRAM TRAS_MAX value in cycles. FC=0 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_56" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_56" offset="0xE0" width="32" description="">
		<bitfield id="TRTP_AP_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM TRTP for auto-precharge value in cycles. FC=1 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TRTP_F1" width="8" begin="23" end="16" resetval="0x0" description="DRAM TRTP value in cycles. FC=1 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TCCDMW_F0" width="6" begin="13" end="8" resetval="0x0" description="DRAM CAS-to-CAS masked write value in cycles. FC=0 " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKESR_F0" width="8" begin="7" end="0" resetval="0x0" description="Minimum CKE low pulse width during a self-refresh. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_57" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_57" offset="0xE4" width="32" description="">
		<bitfield id="TMOD_F1" width="8" begin="15" end="8" resetval="0x0" description="Number of cycles after MRS command and before any other command. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMRD_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMRD value in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_58" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_58" offset="0xE8" width="32" description="">
		<bitfield id="TCKE_F1" width="5" begin="28" end="24" resetval="0x0" description="Minimum CKE pulse width. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TRAS_MAX_F1" width="20" begin="19" end="0" resetval="0x0" description="DRAM TRAS_MAX value in cycles. FC=1 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_59" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_59" offset="0xEC" width="32" description="">
		<bitfield id="TRTP_AP_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM TRTP for auto-precharge value in cycles. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TRTP_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TRTP value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TCCDMW_F1" width="6" begin="13" end="8" resetval="0x0" description="DRAM CAS-to-CAS masked write value in cycles. FC=1 " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKESR_F1" width="8" begin="7" end="0" resetval="0x0" description="Minimum CKE low pulse width during a self-refresh. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
