IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_60" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_60" offset="0xF0" width="32" description="">
		<bitfield id="TMOD_F2" width="8" begin="15" end="8" resetval="0x0" description="Number of cycles after MRS command and before any other command. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMRD_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMRD value in cycles. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_61" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_61" offset="0xF4" width="32" description="">
		<bitfield id="TCKE_F2" width="5" begin="28" end="24" resetval="0x0" description="Minimum CKE pulse width. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TRAS_MAX_F2" width="20" begin="19" end="0" resetval="0x0" description="DRAM TRAS_MAX value in cycles. FC=2 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_62" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_62" offset="0xF8" width="32" description="">
		<bitfield id="TPPD" width="3" begin="18" end="16" resetval="0x4" description="DRAM TPPD value in cycles. " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="TCCDMW_F2" width="6" begin="13" end="8" resetval="0x0" description="DRAM CAS-to-CAS masked write value in cycles. FC=2 " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKESR_F2" width="8" begin="7" end="0" resetval="0x0" description="Minimum CKE low pulse width during a self-refresh. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_63" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_63" offset="0xFC" width="32" description="">
		<bitfield id="TWR_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM TWR value in cycles. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TRCD_F0" width="8" begin="23" end="16" resetval="0x0" description="DRAM TRCD value in cycles. FC=0 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="WRITEINTERP" width="1" begin="8" end="8" resetval="0x0" description="Allow controller to interrupt a write burst to the DRAMs with a read command. Set to 1 to allow interruption. " range="8" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_64" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_64" offset="0x100" width="32" description="">
		<bitfield id="TWR_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM TWR value in cycles. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TRCD_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TRCD value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TWR_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TWR value in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRCD_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRCD value in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_65" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_65" offset="0x104" width="32" description="">
		<bitfield id="TRAS_LOCKOUT" width="1" begin="24" end="24" resetval="0x0" description="IF the DRAM supports it, this allows the controller to execute auto pre-charge commands before the TRAS_MIN parameter expires. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="CONCURRENTAP" width="1" begin="16" end="16" resetval="0x0" description="IF the DRAM supports it, this allows the controller to issue commands to other banks while a bank is in auto pre-charge. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="AP" width="1" begin="8" end="8" resetval="0x0" description="Enable auto pre-charge mode of controller. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="TMRR" width="4" begin="3" end="0" resetval="0x0" description="DRAM TMRR value in cycles. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_66" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_66" offset="0x108" width="32" description="">
		<bitfield id="BSTLEN" width="6" begin="29" end="24" resetval="0x2" description="Encoded burst length sent to DRAMs during initialization. Program to 1 for BL2, program to 2 for BL4, program to 3 for BL8, program to 4 for BL16, or program to 5 for BL32. All other settings are reserved. " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="TDAL_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TDAL value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TDAL_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TDAL value in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TDAL_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TDAL value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_67" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_67" offset="0x10C" width="32" description="">
		<bitfield id="TRP_AB_F0_1" width="8" begin="31" end="24" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TRP_AB_F2_0" width="8" begin="23" end="16" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TRP_AB_F1_0" width="8" begin="15" end="8" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRP_AB_F0_0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_68" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_68" offset="0x110" width="32" description="">
		<bitfield id="ADDRESS_MIRRORING" width="2" begin="25" end="24" resetval="0x0" description="Indicates which chip selects support address mirroring. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="REG_DIMM_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="Enable registered DIMM operation of the controller. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="TRP_AB_F2_1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TRP_AB_F1_1" width="8" begin="7" end="0" resetval="0x0" description="DRAM TRP all bank value in cycles. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_69" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_69" offset="0x114" width="32" description="">
		<bitfield id="NO_MEMORY_DM" width="1" begin="16" end="16" resetval="0x0" description="Indicates that the external DRAM does not support DM masking. Set to 1 for no DM masking at the DRAM. " range="16" rwaccess="R/W"/> 
		<bitfield id="OPTIMAL_RMODW_EN" width="1" begin="0" end="0" resetval="0x0" description="Enables optimized RMODW logic in the controller. A value of 1 enables optimized RMODW operation. All RMODW operations are still supported in a non-optimal manner when the value is 0. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_70" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_70" offset="0x118" width="32" description="">
		<bitfield id="CA_PARITY_ERROR_INJECT" width="26" begin="25" end="0" resetval="0x0" description="Selects bit to corrupt on the CA bus for CA parity error injection. " range="25 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_71" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_71" offset="0x11C" width="32" description="">
		<bitfield id="TREF_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Issue auto-refresh commands to the DRAMs at the interval defined in the TREF parameter. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="AREF_STATUS" width="1" begin="16" end="16" resetval="0x0" description="Indicates a SR error associated with the AREF interrupt. Value of 1 indicates a violation. READ-ONLY " range="16" rwaccess="R"/> 
		<bitfield id="AREFRESH" width="1" begin="8" end="8" resetval="0x0" description="Initiate auto-refresh at the end of the current burst boundary. Set to 1 to trigger. WRITE-ONLY " range="8" rwaccess="W"/> 
		<bitfield id="CA_PARITY_ERROR" width="1" begin="0" end="0" resetval="0x0" description="Contains one hot indication of registered DIMM parity errors. Value of 1 indicates an error on that DIMM. READ-ONLY " range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_72" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_72" offset="0x120" width="32" description="">
		<bitfield id="TRFC_F0" width="10" begin="25" end="16" resetval="0x0" description="DRAM TRFC value in cycles. FC=0 " range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="CS_COMPARISON_FOR_REFRESH_DEPTH" width="6" begin="13" end="8" resetval="0x0" description="Defines the number of entries of the command queue that the refresh logic will consider for sending a refresh command. A non-zero value limits the decode to a subset of the full command pipeline. " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="TRFC_OPT_THRESHOLD" width="3" begin="2" end="0" resetval="0x0" description="Number of clocks before TRFC expires when the refresh task will deassert its request for optimal command to command turn-around timing. " range="2 - 0" rwaccess="R/W"/>
	</register>
