IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_73" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_73" offset="0x124" width="32" description="">
		<bitfield id="TREF_F0" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREF value in cycles. FC=0 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_74" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_74" offset="0x128" width="32" description="">
		<bitfield id="TRFC_F1" width="10" begin="9" end="0" resetval="0x0" description="DRAM TRFC value in cycles. FC=1 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_75" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_75" offset="0x12C" width="32" description="">
		<bitfield id="TREF_F1" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREF value in cycles. FC=1 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_76" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_76" offset="0x130" width="32" description="">
		<bitfield id="TRFC_F2" width="10" begin="9" end="0" resetval="0x0" description="DRAM TRFC value in cycles. FC=2 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_77" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_77" offset="0x134" width="32" description="">
		<bitfield id="TREF_F2" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREF value in cycles. FC=2 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_78" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_78" offset="0x138" width="32" description="">
		<bitfield id="TREF_INTERVAL" width="20" begin="19" end="0" resetval="0x0" description="Defines the cycles between refreshes to different chip selects. " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_79" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_79" offset="0x13C" width="32" description="">
		<bitfield id="TRFC_PB_F0" width="10" begin="9" end="0" resetval="0x0" description="DRAM TRFC_PB value in cycles. FC=0 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_80" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_80" offset="0x140" width="32" description="">
		<bitfield id="TREFI_PB_F0" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREFI_PB value in cycles. FC=0 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_81" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_81" offset="0x144" width="32" description="">
		<bitfield id="TRFC_PB_F1" width="10" begin="9" end="0" resetval="0x0" description="DRAM TRFC_PB value in cycles. FC=1 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_82" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_82" offset="0x148" width="32" description="">
		<bitfield id="TREFI_PB_F1" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREFI_PB value in cycles. FC=1 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_83" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_83" offset="0x14C" width="32" description="">
		<bitfield id="TRFC_PB_F2" width="10" begin="9" end="0" resetval="0x0" description="DRAM TRFC_PB value in cycles. FC=2 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_84" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_84" offset="0x150" width="32" description="">
		<bitfield id="PBR_EN" width="1" begin="24" end="24" resetval="0x0" description="Enables the per-bank refresh feature. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="TREFI_PB_F2" width="20" begin="19" end="0" resetval="0x0" description="DRAM TREFI_PB value in cycles. FC=2 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_85" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_85" offset="0x154" width="32" description="">
		<bitfield id="PBR_BANK_SELECT_DELAY" width="4" begin="27" end="24" resetval="0x0" description="Defines the PBR bank select to command delay, the time from bank selection to when the command queue bank selection logic is guaranteed to have blocked the bank. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PBR_MAX_BANK_WAIT" width="16" begin="23" end="8" resetval="0x0" description="Defines the maximum number of cycles that the PBR module will wait for Strategy to release the target bank until the PBR will assert the inhibit and close the target bank. " range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PBR_NUMERIC_ORDER" width="1" begin="0" end="0" resetval="0x0" description="Enables the PBR to run REFpb commands in numeric bank order [0,1,2,3, etc.] When disabled, the order may be modified if supported by the memory type. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_86" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_86" offset="0x158" width="32" description="">
		<bitfield id="AREF_PBR_CONT_DIS_THRESHOLD" width="5" begin="20" end="16" resetval="0x0" description="Sets the auto-refresh request count threshold when the PBR continuous refresh request enable will be deasserted. " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="AREF_PBR_CONT_EN_THRESHOLD" width="5" begin="12" end="8" resetval="0x0" description="Sets the auto-refresh request count threshold when the PBR continuous refresh request enable will be asserted. " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PBR_CONT_REQ_EN" width="1" begin="0" end="0" resetval="0x0" description="Enables the per-bank refresh continuous request feature. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_87" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_87" offset="0x15C" width="32" description="">
		<bitfield id="TPDEX_F1" width="16" begin="31" end="16" resetval="0x0" description="DRAM TPDEX value in cycles. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TPDEX_F0" width="16" begin="15" end="0" resetval="0x0" description="DRAM TPDEX value in cycles. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
