IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_88" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_88" offset="0x160" width="32" description="">
		<bitfield id="TPDEX_F2" width="16" begin="15" end="0" resetval="0x0" description="DRAM TPDEX value in cycles. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_89" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_89" offset="0x164" width="32" description="">
		<bitfield id="CTL_UNUSED_REG_0" width="32" begin="31" end="0" resetval="0x0" description="Place-holder for register map preservation" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_90" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_90" offset="0x168" width="32" description="">
		<bitfield id="TCKELCS_F0" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKELCS value in cycles. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TMRRI_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TMRRI value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRRI_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM TMRRI value in cycles. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TMRRI_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TMRRI value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_91" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_91" offset="0x16C" width="32" description="">
		<bitfield id="TCKELCS_F1" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKELCS value in cycles. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TZQCKE_F0" width="4" begin="19" end="16" resetval="0x0" description="DRAM TZQCKE value in cycles. FC=0 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRWCKEL_F0" width="5" begin="12" end="8" resetval="0x0" description="DRAM TMRWCKEL value in cycles. FC=0 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKEHCS_F0" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKEHCS value in cycles. FC=0 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_92" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_92" offset="0x170" width="32" description="">
		<bitfield id="TCKELCS_F2" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKELCS value in cycles. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TZQCKE_F1" width="4" begin="19" end="16" resetval="0x0" description="DRAM TZQCKE value in cycles. FC=1 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRWCKEL_F1" width="5" begin="12" end="8" resetval="0x0" description="DRAM TMRWCKEL value in cycles. FC=1 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKEHCS_F1" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKEHCS value in cycles. FC=1 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_93" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_93" offset="0x174" width="32" description="">
		<bitfield id="TCSCKE_F0" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCSCKE value in cycles. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TZQCKE_F2" width="4" begin="19" end="16" resetval="0x0" description="DRAM TZQCKE value in cycles. FC=2 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TMRWCKEL_F2" width="5" begin="12" end="8" resetval="0x0" description="DRAM TMRWCKEL value in cycles. FC=2 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKEHCS_F2" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKEHCS value in cycles. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_94" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_94" offset="0x178" width="32" description="">
		<bitfield id="TCSCKE_F2" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCSCKE value in cycles. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CA_DEFAULT_VAL_F1" width="1" begin="16" end="16" resetval="0x0" description="Defines how unused address/command bits are driven. Set to 1 to use last value or clear to 0 to drive low. FC=1 " range="16" rwaccess="R/W"/> 
		<bitfield id="TCSCKE_F1" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCSCKE value in cycles. FC=1 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CA_DEFAULT_VAL_F0" width="1" begin="0" end="0" resetval="0x0" description="Defines how unused address/command bits are driven. Set to 1 to use last value or clear to 0 to drive low. FC=0 " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_95" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_95" offset="0x17C" width="32" description="">
		<bitfield id="TXSR_F0" width="16" begin="23" end="8" resetval="0x0" description="DRAM TXSR value in cycles. FC=0 " range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="CA_DEFAULT_VAL_F2" width="1" begin="0" end="0" resetval="0x0" description="Defines how unused address/command bits are driven. Set to 1 to use last value or clear to 0 to drive low. FC=2 " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_96" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_96" offset="0x180" width="32" description="">
		<bitfield id="TXSR_F1" width="16" begin="31" end="16" resetval="0x0" description="DRAM TXSR value in cycles. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TXSNR_F0" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXSNR value in cycles. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_97" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_97" offset="0x184" width="32" description="">
		<bitfield id="TXSR_F2" width="16" begin="31" end="16" resetval="0x0" description="DRAM TXSR value in cycles. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TXSNR_F1" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXSNR value in cycles. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
