IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_98" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_98" offset="0x188" width="32" description="">
		<bitfield id="TXPR_F0" width="16" begin="31" end="16" resetval="0x0" description="DRAM TXPR value in cycles. This parameter defines reset exit time from CKE HIGH to a valid command. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TXSNR_F2" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXSNR value in cycles. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_99" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_99" offset="0x18C" width="32" description="">
		<bitfield id="TXPR_F2" width="16" begin="31" end="16" resetval="0x0" description="DRAM TXPR value in cycles. This parameter defines reset exit time from CKE HIGH to a valid command. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TXPR_F1" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXPR value in cycles. This parameter defines reset exit time from CKE HIGH to a valid command. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_100" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_100" offset="0x190" width="32" description="">
		<bitfield id="TCKELCMD_F0" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKELCMD value in cycles. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCSCKEH_F0" width="5" begin="20" end="16" resetval="0x0" description="DRAM TCSCKEH value in cycles. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TESCKE_F0" width="3" begin="10" end="8" resetval="0x0" description="DRAM TESCKE value in cycles. FC=0 " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="TSR_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM TSR value in cycles. FC=0 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_101" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_101" offset="0x194" width="32" description="">
		<bitfield id="TSR_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM TSR value in cycles. FC=1 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKELPD_F0" width="5" begin="20" end="16" resetval="0x0" description="DRAM TCKELPD value in cycles. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TCKCKEL_F0" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCKCKEL value in cycles. FC=0 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKEHCMD_F0" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKEHCMD value in cycles. FC=0 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_102" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_102" offset="0x198" width="32" description="">
		<bitfield id="TCKEHCMD_F1" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKEHCMD value in cycles. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKELCMD_F1" width="5" begin="20" end="16" resetval="0x0" description="DRAM TCKELCMD value in cycles. FC=1 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TCSCKEH_F1" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCSCKEH value in cycles. FC=1 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TESCKE_F1" width="3" begin="2" end="0" resetval="0x0" description="DRAM TESCKE value in cycles. FC=1 " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_103" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_103" offset="0x19C" width="32" description="">
		<bitfield id="TESCKE_F2" width="3" begin="26" end="24" resetval="0x0" description="DRAM TESCKE value in cycles. FC=2 " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="TSR_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM TSR value in cycles. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TCKELPD_F1" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCKELPD value in cycles. FC=1 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKCKEL_F1" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKCKEL value in cycles. FC=1 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_104" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_104" offset="0x1A0" width="32" description="">
		<bitfield id="TCKCKEL_F2" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCKCKEL value in cycles. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKEHCMD_F2" width="5" begin="20" end="16" resetval="0x0" description="DRAM TCKEHCMD value in cycles. FC=2 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TCKELCMD_F2" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCKELCMD value in cycles. FC=2 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCSCKEH_F2" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCSCKEH value in cycles. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_105" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_105" offset="0x1A4" width="32" description="">
		<bitfield id="TCMDCKE_F2" width="5" begin="28" end="24" resetval="0x0" description="DRAM TCMDCKE value in cycles. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCMDCKE_F1" width="5" begin="20" end="16" resetval="0x0" description="DRAM TCMDCKE value in cycles. FC=1 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TCMDCKE_F0" width="5" begin="12" end="8" resetval="0x0" description="DRAM TCMDCKE value in cycles. FC=0 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TCKELPD_F2" width="5" begin="4" end="0" resetval="0x0" description="DRAM TCKELPD value in cycles. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_106" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_106" offset="0x1A8" width="32" description="">
		<bitfield id="CKE_DELAY" width="3" begin="26" end="24" resetval="0x0" description="Additional cycles to delay CKE for status reporting. " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="ENABLE_QUICK_SREFRESH" width="1" begin="16" end="16" resetval="0x0" description="Allow user to interrupt memory initialization to enter self-refresh mode. Set to 1 to allow interruption. " range="16" rwaccess="R/W"/> 
		<bitfield id="SREFRESH_EXIT_NO_REFRESH" width="1" begin="8" end="8" resetval="0x0" description="Disables the automatic refresh request associated with self-refresh exit. Set to 1 to disable. " range="8" rwaccess="R/W"/> 
		<bitfield id="PWRUP_SREFRESH_EXIT" width="1" begin="0" end="0" resetval="0x0" description="Allow powerup via self-refresh instead of full memory initialization. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_107" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_107" offset="0x1AC" width="32" description="">
		<bitfield id="DFS_ZQ_EN" width="1" begin="16" end="16" resetval="0x0" description="Enables ZQ calibration across all ranks during a DFS exit. Set to 1 to enable.  Not valid when operating in ZQ background mode. " range="16" rwaccess="R/W"/> 
		<bitfield id="DFS_STATUS" width="7" begin="14" end="8" resetval="0x0" description="Contains status and interrupt information related to DFS. Bit [0] set indicates that the DFS request from the hardware interface was ignored because param_dfs_enable was zero or because another HWI-initiated DFS operation was already in progress.  Bit [1] set indicates that a DFS operation initiated by the hardware interface was terminated because the PHY did not deassert dfi_init_complete within tDFI_INIT_START after the controller asserted dfi_init_start. Bit [2] set indicates that a hardware interface initiated DFS operation completed successfully. Bit [3] set indicates that the DFS command on the software interface was ignored either because param_dfs_enable was zero or because another SW-initiated DFS operation was already in progress.  Bit [4] set indicates that a DFS operation initiated by the software interface was terminated because the PHY did not deassert dfi_init_complete within tDFI_INIT_START after the controller asserted dfi_init_start.  Bit [5] set indicates that a software initiated DFS operation completed successfully. Bit [6] set indicates that the DFS logic entered the software wait state after a DFS operation completed.  Clear this bit to allow the logic to exit this wait state. " range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="DFS_CMD" width="5" begin="4" end="0" resetval="0x0" description=" lt Currently not supported gt  DFS software command request interface. Bit [0] sends the DFS exit request when set. Bit [1] sends the DFS enter request when set.  Bit [2] tells the controller to gate the memory clock before handing control to the PHY during a DFS operation. Bits [4" range="4 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_108" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_108" offset="0x1B0" width="32" description="">
		<bitfield id="DFS_PROMOTE_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="DFS promotion number of long counts until the high priority request is asserted for frequency copy 1. Applies to SW and HW DFS commands. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DFS_PROMOTE_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="DFS promotion number of long counts until the high priority request is asserted for frequency copy 0. Applies to SW and HW DFS commands. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_109" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_109" offset="0x1B4" width="32" description="">
		<bitfield id="ZQ_STATUS_LOG" width="3" begin="18" end="16" resetval="0x0" description="Indicates what kind of ZQ command was terminated without execution that caused the ZQ status interrupt to assert. Bit [0] correlates to a ZQ cal init, reset, short or long command. Bit [1] correlates to a ZQ cal start command. Bit [2] correlates to a ZQ cal latch command. Value of 1 indicates that that type of command was received, but terminated without execution. READ-ONLY " range="18 - 16" rwaccess="R"/> 
		<bitfield id="DFS_PROMOTE_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="DFS promotion number of long counts until the high priority request is asserted for frequency copy 2. Applies to SW and HW DFS commands. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
