IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_110" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_110" offset="0x1B8" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_111" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_111" offset="0x1BC" width="32" description="">
		<bitfield id="UPD_CTRLUPD_HIGH_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="DFI control update number of long counts until the high priority request is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_NORM_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="DFI control update number of long counts until the normal priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_112" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_112" offset="0x1C0" width="32" description="">
		<bitfield id="UPD_CTRLUPD_SW_PROMOTE_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="DFI control update SW promotion number of long counts until the high priority request is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_TIMEOUT_F0" width="16" begin="15" end="0" resetval="0x0" description="DFI control update number of long counts until the timeout is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_113" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_113" offset="0x1C4" width="32" description="">
		<bitfield id="UPD_CTRLUPD_NORM_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="DFI control update number of long counts until the normal priority request is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_PHYUPD_DFI_PROMOTE_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="DFI PHY update DFI promotion number of long counts until the high priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_114" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_114" offset="0x1C8" width="32" description="">
		<bitfield id="UPD_CTRLUPD_TIMEOUT_F1" width="16" begin="31" end="16" resetval="0x0" description="DFI control update number of long counts until the timeout is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_HIGH_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="DFI control update number of long counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_115" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_115" offset="0x1CC" width="32" description="">
		<bitfield id="UPD_PHYUPD_DFI_PROMOTE_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="DFI PHY update DFI promotion number of long counts until the high priority request is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_SW_PROMOTE_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="DFI control update SW promotion number of long counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_116" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_116" offset="0x1D0" width="32" description="">
		<bitfield id="UPD_CTRLUPD_HIGH_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="DFI control update number of long counts until the high priority request is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_NORM_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="DFI control update number of long counts until the normal priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_117" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_117" offset="0x1D4" width="32" description="">
		<bitfield id="UPD_CTRLUPD_SW_PROMOTE_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="DFI control update SW promotion number of long counts until the high priority request is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="UPD_CTRLUPD_TIMEOUT_F2" width="16" begin="15" end="0" resetval="0x0" description="DFI control update number of long counts until the timeout is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_118" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_118" offset="0x1D8" width="32" description="">
		<bitfield id="UPD_PHYUPD_DFI_PROMOTE_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="DFI PHY update DFI promotion number of long counts until the high priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_119" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_119" offset="0x1DC" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_MAX timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_120" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_120" offset="0x1E0" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE0_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE0 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=0. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
