IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_121" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_121" offset="0x1E4" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE1_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE1 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=1. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_122" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_122" offset="0x1E8" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE2_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE2 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=2. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_123" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_123" offset="0x1EC" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE3_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE3 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=3. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_124" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_124" offset="0x1F0" width="32" description="">
		<bitfield id="PHYMSTR_DFI4_PROMOTE_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="Defines the DFI[4.0 and 4.0v2] PHY master request promotion number of regular [not long] counts until the high priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_125" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_125" offset="0x1F4" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_RESP_F0" width="20" begin="19" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_phymstr_req assertion and a dfi_phymstr_ack assertion. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] to be set to 1 in the PHYMSTR_ERROR_STATUS parameter. FC=0 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_126" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_126" offset="0x1F8" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_MAX timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_127" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_127" offset="0x1FC" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE0_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE0 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=0. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_128" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_128" offset="0x200" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE1_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE1 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=1. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_129" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_129" offset="0x204" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE2_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE2 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=2. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_130" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_130" offset="0x208" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE3_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE3 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=3. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_131" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_131" offset="0x20C" width="32" description="">
		<bitfield id="PHYMSTR_DFI4_PROMOTE_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="Defines the DFI[4.0 and 4.0v2] PHY master request promotion number of regular [not long] counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
