IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_132" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_132" offset="0x210" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_RESP_F1" width="20" begin="19" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_phymstr_req assertion and a dfi_phymstr_ack assertion. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] to be set to 1 in the PHYMSTR_ERROR_STATUS parameter. FC=1 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_133" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_133" offset="0x214" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_MAX timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_134" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_134" offset="0x218" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE0_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE0 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=0. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_135" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_135" offset="0x21C" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE1_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE1 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=1. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_136" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_136" offset="0x220" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE2_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE2 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=2. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_137" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_137" offset="0x224" width="32" description="">
		<bitfield id="TDFI_PHYMSTR_MAX_TYPE3_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI 4.0v2 tPHYMSTR_MAX_TYPE3 timing parameter [in DFI clocks], the maximum cycles that dfi_phymstr_req can be asserted following the assertion of dfi_phymstr_ack for dfi_phymstr_type=3. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_138" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_138" offset="0x228" width="32" description="">
		<bitfield id="PHYMSTR_DFI4_PROMOTE_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="Defines the DFI[4.0 and 4.0v2] PHY master request promotion number of regular [not long] counts until the high priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_139" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_139" offset="0x22C" width="32" description="">
		<bitfield id="PHYMSTR_NO_AREF" width="1" begin="24" end="24" resetval="0x0" description="isables refreshes during the PHY master interface sequence. Set to 1 to disable. Refreshes during reset are only supported for DFI 4.0 and this parameter may be set or cleared for DFI 4.0. For all other DFI versions, this parameter must be set to 1. " range="24" rwaccess="R/W"/> 
		<bitfield id="TDFI_PHYMSTR_RESP_F2" width="20" begin="19" end="0" resetval="0x0" description="Defines the DFI tPHYMSTR_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_phymstr_req assertion and a dfi_phymstr_ack assertion. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] to be set to 1 in the PHYMSTR_ERROR_STATUS parameter. FC=2 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_140" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_140" offset="0x230" width="32" description="">
		<bitfield id="PHYMSTR_TRAIN_AFTER_INIT_COMPLETE" width="1" begin="16" end="16" resetval="0x0" description="Defines how the PHY will use the PHY Master Interface for training. Clear to 0 to perform training without the PHY Master Interface, or set to 1 to use the PHY Master Interface to gain control over the DFI bus after the dfi_init_complete signal assertion for the initial training. Default is cleared to 0. " range="16" rwaccess="R/W"/> 
		<bitfield id="PHYMSTR_DFI_VERSION_4P0V1" width="1" begin="8" end="8" resetval="0x0" description="Defines the version of the DFI 4.0 specification supported. Clear to 0 for DFI 4.0 version 2 PHY Master Interface, or set to 1 for DFI 4.0 version 1 PHY Master Interface. Default is cleared to 0 for version 2. " range="8" rwaccess="R/W"/> 
		<bitfield id="PHYMSTR_ERROR_STATUS" width="2" begin="1" end="0" resetval="0x0" description="Identifies the source of any DFI PHY Master Interface errors. Value of 1 indicates a timing violation of the associated timing parameter. Bit [0] set indicates a TDFI_PHYMSTR_MAX or TDFI_PHYMSTR_TYPEn_MAX parmaeter violation and bit [1] set indicates a TDFI_PHYMSTR_RESP parameter violation. READ-ONLY " range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_141" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_141" offset="0x234" width="32" description="">
		<bitfield id="MRR_TEMPCHK_NORM_THRESHOLD_F0" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the normal priority request is asserted. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_142" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_142" offset="0x238" width="32" description="">
		<bitfield id="MRR_TEMPCHK_HIGH_THRESHOLD_F0" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the high priority request is asserted. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_143" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_143" offset="0x23C" width="32" description="">
		<bitfield id="MRR_TEMPCHK_TIMEOUT_F0" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the timeout is asserted. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
