IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_144" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_144" offset="0x240" width="32" description="">
		<bitfield id="MRR_TEMPCHK_NORM_THRESHOLD_F1" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the normal priority request is asserted. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_145" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_145" offset="0x244" width="32" description="">
		<bitfield id="MRR_TEMPCHK_HIGH_THRESHOLD_F1" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the high priority request is asserted. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_146" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_146" offset="0x248" width="32" description="">
		<bitfield id="MRR_TEMPCHK_TIMEOUT_F1" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the timeout is asserted. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_147" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_147" offset="0x24C" width="32" description="">
		<bitfield id="MRR_TEMPCHK_NORM_THRESHOLD_F2" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the normal priority request is asserted. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_148" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_148" offset="0x250" width="32" description="">
		<bitfield id="MRR_TEMPCHK_HIGH_THRESHOLD_F2" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the high priority request is asserted. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_149" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_149" offset="0x254" width="32" description="">
		<bitfield id="PPR_CONTROL" width="1" begin="24" end="24" resetval="0x0" description="Enables the post-package repair feature. Set to 1 to enable. This parameter may only be programmed before initialization begins. " range="24" rwaccess="R/W"/> 
		<bitfield id="MRR_TEMPCHK_TIMEOUT_F2" width="24" begin="23" end="0" resetval="0x0" description="MRR temp check number of long counts until the timeout is asserted. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_150" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_150" offset="0x258" width="32" description="">
		<bitfield id="PPR_COMMAND_MRW_REGNUM" width="8" begin="15" end="8" resetval="0x0" description="Specifies the mode register to be used. Clear to 0 for MRW0 or program to 4 for MRW4. All other values are reserved.. " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PPR_COMMAND" width="3" begin="2" end="0" resetval="0x0" description="Specifies the type of PPR command. Program to 1 for pre-charge all, program to 2 for MRW, program to 3 for activate, or program to 5 for write. All other values are reserved. WRITE-ONLY " range="2 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_151" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_151" offset="0x25C" width="32" description="">
		<bitfield id="PPR_COMMAND_MRW_DATA" width="17" begin="16" end="0" resetval="0x0" description="Specifies the data for the mode register write. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_152" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_152" offset="0x260" width="32" description="">
		<bitfield id="PPR_BANK_ADDRESS" width="4" begin="27" end="24" resetval="0x0" description="Specifies the bank for the row to be repaired. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PPR_ROW_ADDRESS" width="17" begin="16" end="0" resetval="0x0" description="Specifies the encoded row address to be repaired. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_153" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_153" offset="0x264" width="32" description="">
		<bitfield id="PPR_CS_ADDRESS" width="1" begin="0" end="0" resetval="0x0" description="Specifies the chip select for the row to be repaired. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_154" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_154" offset="0x268" width="32" description="">
		<bitfield id="PPR_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="Holds the data pattern to be written to memory for all data phases. This is specific to DDR4 memories. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_155" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_155" offset="0x26C" width="32" description="">
		<bitfield id="PPR_DATA_1" width="32" begin="31" end="0" resetval="0x0" description="Holds the data pattern to be written to memory for all data phases. This is specific to DDR4 memories. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_156" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_156" offset="0x270" width="32" description="">
		<bitfield id="CKSRX_F0" width="8" begin="31" end="24" resetval="0x0" description="Clock stable delay on self-refresh exit. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="CKSRE_F0" width="8" begin="23" end="16" resetval="0x0" description="Clock hold delay on self-refresh entry. FC=0 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="FM_OVRIDE_CONTROL" width="1" begin="8" end="8" resetval="0x0" description="Enables the FM Override feature. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="PPR_STATUS" width="2" begin="1" end="0" resetval="0x0" description="Reports the status of the PPR operation. Bit [0] set indicates that PPR operations are now allowed and bit [1] set indicates if the last PPR command is complete. READ-ONLY " range="1 - 0" rwaccess="R"/>
	</register>
