IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_157" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_157" offset="0x274" width="32" description="">
		<bitfield id="CKSRX_F2" width="8" begin="31" end="24" resetval="0x0" description="Clock stable delay on self-refresh exit. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="CKSRE_F2" width="8" begin="23" end="16" resetval="0x0" description="Clock hold delay on self-refresh entry. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="CKSRX_F1" width="8" begin="15" end="8" resetval="0x0" description="Clock stable delay on self-refresh exit. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="CKSRE_F1" width="8" begin="7" end="0" resetval="0x0" description="Clock hold delay on self-refresh entry. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_158" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_158" offset="0x278" width="32" description="">
		<bitfield id="LPI_SR_SHORT_WAKEUP_F0" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when LPDDR4 memory is in the self-refresh short state [with or without memory clock gating]. For LPDDR4, SR_SHORT is used to send few commands so this wakeup time must be cleared to ZERO and no LPI request needs to be asserted. FC=0 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_IDLE_WAKEUP_F0" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_CTRL_WAKEUP timing parameter [in DFI clocks] to be driven when controller is idle. FC=0 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LP_CMD" width="7" begin="14" end="8" resetval="0x0" description="Low power software command request interface. Bit [0] controls exit, bit [1] controls entry, bits [4:2] define the low power state, bit [5] controls memory clock gating, bit [6] controls controller clock gating, and bit [7] controls lock. WRITE-ONLY " range="14 - 8" rwaccess="W"/> 
		<bitfield id="LOWPOWER_REFRESH_ENABLE" width="2" begin="1" end="0" resetval="0x0" description="Enable refreshes while in low power mode. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to disable. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_159" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_159" offset="0x27C" width="32" description="">
		<bitfield id="LPI_SRPD_SHORT_WAKEUP_F0" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down short state [with or without memory clock gating]. FC=0 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_PD_WAKEUP_F0" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in any of the power-down states [with or without memory clock gating]. FC=0 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_LONG_MCCLK_GATE_WAKEUP_F0" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long with memory and controller clock gating state. FC=0 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_LONG_WAKEUP_F0" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long state [with or without memory clock gating]. FC=0 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_160" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_160" offset="0x280" width="32" description="">
		<bitfield id="LPI_IDLE_WAKEUP_F1" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_CTRL_WAKEUP timing parameter [in DFI clocks] to be driven when controller is idle. FC=1 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_TIMER_WAKEUP_F0" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when the LPI timer expires. FC=0 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_LONG_MCCLK_GATE_WAKEUP_F0" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long with memory and controller clock gating state. FC=0 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_LONG_WAKEUP_F0" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long state [with or without memory clock gating]. FC=0 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_161" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_161" offset="0x284" width="32" description="">
		<bitfield id="LPI_PD_WAKEUP_F1" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in any of the power-down states [with or without memory clock gating]. FC=1 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_LONG_MCCLK_GATE_WAKEUP_F1" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long with memory and controller clock gating state. FC=1 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_LONG_WAKEUP_F1" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long state [with or without memory clock gating]. FC=1 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_SHORT_WAKEUP_F1" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when LPDDR4 memory is in the self-refresh short state [with or without memory clock gating]. For LPDDR4, SR_SHORT is used to send few commands so this wakeup time must be cleared to ZERO and no LPI request needs to be asserted. FC=1 " range="3 - 0" rwaccess="R/W"/>
	</register>
