IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_162" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_162" offset="0x288" width="32" description="">
		<bitfield id="LPI_TIMER_WAKEUP_F1" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when the LPI timer expires. FC=1 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_LONG_MCCLK_GATE_WAKEUP_F1" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long with memory and controller clock gating state. FC=1 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_LONG_WAKEUP_F1" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long state [with or without memory clock gating]. FC=1 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_SHORT_WAKEUP_F1" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down short state [with or without memory clock gating]. FC=1 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_163" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_163" offset="0x28C" width="32" description="">
		<bitfield id="LPI_SR_LONG_MCCLK_GATE_WAKEUP_F2" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long with memory and controller clock gating state. FC=2 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_LONG_WAKEUP_F2" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh long state [with or without memory clock gating]. FC=2 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SR_SHORT_WAKEUP_F2" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when LPDDR4 memory is in the self-refresh short state [with or without memory clock gating]. For LPDDR4, SR_SHORT is used to send few commands so this wakeup time must be cleared to ZERO and no LPI request needs to be asserted. FC=2 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_IDLE_WAKEUP_F2" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_CTRL_WAKEUP timing parameter [in DFI clocks] to be driven when controller is idle. FC=2 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_164" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_164" offset="0x290" width="32" description="">
		<bitfield id="LPI_SRPD_LONG_MCCLK_GATE_WAKEUP_F2" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long with memory and controller clock gating state. FC=2 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_LONG_WAKEUP_F2" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down long state [with or without memory clock gating]. FC=2 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_SRPD_SHORT_WAKEUP_F2" width="4" begin="11" end="8" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in the self-refresh power-down short state [with or without memory clock gating]. FC=2 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_PD_WAKEUP_F2" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when memory is in any of the power-down states [with or without memory clock gating]. FC=2 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_165" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_165" offset="0x294" width="32" description="">
		<bitfield id="LPI_CTRL_REQ_EN" width="1" begin="16" end="16" resetval="0x0" description="Enables the dfi_lpi_ctrl_req signal for the LPI. This signal is only relevant for DFI versions 3.1 and beyond. Set to 1 to enable or clear to 0 to disable. " range="16" rwaccess="R/W"/> 
		<bitfield id="LPI_WAKEUP_EN" width="6" begin="13" end="8" resetval="0x0" description="Enables the various low power state wakeup parameters for LPI request uses. Bit [0] enables controller idle wakeup, bit [1] enables power-down wakeup, bit [2] enables either self-refresh short, self-refresh long with or without mem clk gating, either self-refresh power-down short, or self-refresh power-down long with or without mem clk gating, bit [3] enables self-refresh long with mem and ctlr clk gating or self-refresh power-down long with mem and ctlr clk gating, bit [4] enables the LPI timer expire wakeup, and bit [5] is reserved. Set each bit to 1 to enable the respective LP_WAKEUP value for the LPI request. " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="LPI_TIMER_WAKEUP_F2" width="4" begin="3" end="0" resetval="0x0" description="Defines the DFI tLP_WAKEUP timing parameter [in DFI clocks] to be driven when the LPI timer expires. FC=2 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_166" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_166" offset="0x298" width="32" description="">
		<bitfield id="LPI_WAKEUP_TIMEOUT" width="12" begin="27" end="16" resetval="0x0" description="Defines the LPI timeout time, the maximum cycles between a dfi_lp_req de-assertion and a dfi_lp_ack de-assertion. If this value is exceeded, an interrupt will occur. " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="LPI_TIMER_COUNT" width="12" begin="11" end="0" resetval="0x0" description="Defines the LPI timer count. " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_167" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_167" offset="0x29C" width="32" description="">
		<bitfield id="LP_AUTO_EXIT_EN" width="4" begin="27" end="24" resetval="0x0" description="Enable auto exit from each of the low power states when a read or write command enters the command queue. Bit [0] controls power-down, bit [1] controls self-refresh long or self-refresh power-down long, bit [2] controls self-refresh long with memory and controller clock gating or self-refresh power-down long with memory and controller clock gating, and bit [3] controls self-refresh short or self-refresh power-down short. Set each bit to 1 to enable. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="LP_AUTO_ENTRY_EN" width="4" begin="19" end="16" resetval="0x0" description="Enable auto entry into each of the low power states when the associated idle timer expires. Bit [0] controls power-down, bit [1] controls self-refresh long or self-refresh power-down long, bit [2] controls self-refresh long with memory and controller clock gating or self-refresh power-down long with memory and controller clock gating, and bit [3] controls self-refresh short or self-refresh power-down short. Set each bit to 1 to enable. " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="LP_STATE" width="7" begin="14" end="8" resetval="0x64" description="Low power state status parameter. Bits [5:0] indicate the current low power state and bit [6] set indicates that status bits are valid. READ-ONLY " range="14 - 8" rwaccess="R"/> 
		<bitfield id="TDFI_LP_RESP" width="3" begin="2" end="0" resetval="0x0" description="Defines the DFI tLP_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_lp_req assertion and a dfi_lp_ack assertion. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_168" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_168" offset="0x2A0" width="32" description="">
		<bitfield id="LP_AUTO_PD_IDLE" width="12" begin="19" end="8" resetval="0x0" description="Defines the idle time [in controller clocks] until the controller will automatically issue an entry into one of the power-down low power states. " range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="LP_AUTO_MEM_GATE_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable memory clock gating when entering a low power state via the auto low power counters. Bit [0] controls power-down, bit [1] controls self-refresh long or self-refresh power-down long, and bit [2] controls self-refresh short or self-refresh power-down short. Set each bit to 1 to enable. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_169" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_169" offset="0x2A4" width="32" description="">
		<bitfield id="LP_AUTO_SR_LONG_MC_GATE_IDLE" width="8" begin="31" end="24" resetval="0x0" description="Defines the idle time [in long counts] until the controller will automatically issue an entry into the self-refresh long with memory and controller clock gating or self-refresh power-down long with memory and controller clock gating low power states. " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="LP_AUTO_SR_LONG_IDLE" width="8" begin="23" end="16" resetval="0x0" description="Defines the idle time [in long counts] until the controller will automatically issue an entry into the self-refresh long or self-refresh power-down long [with or without memory clock gating] low power states. " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="LP_AUTO_SR_SHORT_IDLE" width="12" begin="11" end="0" resetval="0x0" description="Defines the idle time [in controller clocks] until the controller will automatically issue an entry into the self-refresh short or self-refresh power-down short [with or without memory clock gating] low power states. " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_170" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_170" offset="0x2A8" width="32" description="">
		<bitfield id="HW_PROMOTE_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="HW interface promotion number of long counts until the high priority request is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="HW_PROMOTE_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="HW interface promotion number of long counts until the high priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
