IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_171" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_171" offset="0x2AC" width="32" description="">
		<bitfield id="LPC_PROMOTE_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="LPC promotion number of long counts until the high priority request is asserted for frequency copy 2. Applies to SW and auto low power commands. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="HW_PROMOTE_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="HW interface promotion number of long counts until the high priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_172" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_172" offset="0x2B0" width="32" description="">
		<bitfield id="LPC_PROMOTE_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="LPC promotion number of long counts until the high priority request is asserted for frequency copy 2. Applies to SW and auto low power commands. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="LPC_PROMOTE_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="LPC promotion number of long counts until the high priority request is asserted for frequency copy 2. Applies to SW and auto low power commands. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_173" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_173" offset="0x2B4" width="32" description="">
		<bitfield id="LPC_SR_EXIT_CMD_EN" width="1" begin="24" end="24" resetval="0x0" description="Enable LPC to execute any of the commands on self-refresh exit while exiting. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="LPC_SR_PHYMSTR_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable LPC to execute a DFI PHY Master request on a self-refresh exit sequence. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="LPC_SR_PHYUPD_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable LPC to execute a DFI PHY update on a self-refresh exit sequence. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="LPC_SR_CTRLUPD_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable LPC to execute a DFI control update on a self-refresh exit sequence. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_174" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_174" offset="0x2B8" width="32" description="">
		<bitfield id="DFS_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Enable hardware dynamic frequency scaling. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="PWRDN_SHIFT_DELAY" width="9" begin="16" end="8" resetval="0x0" description="This parameter should be programmed to zero. Manual adjustment of inhibit_pwrdn_shift in memcd_strategy_data_delay. " range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="LPC_SR_ZQ_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable LPC to execute a ZQ calibration on a self-refresh exit sequence. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_175" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_175" offset="0x2BC" width="32" description="">
		<bitfield id="DFS_PHY_REG_WRITE_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable a register write to the PHY during a frequency change. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="DFS_DLL_OFF" width="3" begin="2" end="0" resetval="0x0" description="Defines if the memory DLL must be off for the associated frequency set. Bit [0] corresponds to frequency set 0, bit [1] corresponds to frequency set 1, etc. Set each bit to 1 to require DLL off. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_176" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_176" offset="0x2C0" width="32" description="">
		<bitfield id="DFS_PHY_REG_WRITE_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Register address which will be written during a frequency change. Must be a PHY register address. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_177" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_177" offset="0x2C4" width="32" description="">
		<bitfield id="CURRENT_REG_COPY" width="2" begin="25" end="24" resetval="0x0" description="Indicates the current copy of timing parameters that is in use by the controller. " range="25 - 24" rwaccess="R"/> 
		<bitfield id="DFS_PHY_REG_WRITE_WAIT" width="16" begin="23" end="8" resetval="0x0" description="Defines the number of DFI PHY clocks that the controller will wait after issuing the register write to the PHY during a frequency change. " range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="DFS_PHY_REG_WRITE_MASK" width="4" begin="3" end="0" resetval="0x0" description="Register mask which will be written during a frequency change. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_178" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_178" offset="0x2C8" width="32" description="">
		<bitfield id="DFIBUS_BOOT_FREQ" width="2" begin="9" end="8" resetval="0x0" description="Defines the DFI bus boot frequency register copy " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="INIT_FREQ" width="2" begin="1" end="0" resetval="0x0" description="Specifies what frequency register copy will be in use by the memory after initialization completes. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_179" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_179" offset="0x2CC" width="32" description="">
		<bitfield id="DFS_PHY_REG_WRITE_DATA_F0" width="32" begin="31" end="0" resetval="0x0" description="Register data which will be written during a frequency change. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
