IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_180" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_180" offset="0x2D0" width="32" description="">
		<bitfield id="DFS_PHY_REG_WRITE_DATA_F1" width="32" begin="31" end="0" resetval="0x0" description="Register data which will be written during a frequency change. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_181" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_181" offset="0x2D4" width="32" description="">
		<bitfield id="DFS_PHY_REG_WRITE_DATA_F2" width="32" begin="31" end="0" resetval="0x0" description="Register data which will be written during a frequency change. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_182" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_182" offset="0x2D8" width="32" description="">
		<bitfield id="TDFI_INIT_START_F0" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks], the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_183" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_183" offset="0x2DC" width="32" description="">
		<bitfield id="TDFI_INIT_COMPLETE_F0" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks], the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY. FC=0 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_184" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_184" offset="0x2E0" width="32" description="">
		<bitfield id="TDFI_INIT_START_F1" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks], the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_185" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_185" offset="0x2E4" width="32" description="">
		<bitfield id="TDFI_INIT_COMPLETE_F1" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks], the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY. FC=1 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_186" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_186" offset="0x2E8" width="32" description="">
		<bitfield id="TDFI_INIT_START_F2" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks], the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_187" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_187" offset="0x2EC" width="32" description="">
		<bitfield id="TDFI_INIT_COMPLETE_F2" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks], the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY. FC=2 " range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_188" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_188" offset="0x2F0" width="32" description="">
		<bitfield id="WRITE_MODEREG" width="27" begin="26" end="0" resetval="0x0" description="Write memory mode register data to the DRAMs. Bits [7:0] define the memory mode register number if bit [23] is set, bits [15:8] define the chip select if bit [24] is clear, bits [23:16] define which memory mode register/s to write, bit [24] defines whether all chip selects will be written, and bit [25] triggers the write. " range="26 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_189" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_189" offset="0x2F4" width="32" description="">
		<bitfield id="READ_MODEREG" width="17" begin="24" end="8" resetval="0x0" description="Read the specified memory mode register from specified chip when start bit set. Bits [7:0] define the memory mode register and bits [15:8] define the chip select. Set bit [16] to 1 to trigger. " range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="MRW_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Write memory mode register status. Bit [0] set indicates a WRITE_MODEREG parameter programming error. Bit [1] set indicates a PASR error. Bit [2] is Reserved. Bit [3] set indicates a self-refresh or deep power-down error. Bit [4] set indicates that a write to MR3 or MR11 was attempted [WRITE_MODEREG bit [25] was asserted with bit [17] set, or bit [23] was asserted with bits [7:0] defining MR3 or MR11] during tZQCAL after a ZQ calibration start command. READ-ONLY " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_190" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_190" offset="0x2F8" width="32" description="">
		<bitfield id="AUTO_TEMPCHK_VAL_0" width="8" begin="31" end="24" resetval="0x0" description="MR4 data for all devices accessed by automatic MRR commands. Bits [3:0] correlate to the device on the lower byte, bits [7:4] correlate to the devices on the 2nd byte etc. Value indicates the OP7, OP2, OP1 and OP0 bits. READ-ONLY. " range="31 - 24" rwaccess="R"/> 
		<bitfield id="PERIPHERAL_MRR_DATA" width="24" begin="23" end="0" resetval="0x0" description="Data and chip returned from memory mode register read requested by the READ_MODEREG parameter. Bits [7:0] indicate the read data and bits [15:8] indicate the chip. READ-ONLY " range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_191" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_191" offset="0x2FC" width="32" description="">
		<bitfield id="MRW_DFS_UPDATE_FRC" width="2" begin="17" end="16" resetval="0x0" description="Defines the frequency register set to use when doing a software MRW with WRITE_MODEREG bit [26]. " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="DISABLE_UPDATE_TVRCG" width="1" begin="8" end="8" resetval="0x0" description="Bypass changing for TVRCG during a DFS operation. Set to 1 to skip TVRCG. " range="8" rwaccess="R/W"/> 
		<bitfield id="AUTO_TEMPCHK_VAL_1" width="8" begin="7" end="0" resetval="0x0" description="MR4 data for all devices accessed by automatic MRR commands. Bits [3:0] correlate to the device on the lower byte, bits [7:4] correlate to the devices on the 2nd byte etc. Value indicates the OP7, OP2, OP1 and OP0 bits. READ-ONLY. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_192" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_192" offset="0x300" width="32" description="">
		<bitfield id="TVRCG_DISABLE_F0" width="10" begin="25" end="16" resetval="0x0" description="JEDEC TVRCG_DISABLE time. FC=0 " range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TVRCG_ENABLE_F0" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TVRCG_ENABLE time. FC=0 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_193" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_193" offset="0x304" width="32" description="">
		<bitfield id="TCKFSPX_F0" width="5" begin="28" end="24" resetval="0x0" description="JEDEC TCKFSPX, the frequency set point switching time. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKFSPE_F0" width="5" begin="20" end="16" resetval="0x0" description="JEDEC TCKFSPE, the frequency set point switching time. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TFC_F0" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TFC, the frequency set point switching time. FC=0 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_194" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_194" offset="0x308" width="32" description="">
		<bitfield id="TVREF_LONG_F0" width="20" begin="19" end="0" resetval="0x0" description="JEDEC TVREF, design will always use the long value. FC=0 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_195" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_195" offset="0x30C" width="32" description="">
		<bitfield id="TVRCG_DISABLE_F1" width="10" begin="25" end="16" resetval="0x0" description="JEDEC TVRCG_DISABLE time. FC=1 " range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TVRCG_ENABLE_F1" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TVRCG_ENABLE time. FC=1 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_196" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_196" offset="0x310" width="32" description="">
		<bitfield id="TCKFSPX_F1" width="5" begin="28" end="24" resetval="0x0" description="JEDEC TCKFSPX, the frequency set point switching time. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKFSPE_F1" width="5" begin="20" end="16" resetval="0x0" description="JEDEC TCKFSPE, the frequency set point switching time. FC=1 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TFC_F1" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TFC, the frequency set point switching time. FC=1 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_197" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_197" offset="0x314" width="32" description="">
		<bitfield id="TVREF_LONG_F1" width="20" begin="19" end="0" resetval="0x0" description="JEDEC TVREF, design will always use the long value. FC=1 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_198" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_198" offset="0x318" width="32" description="">
		<bitfield id="TVRCG_DISABLE_F2" width="10" begin="25" end="16" resetval="0x0" description="JEDEC TVRCG_DISABLE time. FC=2 " range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TVRCG_ENABLE_F2" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TVRCG_ENABLE time. FC=2 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_199" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_199" offset="0x31C" width="32" description="">
		<bitfield id="TCKFSPX_F2" width="5" begin="28" end="24" resetval="0x0" description="JEDEC TCKFSPX, the frequency set point switching time. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="TCKFSPE_F2" width="5" begin="20" end="16" resetval="0x0" description="JEDEC TCKFSPE, the frequency set point switching time. FC=2 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="TFC_F2" width="10" begin="9" end="0" resetval="0x0" description="JEDEC TFC, the frequency set point switching time. FC=2 " range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_200" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_200" offset="0x320" width="32" description="">
		<bitfield id="TVREF_LONG_F2" width="20" begin="19" end="0" resetval="0x0" description="JEDEC TVREF, design will always use the long value. FC=2 " range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_201" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_201" offset="0x324" width="32" description="">
		<bitfield id="MRR_PROMOTE_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="MRR promotion number of long counts until the high priority request is asserted. Applies to SW MRR commands. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="MRR_PROMOTE_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="MRR promotion number of long counts until the high priority request is asserted. Applies to SW MRR commands. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_202" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_202" offset="0x328" width="32" description="">
		<bitfield id="MRW_PROMOTE_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="MRW promotion number of long counts until the high priority request is asserted. Applies to SW MRW commands. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="MRR_PROMOTE_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="MRR promotion number of long counts until the high priority request is asserted. Applies to SW MRR commands. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_203" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_203" offset="0x32C" width="32" description="">
		<bitfield id="MRW_PROMOTE_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="MRW promotion number of long counts until the high priority request is asserted. Applies to SW MRW commands. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="MRW_PROMOTE_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="MRW promotion number of long counts until the high priority request is asserted. Applies to SW MRW commands. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_204" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_204" offset="0x330" width="32" description="">
		<bitfield id="MR0_DATA_F0_0" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register 0. FC=0 " range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="MR4_DLL_RST" width="1" begin="0" end="0" resetval="0x0" description="Asserted if DRAM DLL Reset bit resides in MR4. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_205" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_205" offset="0x334" width="32" description="">
		<bitfield id="MR1_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_206" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_206" offset="0x338" width="32" description="">
		<bitfield id="MR2_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
