IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_207" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_207" offset="0x33C" width="32" description="">
		<bitfield id="MR0_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_208" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_208" offset="0x340" width="32" description="">
		<bitfield id="MR1_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_209" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_209" offset="0x344" width="32" description="">
		<bitfield id="MR2_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_210" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_210" offset="0x348" width="32" description="">
		<bitfield id="MR0_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_211" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_211" offset="0x34C" width="32" description="">
		<bitfield id="MR1_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_212" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_212" offset="0x350" width="32" description="">
		<bitfield id="MR2_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_213" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_213" offset="0x354" width="32" description="">
		<bitfield id="MR0_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_214" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_214" offset="0x358" width="32" description="">
		<bitfield id="MR1_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_215" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_215" offset="0x35C" width="32" description="">
		<bitfield id="MR2_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_216" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_216" offset="0x360" width="32" description="">
		<bitfield id="MR0_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_217" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_217" offset="0x364" width="32" description="">
		<bitfield id="MR1_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_218" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_218" offset="0x368" width="32" description="">
		<bitfield id="MR2_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_219" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_219" offset="0x36C" width="32" description="">
		<bitfield id="MR0_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_220" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_220" offset="0x370" width="32" description="">
		<bitfield id="MR1_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_221" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_221" offset="0x374" width="32" description="">
		<bitfield id="MR2_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_222" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_222" offset="0x378" width="32" description="">
		<bitfield id="MRSINGLE_DATA_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register single write. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_223" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_223" offset="0x37C" width="32" description="">
		<bitfield id="MRSINGLE_DATA_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register single write. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_224" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_224" offset="0x380" width="32" description="">
		<bitfield id="MR3_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_225" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_225" offset="0x384" width="32" description="">
		<bitfield id="MR3_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_226" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_226" offset="0x388" width="32" description="">
		<bitfield id="MR3_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_227" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_227" offset="0x38C" width="32" description="">
		<bitfield id="MR3_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_228" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_228" offset="0x390" width="32" description="">
		<bitfield id="MR3_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_229" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_229" offset="0x394" width="32" description="">
		<bitfield id="MR3_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_230" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_230" offset="0x398" width="32" description="">
		<bitfield id="MR4_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
