IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_231" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_231" offset="0x39C" width="32" description="">
		<bitfield id="MR4_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_232" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_232" offset="0x3A0" width="32" description="">
		<bitfield id="MR4_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_233" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_233" offset="0x3A4" width="32" description="">
		<bitfield id="MR4_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_234" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_234" offset="0x3A8" width="32" description="">
		<bitfield id="MR4_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_235" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_235" offset="0x3AC" width="32" description="">
		<bitfield id="MR4_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_236" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_236" offset="0x3B0" width="32" description="">
		<bitfield id="MR5_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_237" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_237" offset="0x3B4" width="32" description="">
		<bitfield id="MR5_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_238" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_238" offset="0x3B8" width="32" description="">
		<bitfield id="MR5_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_239" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_239" offset="0x3BC" width="32" description="">
		<bitfield id="MR5_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_240" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_240" offset="0x3C0" width="32" description="">
		<bitfield id="MR5_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_241" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_241" offset="0x3C4" width="32" description="">
		<bitfield id="MR5_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_242" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_242" offset="0x3C8" width="32" description="">
		<bitfield id="MR6_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_243" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_243" offset="0x3CC" width="32" description="">
		<bitfield id="MR6_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_244" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_244" offset="0x3D0" width="32" description="">
		<bitfield id="MR6_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_245" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_245" offset="0x3D4" width="32" description="">
		<bitfield id="MR6_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_246" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_246" offset="0x3D8" width="32" description="">
		<bitfield id="MR6_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_247" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_247" offset="0x3DC" width="32" description="">
		<bitfield id="MR8_DATA_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 8 for each chip select. READ-ONLY. " range="31 - 24" rwaccess="R"/> 
		<bitfield id="MR6_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_248" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_248" offset="0x3E0" width="32" description="">
		<bitfield id="MR10_DATA_F0_0" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register 10. FC=0 " range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="MR8_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 8 for each chip select. READ-ONLY. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_249" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_249" offset="0x3E4" width="32" description="">
		<bitfield id="MR10_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 10. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_250" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_250" offset="0x3E8" width="32" description="">
		<bitfield id="MR10_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 10. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_251" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_251" offset="0x3EC" width="32" description="">
		<bitfield id="MR10_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 10. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_252" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_252" offset="0x3F0" width="32" description="">
		<bitfield id="MR10_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 10. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_253" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_253" offset="0x3F4" width="32" description="">
		<bitfield id="MR11_DATA_F0_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="MR10_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 10. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
