IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_254" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_254" offset="0x3F8" width="32" description="">
		<bitfield id="MR11_DATA_F1_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11. FC=1 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="MR11_DATA_F0_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 11. FC=0 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="MR11_DATA_F2_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 11. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MR11_DATA_F1_0" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 11. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_255" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_255" offset="0x3FC" width="32" description="">
		<bitfield id="MR12_DATA_F0_0" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register 12. FC=0 " range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="MR11_DATA_F2_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 11. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_256" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_256" offset="0x400" width="32" description="">
		<bitfield id="MR12_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 12. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_257" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_257" offset="0x404" width="32" description="">
		<bitfield id="MR12_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 12. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_258" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_258" offset="0x408" width="32" description="">
		<bitfield id="MR12_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 12. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_259" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_259" offset="0x40C" width="32" description="">
		<bitfield id="MR12_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 12. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_260" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_260" offset="0x410" width="32" description="">
		<bitfield id="MR12_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 12. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_261" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_261" offset="0x414" width="32" description="">
		<bitfield id="MR13_DATA_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 13. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_262" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_262" offset="0x418" width="32" description="">
		<bitfield id="MR13_DATA_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 13. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_263" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_263" offset="0x41C" width="32" description="">
		<bitfield id="MR14_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_264" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_264" offset="0x420" width="32" description="">
		<bitfield id="MR14_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_265" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_265" offset="0x424" width="32" description="">
		<bitfield id="MR14_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_266" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_266" offset="0x428" width="32" description="">
		<bitfield id="MR14_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_267" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_267" offset="0x42C" width="32" description="">
		<bitfield id="MR14_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_268" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_268" offset="0x430" width="32" description="">
		<bitfield id="MR16_DATA_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 16. " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="MR14_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 14. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_269" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_269" offset="0x434" width="32" description="">
		<bitfield id="MR20_DATA_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 20. " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="MR17_DATA_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 17. " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="MR17_DATA_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 17. " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MR16_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 16. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_270" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_270" offset="0x438" width="32" description="">
		<bitfield id="MR22_DATA_F0_0" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register 22. FC=0 " range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="MR20_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 20. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_271" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_271" offset="0x43C" width="32" description="">
		<bitfield id="MR22_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 22. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_272" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_272" offset="0x440" width="32" description="">
		<bitfield id="MR22_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 22. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_273" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_273" offset="0x444" width="32" description="">
		<bitfield id="MR22_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 22. FC=0 " range="16 - 0" rwaccess="R/W"/>
	</register>
