IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_274" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_274" offset="0x448" width="32" description="">
		<bitfield id="MR22_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 22. FC=1 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_275" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_275" offset="0x44C" width="32" description="">
		<bitfield id="MR22_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 22. FC=2 " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_276" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_276" offset="0x450" width="32" description="">
		<bitfield id="MR_FSP_DATA_VALID_F0" width="1" begin="24" end="24" resetval="0x0" description="Indicates that, at this frequency, memory was trained and the associated data has been loaded into the MRx_DATA parameter[s]. Value of 1 means memory was trained. FC=0 " range="24" rwaccess="R/W"/> 
		<bitfield id="MR23_DATA" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 23. " range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_277" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_277" offset="0x454" width="32" description="">
		<bitfield id="DFS_FSP_INSYNC_INACTIVE" width="1" begin="24" end="24" resetval="0x0" description="When cleared, this indicates that the contents in memcd_param is new that the values in memory's MRx FSP reg and if a dfs occurs, they need to be updated. READ-ONLY " range="24" rwaccess="R"/> 
		<bitfield id="DFS_FSP_INSYNC_ACTIVE" width="1" begin="16" end="16" resetval="0x1" description="When cleared, this indicates that the contents in memcd_param is new that the values in memory's MRx FSP reg and if a dfs occurs, they need to be updated. READ-ONLY " range="16" rwaccess="R"/> 
		<bitfield id="MR_FSP_DATA_VALID_F2" width="1" begin="8" end="8" resetval="0x0" description="Indicates that, at this frequency, memory was trained and the associated data has been loaded into the MRx_DATA parameter[s]. Value of 1 means memory was trained. FC=2 " range="8" rwaccess="R/W"/> 
		<bitfield id="MR_FSP_DATA_VALID_F1" width="1" begin="0" end="0" resetval="0x0" description="Indicates that, at this frequency, memory was trained and the associated data has been loaded into the MRx_DATA parameter[s]. Value of 1 means memory was trained. FC=1 " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_278" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_278" offset="0x458" width="32" description="">
		<bitfield id="FSP_OP_CURRENT" width="1" begin="24" end="24" resetval="0x0" description="Reports which FSP set the memory is currently using. " range="24" rwaccess="R/W"/> 
		<bitfield id="FSP_STATUS" width="1" begin="16" end="16" resetval="0x0" description="Indicates that a DFS event caused the FSP mode registers to be updated. Value of 1 means that the FSP mode registers were changed. " range="16" rwaccess="R/W"/> 
		<bitfield id="DFS_ALWAYS_WRITE_FSP" width="1" begin="8" end="8" resetval="0x0" description="Forces all FSP mode registers to be written by the controller during a DFS event. Set to 1 to force the write. " range="8" rwaccess="R/W"/> 
		<bitfield id="FSP_PHY_UPDATE_MRW" width="1" begin="0" end="0" resetval="0x0" description="Identifies the logic responsible for updating MR12 and MR14 in memory. Clear to 0 for the controller, or set to 1 for the PHY or PI. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_279" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_279" offset="0x45C" width="32" description="">
		<bitfield id="FSP0_FRC" width="2" begin="25" end="24" resetval="0x0" description="Identifies which of the controller's frequency copy is associated with FSP0. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="FSP1_FRC_VALID" width="1" begin="16" end="16" resetval="0x0" description="Specifies whether the FSP set defined in the FSP1_FRC parameter reflects the frequency used to program the FSP1 registers. " range="16" rwaccess="R/W"/> 
		<bitfield id="FSP0_FRC_VALID" width="1" begin="8" end="8" resetval="0x0" description="Specifies whether the FSP set defined in the FSP0_FRC parameter reflects the frequency used to program the FSP0 registers. " range="8" rwaccess="R/W"/> 
		<bitfield id="FSP_WR_CURRENT" width="1" begin="0" end="0" resetval="0x0" description="Reports which FSP set the memory will target with write commands. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_280" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_280" offset="0x460" width="32" description="">
		<bitfield id="ADDR_SPACE" width="6" begin="29" end="24" resetval="0x0" description="Sets the number of address bits to check during BIST operation. " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="BIST_RESULT" width="2" begin="17" end="16" resetval="0x0" description="BIST operation status [pass/fail]. Bit [0] indicates data check status and bit [1] indicates address check status. Value of 1 is a passing result. READ-ONLY " range="17 - 16" rwaccess="R"/> 
		<bitfield id="BIST_GO" width="1" begin="8" end="8" resetval="0x0" description="Initiate a BIST operation. Set to 1 to trigger. WRITE-ONLY " range="8" rwaccess="W"/> 
		<bitfield id="FSP1_FRC" width="2" begin="1" end="0" resetval="0x0" description="Identifies which of the controller's frequency copy is associated with FSP1. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_281" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_281" offset="0x464" width="32" description="">
		<bitfield id="BIST_ADDR_CHECK" width="1" begin="8" end="8" resetval="0x0" description="Enable address checking with BIST operation. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="BIST_DATA_CHECK" width="1" begin="0" end="0" resetval="0x0" description="Enable data checking with BIST operation. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_282" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_282" offset="0x468" width="32" description="">
		<bitfield id="BIST_START_ADDRESS_0" width="32" begin="31" end="0" resetval="0x0" description="Start BIST checking at this address. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_283" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_283" offset="0x46C" width="32" description="">
		<bitfield id="BIST_START_ADDRESS_1" width="1" begin="0" end="0" resetval="0x0" description="Start BIST checking at this address. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_284" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_284" offset="0x470" width="32" description="">
		<bitfield id="BIST_DATA_MASK" width="32" begin="31" end="0" resetval="0x0" description="Mask applied to data for BIST error checking. Bit [0] controls memory data path bit [0], bit [1] controls memory data path bit [1], etc. Set each bit to 1 to mask. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_285" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_285" offset="0x474" width="32" description="">
		<bitfield id="BIST_TEST_MODE" width="3" begin="2" end="0" resetval="0x0" description="Sets the BIST test mode. Value of 0 specifies standard BIST operation, value of 1 specifies a reduced BIST operation, value of 2 specifies a self-refresh retention test, value of 3 specifies an idle retention test, and value of 4 specifies memory initalization function. All other values are reserved. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_286" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_286" offset="0x478" width="32" description="">
		<bitfield id="BIST_DATA_PATTERN_0" width="32" begin="31" end="0" resetval="0x0" description="Data pattern to be used when the BIST_TEST_MODE parameter is programmed to 1, 2, 3 or 4. Only data corresponding to active portion of core word will be used while inactive portion will be ignored. " range="31 - 0" rwaccess="R/W"/>
	</register>
