IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_287" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_287" offset="0x47C" width="32" description="">
		<bitfield id="BIST_DATA_PATTERN_1" width="32" begin="31" end="0" resetval="0x0" description="Data pattern to be used when the BIST_TEST_MODE parameter is programmed to 1, 2, 3 or 4. Only data corresponding to active portion of core word will be used while inactive portion will be ignored. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_288" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_288" offset="0x480" width="32" description="">
		<bitfield id="BIST_ERR_STOP" width="12" begin="19" end="8" resetval="0x0" description="Defines the maximum number of error occurrences allowed prior to quitting when the BIST_TEST_MODE parameter is programmed to 1, 2 or 3. A value of 0 will allow the test to run to completion. " range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="BIST_RET_STATE" width="1" begin="0" end="0" resetval="0x0" description="Indicates if BIST is in a retention wait state, used when the BIST_TEST_MODE parameter is programmed to 2 or 3. Value of 1 indicates BIST is waiting. READ-ONLY " range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_289" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_289" offset="0x484" width="32" description="">
		<bitfield id="LONG_COUNT_MASK" width="5" begin="28" end="24" resetval="0x0" description="Reduces the length of the long counter from 1024 cycles. The only supported values are 0x00 [1024 cycles], 0x10 [512 clocks], 0x18 [256 clocks], 0x1C [128 clocks], 0x1E [64 clocks] and 0x1F [32 clocks]. " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="BIST_RET_STATE_EXIT" width="1" begin="16" end="16" resetval="0x0" description="Exit self-refresh or idle retention state, used when the BIST_TEST_MODE parameter is programmed to 2 or 3. Set to 1 to trigger. WRITE-ONLY " range="16" rwaccess="W"/> 
		<bitfield id="BIST_ERR_COUNT" width="12" begin="11" end="0" resetval="0x0" description="Indicates the number of BIST errors found when the BIST_TEST_MODE parameter is programmed to 1, 2 or 3. READ-ONLY " range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_290" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_290" offset="0x488" width="32" description="">
		<bitfield id="AREF_MAX_CREDIT" width="5" begin="28" end="24" resetval="0x0" description="AREF number of posted refreshes until the maximum number of refresh credits has been reached. " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="AREF_MAX_DEFICIT" width="5" begin="20" end="16" resetval="0x0" description="AREF number of pending refreshes until the maximum number of refreshes has been exceeded. " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="AREF_HIGH_THRESHOLD" width="5" begin="12" end="8" resetval="0x0" description="AREF number of pending refreshes until the high priority request is asserted. " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="AREF_NORM_THRESHOLD" width="5" begin="4" end="0" resetval="0x0" description="AREF number of pending refreshes until the normal priority request is asserted. " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_291" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_291" offset="0x48C" width="32" description="">
		<bitfield id="ZQ_CALSTART_NORM_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="ZQ START number of long counts until the normal priority request is asserted. This value should be scaled based on the number of ranks [chip selects] the controller handles. The more chip selects there are, the more rotations there are to go through, and the smaller this threshold should be. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQCS_OPT_THRESHOLD" width="3" begin="10" end="8" resetval="0x0" description="Number of clocks before ZQCS expires when the ZQ task will deassert its request for optimal command to command turn-around timing. " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="AREF_CMD_MAX_PER_TREFI" width="4" begin="3" end="0" resetval="0x0" description="Sets the maximum number of auto-refreshes that will be executed in a TREFI period - both normal and high priority. This does not prevent refreshes generated by sub-task requests such as a self-refresh exit and enter. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_292" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_292" offset="0x490" width="32" description="">
		<bitfield id="ZQ_CALLATCH_HIGH_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="ZQ LATCH number of long counts until the high priority request is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALSTART_HIGH_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="ZQ START number of long counts until the high priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_293" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_293" offset="0x494" width="32" description="">
		<bitfield id="ZQ_CS_HIGH_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="ZQ CS number of long counts until the high priority request is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CS_NORM_THRESHOLD_F0" width="16" begin="15" end="0" resetval="0x0" description="ZQ CS number of long counts until the normal priority request is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_294" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_294" offset="0x498" width="32" description="">
		<bitfield id="ZQ_CALLATCH_TIMEOUT_F0" width="16" begin="31" end="16" resetval="0x0" description="ZQ LATCH number of long counts until the timeout is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALSTART_TIMEOUT_F0" width="16" begin="15" end="0" resetval="0x0" description="ZQ START number of long counts until the timeout is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_295" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_295" offset="0x49C" width="32" description="">
		<bitfield id="ZQ_PROMOTE_THRESHOLD_F0" width="16" begin="31" end="16" resetval="0x0" description="ZQ SW promotion number of long counts until the high priority request is asserted. FC=0 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CS_TIMEOUT_F0" width="16" begin="15" end="0" resetval="0x0" description="ZQ CS number of long counts until the timeout is asserted. FC=0 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_296" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_296" offset="0x4A0" width="32" description="">
		<bitfield id="ZQ_CALSTART_HIGH_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="ZQ START number of long counts until the high priority request is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALSTART_NORM_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="ZQ START number of long counts until the normal priority request is asserted. This value should be scaled based on the number of ranks [chip selects] the controller handles. The more chip selects there are, the more rotations there are to go through, and the smaller this threshold should be. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_297" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_297" offset="0x4A4" width="32" description="">
		<bitfield id="ZQ_CS_NORM_THRESHOLD_F1" width="16" begin="31" end="16" resetval="0x0" description="ZQ CS number of long counts until the normal priority request is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALLATCH_HIGH_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="ZQ LATCH number of long counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_298" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_298" offset="0x4A8" width="32" description="">
		<bitfield id="ZQ_CALSTART_TIMEOUT_F1" width="16" begin="31" end="16" resetval="0x0" description="ZQ START number of long counts until the timeout is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CS_HIGH_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="ZQ CS number of long counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_299" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_299" offset="0x4AC" width="32" description="">
		<bitfield id="ZQ_CS_TIMEOUT_F1" width="16" begin="31" end="16" resetval="0x0" description="ZQ CS number of long counts until the timeout is asserted. FC=1 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALLATCH_TIMEOUT_F1" width="16" begin="15" end="0" resetval="0x0" description="ZQ LATCH number of long counts until the timeout is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_300" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_300" offset="0x4B0" width="32" description="">
		<bitfield id="ZQ_CALSTART_NORM_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="ZQ START number of long counts until the normal priority request is asserted. This value should be scaled based on the number of ranks [chip selects] the controller handles. The more chip selects there are, the more rotations there are to go through, and the smaller this threshold should be. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_PROMOTE_THRESHOLD_F1" width="16" begin="15" end="0" resetval="0x0" description="ZQ SW promotion number of long counts until the high priority request is asserted. FC=1 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_301" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_301" offset="0x4B4" width="32" description="">
		<bitfield id="ZQ_CALLATCH_HIGH_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="ZQ LATCH number of long counts until the high priority request is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALSTART_HIGH_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="ZQ START number of long counts until the high priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_302" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_302" offset="0x4B8" width="32" description="">
		<bitfield id="ZQ_CS_HIGH_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="ZQ CS number of long counts until the high priority request is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CS_NORM_THRESHOLD_F2" width="16" begin="15" end="0" resetval="0x0" description="ZQ CS number of long counts until the normal priority request is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_303" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_303" offset="0x4BC" width="32" description="">
		<bitfield id="ZQ_CALLATCH_TIMEOUT_F2" width="16" begin="31" end="16" resetval="0x0" description="ZQ LATCH number of long counts until the timeout is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CALSTART_TIMEOUT_F2" width="16" begin="15" end="0" resetval="0x0" description="ZQ START number of long counts until the timeout is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
