IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_304" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_304" offset="0x4C0" width="32" description="">
		<bitfield id="ZQ_PROMOTE_THRESHOLD_F2" width="16" begin="31" end="16" resetval="0x0" description="ZQ SW promotion number of long counts until the high priority request is asserted. FC=2 " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CS_TIMEOUT_F2" width="16" begin="15" end="0" resetval="0x0" description="ZQ CS number of long counts until the timeout is asserted. FC=2 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_305" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_305" offset="0x4C4" width="32" description="">
		<bitfield id="ZQINIT_F0" width="12" begin="19" end="8" resetval="0x0" description="Number of cycles needed for a ZQINIT command. FC=0 " range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="TIMEOUT_TIMER_LOG" width="8" begin="7" end="0" resetval="0x0" description="Reflects which timers experienced a timeout error [or had an uncleared error] when the timeout interrupt fired.  Bit [0] correlates to a ZQ cal init, cs, cl, or reset FM timeout.  Bit [1] correlates to the ZQ calstart FM timeout.  Bit [2] correlates to the ZQ callatch FM timeout.  Bit [3] correlates to the MRR temperature check FM timeout.  Bit [4] correlates to the DQS oscillator FM timeout.  Bit [5] correlates to the DFI update FM timeout.  Bit [6] correlates to the low power interface wakeup timeout.  Bit [7] correlates to the auto refresh max deficit timeout.  READ-ONLY " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_306" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_306" offset="0x4C8" width="32" description="">
		<bitfield id="ZQCS_F0" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQCS command. FC=0 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQCL_F0" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQCL command. FC=0 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_307" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_307" offset="0x4CC" width="32" description="">
		<bitfield id="TZQLAT_F0" width="7" begin="22" end="16" resetval="0x0" description="Holds the DRAM ZQLAT value in cycles. FC=0 " range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="TZQCAL_F0" width="12" begin="11" end="0" resetval="0x0" description="Holds the DRAM ZQCAL value in cycles. FC=0 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_308" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_308" offset="0x4D0" width="32" description="">
		<bitfield id="ZQCL_F1" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQCL command. FC=1 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQINIT_F1" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQINIT command. FC=1 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_309" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_309" offset="0x4D4" width="32" description="">
		<bitfield id="TZQCAL_F1" width="12" begin="27" end="16" resetval="0x0" description="Holds the DRAM ZQCAL value in cycles. FC=1 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQCS_F1" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQCS command. FC=1 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_310" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_310" offset="0x4D8" width="32" description="">
		<bitfield id="ZQINIT_F2" width="12" begin="19" end="8" resetval="0x0" description="Number of cycles needed for a ZQINIT command. FC=2 " range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="TZQLAT_F1" width="7" begin="6" end="0" resetval="0x0" description="Holds the DRAM ZQLAT value in cycles. FC=1 " range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_311" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_311" offset="0x4DC" width="32" description="">
		<bitfield id="ZQCS_F2" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQCS command. FC=2 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQCL_F2" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQCL command. FC=2 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_312" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_312" offset="0x4E0" width="32" description="">
		<bitfield id="ZQ_SW_REQ_START_LATCH_MAP" width="2" begin="25" end="24" resetval="0x0" description="Specifies which chip selects will simultaneously receive a ZQ start or latch command once the ZQ_REQ parameter is written with a ZQ Start or ZQ Latch command. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="TZQLAT_F2" width="7" begin="22" end="16" resetval="0x0" description="Holds the DRAM ZQLAT value in cycles. FC=2 " range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="TZQCAL_F2" width="12" begin="11" end="0" resetval="0x0" description="Holds the DRAM ZQCAL value in cycles. FC=2 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_313" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_313" offset="0x4E4" width="32" description="">
		<bitfield id="ZQRESET_F0" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQRESET command. FC=0 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_REQ_PENDING" width="1" begin="8" end="8" resetval="0x0" description="Indicates that a ZQ command is currently in progress or waiting to run. Value of 1 indicates command in progress or waiting to run. When this is asserted, no writes to ZQ_REQ should occur. READ-ONLY " range="8" rwaccess="R"/> 
		<bitfield id="ZQ_REQ" width="4" begin="3" end="0" resetval="0x0" description="User request to initiate a ZQ calibration. Program to 3 for ZQ Start, program to 4 for ZQ Initialization [ZQINIT], program to 5 for ZQ Latch, or program to 8 for ZQ Reset. Clearing to 0 will not trigger any ZQ command. This parameter should only be written when the ZQ_REQ_PENDING parameter is cleared to 0. WRITE-ONLY " range="3 - 0" rwaccess="W"/>
	</register>
