IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_314" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_314" offset="0x4E8" width="32" description="">
		<bitfield id="ZQRESET_F2" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQRESET command. FC=2 " range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQRESET_F1" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQRESET command. FC=1 " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_315" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_315" offset="0x4EC" width="32" description="">
		<bitfield id="ZQ_CAL_LATCH_MAP_0" width="2" begin="25" end="24" resetval="0x0" description="Defines which chip select[s] will receive ZQ calibration latch commands simultaneously on iteration 0 of the ZQ LATCH initialization and periodic command sequences. Clear to all zeros for no ZQ LATCH commands. CS=0 " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="ZQ_CAL_START_MAP_0" width="2" begin="17" end="16" resetval="0x0" description="Defines which chip select[s] will receive ZQ calibration start commands simultaneously on iteration 0 of the ZQ START initialization and periodic command sequences. Clear to all zeros for no ZQ START commands. CS=0 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQCS_ROTATE" width="1" begin="8" end="8" resetval="0x0" description="For memories that perform ZQ short commands [ZQCS], selects whether a ZQCS command will calibrate just one chip select or all chip selects. When rotation is off, all chip selects will be calibrated, requiring a longer time frame, but ZQ calibration will need to be performed less frequently. Set to 1 for rotating CS. For ZQ start/latch memories, this parameter is ignored. " range="8" rwaccess="R/W"/> 
		<bitfield id="NO_ZQ_INIT" width="1" begin="0" end="0" resetval="0x0" description="Disable ZQ operations during initialization. Set to 1 to disable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_316" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_316" offset="0x4F0" width="32" description="">
		<bitfield id="BANK_DIFF_1" width="2" begin="25" end="24" resetval="0x0" description="Encoded number of banks on the DRAM[s]. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="BANK_DIFF_0" width="2" begin="17" end="16" resetval="0x0" description="Encoded number of banks on the DRAM[s]. " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="ZQ_CAL_LATCH_MAP_1" width="2" begin="9" end="8" resetval="0x0" description="Defines which chip select[s] will receive ZQ calibration latch commands simultaneously on iteration 1 of the ZQ LATCH initialization and periodic command sequences. Clear to all zeros for no ZQ LATCH commands. CS=1 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="ZQ_CAL_START_MAP_1" width="2" begin="1" end="0" resetval="0x0" description="Defines which chip select[s] will receive ZQ calibration start commands simultaneously on iteration 1 of the ZQ START initialization and periodic command sequences. Clear to all zeros for no ZQ START commands. CS=1 " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_317" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_317" offset="0x4F4" width="32" description="">
		<bitfield id="COL_DIFF_1" width="4" begin="27" end="24" resetval="0x0" description="Difference between number of column pins available and number being used. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="COL_DIFF_0" width="4" begin="19" end="16" resetval="0x0" description="Difference between number of column pins available and number being used. " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="ROW_DIFF_1" width="3" begin="10" end="8" resetval="0x0" description="Difference between number of address pins available and number being used. " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="ROW_DIFF_0" width="3" begin="2" end="0" resetval="0x0" description="Difference between number of address pins available and number being used. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_318" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_318" offset="0x4F8" width="32" description="">
		<bitfield id="CS_VAL_UPPER_0" width="16" begin="31" end="16" resetval="0x0" description="Upper bound address for chip select 0. " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="CS_VAL_LOWER_0" width="16" begin="15" end="0" resetval="0x0" description="Lower bound address for chip select 0. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_319" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_319" offset="0x4FC" width="32" description="">
		<bitfield id="CS_MSK_0" width="16" begin="23" end="8" resetval="0x0" description="Mask applied to the address decode for chip select 0. " range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="ROW_START_VAL_0" width="2" begin="1" end="0" resetval="0x0" description="Row start value for chip select 0. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_320" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_320" offset="0x500" width="32" description="">
		<bitfield id="CS_VAL_UPPER_1" width="16" begin="31" end="16" resetval="0x0" description="Upper bound address for chip select 1. " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="CS_VAL_LOWER_1" width="16" begin="15" end="0" resetval="0x0" description="Lower bound address for chip select 1. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_321" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_321" offset="0x504" width="32" description="">
		<bitfield id="CS_MAP_NON_POW2" width="2" begin="25" end="24" resetval="0x0" description="Defines which chip selects are non-power-of-2 memory sizes. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="CS_MSK_1" width="16" begin="23" end="8" resetval="0x0" description="Mask applied to the address decode for chip select 1. " range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="ROW_START_VAL_1" width="2" begin="1" end="0" resetval="0x0" description="Row start value for chip select 1. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_322" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_322" offset="0x508" width="32" description="">
		<bitfield id="APREBIT" width="5" begin="28" end="24" resetval="0x10" description="Location of the auto pre-charge bit in the DRAM address. " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CS_LOWER_ADDR_EN" width="1" begin="0" end="0" resetval="0x0" description="Enables moving the CS field to lower in the address map. When set to 1, the memory address map will be changed to ROW__CS__BANK. Please refer to the limitations before setting this bit. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_323" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_323" offset="0x50C" width="32" description="">
		<bitfield id="ADDR_COLLISION_MPM_DIS" width="1" begin="24" end="24" resetval="0x0" description="Disable address collision detection extension using micro page mask for command queue placement and selection. Set to 1 to disable. " range="24" rwaccess="R/W"/> 
		<bitfield id="ADDR_CMP_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable address collision detection as a rule for command queue placement. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="COMMAND_AGE_COUNT" width="8" begin="15" end="8" resetval="0x0" description="Initial value of individual command aging counters for command aging. " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="AGE_COUNT" width="8" begin="7" end="0" resetval="0x0" description="Initial value of master aging-rate counter for command aging. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_324" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_324" offset="0x510" width="32" description="">
		<bitfield id="RW_SAME_EN" width="1" begin="24" end="24" resetval="0x0" description="Enable read/write grouping as a rule for command queue placement. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="PRIORITY_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable priority as a rule for command queue placement. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="PLACEMENT_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable placement logic for command queue. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="BANK_SPLIT_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable bank splitting as a rule for command queue placement. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_325" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_325" offset="0x514" width="32" description="">
		<bitfield id="DISABLE_RW_GROUP_W_BNK_CONFLICT" width="2" begin="25" end="24" resetval="0x0" description="Disables placement to read/write group when grouping creates a bank collision. Bit [0] controls placement next to bank conflict command and bit [1] controls placement 2 away from bank conflict command. Set each bit to 1 to disable. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="W2R_SPLIT_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable splitting of commands to the same chip select from a write to a read command as a rule for command queue placement. " range="16" rwaccess="R/W"/> 
		<bitfield id="CS_SAME_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable chip select grouping when read/write grouping as a rule for command queue placement. This is only valid when the RW_SAME_EN parameter is set. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="RW_SAME_PAGE_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable page grouping when read/write grouping as a rule for command queue placement. This is only valid when the RW_SAME_EN parameter is set. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_326" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_326" offset="0x518" width="32" description="">
		<bitfield id="INHIBIT_DRAM_CMD" width="2" begin="25" end="24" resetval="0x0" description="Inhibit command types from being executed from the command queue. Clear to 0 to enable any command, program to 1 to inhibit read/write and bank commands, program to 2 to inhibit MRR and peripheral MRR commands, or program to 3 to inhibit MRR and read/write commands. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="DISABLE_RD_INTERLEAVE" width="1" begin="16" end="16" resetval="0x0" description="Disable read data interleaving for commands from the same port, regardless of the requestor ID. " range="16" rwaccess="R/W"/> 
		<bitfield id="SWAP_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable command swapping logic in execution unit. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="NUM_Q_ENTRIES_ACT_DISABLE" width="5" begin="4" end="0" resetval="0x0" description="Number of queue entries in which ACT requests will be disabled. Programming to X will disable ACT requests from the X entries lowest in the command queue. " range="4 - 0" rwaccess="R/W"/>
	</register>
