IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_327" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_327" offset="0x51C" width="32" description="">
		<bitfield id="MEMDATA_RATIO_0" width="3" begin="26" end="24" resetval="0x0" description="Defines the ratio of the DRAM device size on chip select 0 to the memory data width. Program with the log2 ratio of the memory data width to the device data width. CS=0 " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="MEM_DP_REDUCTION" width="1" begin="16" end="16" resetval="0x0" description="Enable the half datapath feature of the controller. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="BURST_ON_FLY_BIT" width="4" begin="11" end="8" resetval="0x0" description="Identifies the burst-on-fly bit in the memory mode registers. " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="CS_MAP" width="2" begin="1" end="0" resetval="0x0" description="Defines which chip selects are active. " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_328" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_328" offset="0x520" width="32" description="">
		<bitfield id="DEVICE0_BYTE0_CS1" width="2" begin="25" end="24" resetval="0x0" description="Defines the byte location of byte0 in the memory datapath for device 0 on chip 1.  Used for MRRs to identify where data will be returned. DEV=0 " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="DEVICE1_BYTE0_CS0" width="2" begin="17" end="16" resetval="0x0" description="Defines the byte location of byte0 in the memory datapath for device 1 on chip 0.  Used for MRRs to identify where data will be returned. DEV=1 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="DEVICE0_BYTE0_CS0" width="2" begin="9" end="8" resetval="0x0" description="Defines the byte location of byte0 in the memory datapath for device 0 on chip 0.  Used for MRRs to identify where data will be returned. DEV=0 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="MEMDATA_RATIO_1" width="3" begin="2" end="0" resetval="0x0" description="Defines the ratio of the DRAM device size on chip select 1 to the memory data width. Program with the log2 ratio of the memory data width to the device data width. CS=1 " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_329" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_329" offset="0x524" width="32" description="">
		<bitfield id="WR_ORDER_REQ" width="2" begin="25" end="24" resetval="0x0" description="Determines if the controller can re-order write commands from the same source ID and/or the same port. Bit [0] controls source ID usage and bit [1] controls port ID usage. Set each bit to 1 to enable usage in placement logic. " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="IN_ORDER_ACCEPT" width="1" begin="16" end="16" resetval="0x0" description="Forces the controller to accept commands in the order in which they are placed in the command queue. " range="16" rwaccess="R/W"/> 
		<bitfield id="Q_FULLNESS" width="5" begin="12" end="8" resetval="0x0" description="Quantity that determines when the command queue almost full signal will assert [q_almost_full]. When cleared to 0, the q_almost_full signal will be driven to 0 irrespective of number of entries in the command queue. " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="DEVICE1_BYTE0_CS1" width="2" begin="1" end="0" resetval="0x0" description="Defines the byte location of byte0 in the memory datapath for device 1 on chip 1.  Used for MRRs to identify where data will be returned. DEV=1 " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_330" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_330" offset="0x528" width="32" description="">
		<bitfield id="CTRLUPD_AREF_HP_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Enable an automatic controller-initiated update [dfi_ctrlupd_req] after every high priority refresh when executing as a subtask request. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="CTRLUPD_REQ_PER_AREF_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable an automatic controller-initiated update [dfi_ctrlupd_req] after every refresh. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="CTRLUPD_REQ" width="1" begin="8" end="8" resetval="0x0" description="Assert the DFI controller-initiated update request signal dfi_ctrlupd_req. Set to 1 to trigger. WRITE-ONLY " range="8" rwaccess="W"/> 
		<bitfield id="CONTROLLER_BUSY" width="1" begin="0" end="0" resetval="0x0" description="Indicator that the controller is processing a command. Evaluates all ports for outstanding transactions. Value of 1 indicates controller busy. READ-ONLY " range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_331" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_331" offset="0x52C" width="32" description="">
		<bitfield id="RD_PREAMBLE_TRAINING_EN" width="1" begin="24" end="24" resetval="0x0" description="Enable read preamble training during gate training. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="PREAMBLE_SUPPORT_F2" width="2" begin="17" end="16" resetval="0x0" description="Selection the preamble for read and write burst transfers. FC=2 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PREAMBLE_SUPPORT_F1" width="2" begin="9" end="8" resetval="0x0" description="Selection the preamble for read and write burst transfers. FC=1 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PREAMBLE_SUPPORT_F0" width="2" begin="1" end="0" resetval="0x0" description="Selection the preamble for read and write burst transfers. FC=0 " range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_332" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_332" offset="0x530" width="32" description="">
		<bitfield id="DFI_ERROR" width="3" begin="18" end="16" resetval="0x0" description="Indicates that the DFI error flag has been asserted. READ-ONLY " range="18 - 16" rwaccess="R"/> 
		<bitfield id="RD_DBI_EN" width="1" begin="8" end="8" resetval="0x0" description="Enables controller support of DRAM DBI feature for read data with DDR4 devices. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="WR_DBI_EN" width="1" begin="0" end="0" resetval="0x0" description="Enables controller support of DRAM DBI feature for write data with DDR4 devices. Set to 1 to enable. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_333" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_333" offset="0x534" width="32" description="">
		<bitfield id="BG_ROTATE_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable bank group rotation. Set to 1 to enable. " range="16" rwaccess="R/W"/> 
		<bitfield id="DFI_ERROR_INFO" width="12" begin="11" end="0" resetval="0x0" description="Holds the encoded DFI error type associated with the DFI_ERROR parameter assertion. READ-ONLY " range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_334" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_334" offset="0x538" width="32" description="">
		<bitfield id="INT_STATUS_MASTER" width="32" begin="31" end="0" resetval="0x0" description="Master status reporting register for interrupt status groups. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
