IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_335" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_335" offset="0x53C" width="32" description="">
		<bitfield id="INT_MASK_MASTER" width="32" begin="31" end="0" resetval="0x0" description="Master mask register for interrupt status groups. WRITE-ONLY" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_336" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_336" offset="0x540" width="32" description="">
		<bitfield id="INT_STATUS_TIMEOUT" width="32" begin="31" end="0" resetval="0x0" description="Status of interrupts in the controller related to Timeout monitors. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_337" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_337" offset="0x544" width="32" description="">
		<bitfield id="INT_STATUS_LOWPOWER" width="16" begin="31" end="16" resetval="0x0" description="Status of interrupts in the controller related to Low Power. READ-ONLY" range="31 - 16" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_338" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_338" offset="0x548" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_339" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_339" offset="0x54C" width="32" description="">
		<bitfield id="INT_STATUS_TRAINING" width="32" begin="31" end="0" resetval="0x0" description="Status of interrupts in the controller related to Training/Calibration. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_340" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_340" offset="0x550" width="32" description="">
		<bitfield id="INT_STATUS_USERIF" width="32" begin="31" end="0" resetval="0x0" description="Status of interrupts in the controller related to ASIC to Controller Interface. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_341" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_341" offset="0x554" width="32" description="">
		<bitfield id="INT_STATUS_BIST" width="8" begin="23" end="16" resetval="0x0" description="Status of interrupts in the controller related to BIST. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="INT_STATUS_MISC" width="16" begin="15" end="0" resetval="0x0" description="Status of interrupts in the controller related to Miscellaneous features. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_342" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_342" offset="0x558" width="32" description="">
		<bitfield id="INT_STATUS_INIT" width="8" begin="31" end="24" resetval="0x0" description="Status of interrupts in the controller related to Initialization. READ-ONLY" range="31 - 24" rwaccess="R"/> 
		<bitfield id="INT_STATUS_FREQ" width="8" begin="23" end="16" resetval="0x0" description="Status of interrupts in the controller related to Frequency Scaling. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="INT_STATUS_DFI" width="8" begin="7" end="0" resetval="0x0" description="Status of interrupts in the controller related to DFI. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_343" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_343" offset="0x55C" width="32" description="">
		<bitfield id="INT_STATUS_PARITY" width="8" begin="15" end="8" resetval="0x0" description="Status of interrupts in the controller related to Parity. READ-ONLY" range="15 - 8" rwaccess="R"/> 
		<bitfield id="INT_STATUS_MODE" width="8" begin="7" end="0" resetval="0x0" description="Status of interrupts in the controller related to Memory Mode Settings. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_344" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_344" offset="0x560" width="32" description="">
		<bitfield id="INT_ACK_TIMEOUT" width="32" begin="31" end="0" resetval="0x0" description="Clear status of the INT_STATUS_TIMEOUT parameter. WRITE-ONLY" range="31 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_345" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_345" offset="0x564" width="32" description="">
		<bitfield id="INT_ACK_LOWPOWER" width="16" begin="31" end="16" resetval="0x0" description="Clear status of the INT_STATUS_LOWPOWER parameter. WRITE-ONLY" range="31 - 16" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_346" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_346" offset="0x568" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_347" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_347" offset="0x56C" width="32" description="">
		<bitfield id="INT_ACK_TRAINING" width="32" begin="31" end="0" resetval="0x0" description="Clear status of the INT_STATUS_TRAINING parameter. WRITE-ONLY" range="31 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_348" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_348" offset="0x570" width="32" description="">
		<bitfield id="INT_ACK_USERIF" width="32" begin="31" end="0" resetval="0x0" description="Clear status of the INT_STATUS_USERIF parameter. WRITE-ONLY" range="31 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_349" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_349" offset="0x574" width="32" description="">
		<bitfield id="INT_ACK_BIST" width="8" begin="23" end="16" resetval="0x0" description="Clear status of the INT_STATUS_BIST parameter. WRITE-ONLY" range="23 - 16" rwaccess="W"/> 
		<bitfield id="INT_ACK_MISC" width="16" begin="15" end="0" resetval="0x0" description="Clear status of the INT_STATUS_MISC parameter. WRITE-ONLY" range="15 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_350" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_350" offset="0x578" width="32" description="">
		<bitfield id="INT_ACK_INIT" width="8" begin="31" end="24" resetval="0x0" description="Clear status of the INT_STATUS_INIT parameter. WRITE-ONLY" range="31 - 24" rwaccess="W"/> 
		<bitfield id="INT_ACK_FREQ" width="8" begin="23" end="16" resetval="0x0" description="Clear status of the INT_STATUS_FREQ parameter. WRITE-ONLY" range="23 - 16" rwaccess="W"/> 
		<bitfield id="INT_ACK_DFI" width="8" begin="7" end="0" resetval="0x0" description="Clear status of the INT_STATUS_DFI parameter. WRITE-ONLY" range="7 - 0" rwaccess="W"/>
	</register>
