IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_351" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_351" offset="0x57C" width="32" description="">
		<bitfield id="INT_ACK_PARITY" width="8" begin="15" end="8" resetval="0x0" description="Clear status of the INT_STATUS_PARITY parameter. WRITE-ONLY" range="15 - 8" rwaccess="W"/> 
		<bitfield id="INT_ACK_MODE" width="8" begin="7" end="0" resetval="0x0" description="Clear status of the INT_STATUS_MODE parameter. WRITE-ONLY" range="7 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_352" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_352" offset="0x580" width="32" description="">
		<bitfield id="INT_MASK_TIMEOUT" width="32" begin="31" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_TIMEOUT parameter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_353" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_353" offset="0x584" width="32" description="">
		<bitfield id="INT_MASK_LOWPOWER" width="16" begin="31" end="16" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_LOWPOWER parameter" range="31 - 16" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_354" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_354" offset="0x588" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_355" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_355" offset="0x58C" width="32" description="">
		<bitfield id="INT_MASK_TRAINING" width="32" begin="31" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_TRAINING parameter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_356" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_356" offset="0x590" width="32" description="">
		<bitfield id="INT_MASK_USERIF" width="32" begin="31" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_USERIF parameter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_357" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_357" offset="0x594" width="32" description="">
		<bitfield id="INT_MASK_BIST" width="8" begin="23" end="16" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_BIST parameter" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="INT_MASK_MISC" width="16" begin="15" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_MISC parameter" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_358" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_358" offset="0x598" width="32" description="">
		<bitfield id="INT_MASK_INIT" width="8" begin="31" end="24" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_INIT parameter" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="INT_MASK_FREQ" width="8" begin="23" end="16" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_FREQ parameter" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="INT_MASK_DFI" width="8" begin="7" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_DFI parameter" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_359" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_359" offset="0x59C" width="32" description="">
		<bitfield id="INT_MASK_PARITY" width="8" begin="15" end="8" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_PARITY parameter" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="INT_MASK_MODE" width="8" begin="7" end="0" resetval="0x0" description="Mask for the controller_int signal from the INT_MASK_MODE parameter" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_360" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_360" offset="0x5A0" width="32" description="">
		<bitfield id="OUT_OF_RANGE_ADDR_0" width="32" begin="31" end="0" resetval="0x0" description="Address of command that caused an out-of-range interrupt. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_361" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_361" offset="0x5A4" width="32" description="">
		<bitfield id="OUT_OF_RANGE_TYPE" width="7" begin="30" end="24" resetval="0x0" description="Type of command that caused an out-of-range interrupt. READ-ONLY" range="30 - 24" rwaccess="R"/> 
		<bitfield id="OUT_OF_RANGE_LENGTH" width="11" begin="18" end="8" resetval="0x0" description="Length of command that caused an out-of-range interrupt. READ-ONLY" range="18 - 8" rwaccess="R"/> 
		<bitfield id="OUT_OF_RANGE_ADDR_1" width="1" begin="0" end="0" resetval="0x0" description="Address of command that caused an out-of-range interrupt. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_362" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_362" offset="0x5A8" width="32" description="">
		<bitfield id="OUT_OF_RANGE_SOURCE_ID" width="6" begin="5" end="0" resetval="0x0" description="Source ID of command that caused an out-of-range interrupt. READ-ONLY" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_363" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_363" offset="0x5AC" width="32" description="">
		<bitfield id="BIST_EXP_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="Expected data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_364" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_364" offset="0x5B0" width="32" description="">
		<bitfield id="BIST_EXP_DATA_1" width="32" begin="31" end="0" resetval="0x0" description="Expected data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
