IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_365" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_365" offset="0x5B4" width="32" description="">
		<bitfield id="BIST_FAIL_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="Actual data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_366" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_366" offset="0x5B8" width="32" description="">
		<bitfield id="BIST_FAIL_DATA_1" width="32" begin="31" end="0" resetval="0x0" description="Actual data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_367" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_367" offset="0x5BC" width="32" description="">
		<bitfield id="BIST_FAIL_ADDR_0" width="32" begin="31" end="0" resetval="0x0" description="Address of BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_368" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_368" offset="0x5C0" width="32" description="">
		<bitfield id="BIST_FAIL_ADDR_1" width="1" begin="0" end="0" resetval="0x0" description="Address of BIST error. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_369" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_369" offset="0x5C4" width="32" description="">
		<bitfield id="PORT_CMD_ERROR_ADDR_0" width="32" begin="31" end="0" resetval="0x0" description="Address of command that caused the PORT command error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_370" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_370" offset="0x5C8" width="32" description="">
		<bitfield id="TODTL_2CMD_F0" width="8" begin="31" end="24" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PORT_CMD_ERROR_TYPE" width="2" begin="17" end="16" resetval="0x0" description="Type of error and access type that caused the PORT command error. READ-ONLY" range="17 - 16" rwaccess="R"/> 
		<bitfield id="PORT_CMD_ERROR_ID" width="6" begin="13" end="8" resetval="0x0" description="Source ID of command that caused the PORT command error. READ-ONLY" range="13 - 8" rwaccess="R"/> 
		<bitfield id="PORT_CMD_ERROR_ADDR_1" width="1" begin="0" end="0" resetval="0x0" description="Address of command that caused the PORT command error. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_371" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_371" offset="0x5CC" width="32" description="">
		<bitfield id="TODTH_WR_F1" width="4" begin="27" end="24" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a write command. FC=1 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TODTL_2CMD_F1" width="8" begin="23" end="16" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command. FC=1 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TODTH_RD_F0" width="4" begin="11" end="8" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a read command. FC=0 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TODTH_WR_F0" width="4" begin="3" end="0" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a write command. FC=0 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_372" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_372" offset="0x5D0" width="32" description="">
		<bitfield id="TODTH_RD_F2" width="4" begin="27" end="24" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a read command. FC=2 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TODTH_WR_F2" width="4" begin="19" end="16" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a write command. FC=2 " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TODTL_2CMD_F2" width="8" begin="15" end="8" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TODTH_RD_F1" width="4" begin="3" end="0" resetval="0x0" description="Defines the DRAM minimum ODT high time after an ODT assertion for a read command. FC=1 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_373" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_373" offset="0x5D4" width="32" description="">
		<bitfield id="EN_ODT_ASSERT_EXCEPT_RD" width="1" begin="24" end="24" resetval="0x0" description="Enable controller to assert ODT at all times except during reads. Assumes single ODT pin connected. Set to 1 to enable. " range="24" rwaccess="R/W"/> 
		<bitfield id="ODT_EN_F2" width="1" begin="16" end="16" resetval="0x0" description="Enable support of DRAM ODT. When enabled, controller will assert and de-assert ODT output to DRAM as needed. FC=2 " range="16" rwaccess="R/W"/> 
		<bitfield id="ODT_EN_F1" width="1" begin="8" end="8" resetval="0x0" description="Enable support of DRAM ODT. When enabled, controller will assert and de-assert ODT output to DRAM as needed. FC=1 " range="8" rwaccess="R/W"/> 
		<bitfield id="ODT_EN_F0" width="1" begin="0" end="0" resetval="0x0" description="Enable support of DRAM ODT. When enabled, controller will assert and de-assert ODT output to DRAM as needed. FC=0 " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_374" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_374" offset="0x5D8" width="32" description="">
		<bitfield id="ODT_RD_MAP_CS0" width="2" begin="25" end="24" resetval="0x0" description="Determines which chip[s] will have termination when a read occurs. Set bit X to enable termination on csX when a read is performed. CS=0 " range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="WR_TO_ODTH_F2" width="6" begin="21" end="16" resetval="0x0" description="Defines the delay from a write command to ODT assertion. FC=2 " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="WR_TO_ODTH_F1" width="6" begin="13" end="8" resetval="0x0" description="Defines the delay from a write command to ODT assertion. FC=1 " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="WR_TO_ODTH_F0" width="6" begin="5" end="0" resetval="0x0" description="Defines the delay from a write command to ODT assertion. FC=0 " range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_375" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_375" offset="0x5DC" width="32" description="">
		<bitfield id="RD_TO_ODTH_F0" width="6" begin="29" end="24" resetval="0x0" description="Defines the delay from a read command to ODT assertion. FC=0 " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="ODT_WR_MAP_CS1" width="2" begin="17" end="16" resetval="0x0" description="Determines which chip[s] will have termination when a write occurs. Set bit X to enable termination on csX when a write is performed. CS=1 " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="ODT_RD_MAP_CS1" width="2" begin="9" end="8" resetval="0x0" description="Determines which chip[s] will have termination when a read occurs. Set bit X to enable termination on csX when a read is performed. CS=1 " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="ODT_WR_MAP_CS0" width="2" begin="1" end="0" resetval="0x0" description="Determines which chip[s] will have termination when a write occurs. Set bit X to enable termination on csX when a write is performed. CS=0 " range="1 - 0" rwaccess="R/W"/>
	</register>
