IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_376" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_376" offset="0x5E0" width="32" description="">
		<bitfield id="RW2MRW_DLY_F1" width="5" begin="28" end="24" resetval="0x8" description="Additional delay to insert between read or write and mode_reg_write. Allowed programming dependent on memory system. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="RW2MRW_DLY_F0" width="5" begin="20" end="16" resetval="0x8" description="Additional delay to insert between read or write and mode_reg_write. Allowed programming dependent on memory system. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="RD_TO_ODTH_F2" width="6" begin="13" end="8" resetval="0x0" description="Defines the delay from a read command to ODT assertion. FC=2 " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="RD_TO_ODTH_F1" width="6" begin="5" end="0" resetval="0x0" description="Defines the delay from a read command to ODT assertion. FC=1 " range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_377" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_377" offset="0x5E4" width="32" description="">
		<bitfield id="W2R_DIFFCS_DLY_F0" width="5" begin="28" end="24" resetval="0x1" description="Additional delay to insert between writes and reads to different chip selects. Allowed programming dependent on memory system. FC=0 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="R2W_DIFFCS_DLY_F0" width="5" begin="20" end="16" resetval="0x1" description="Additional delay to insert between reads and writes to different chip selects. Program to a non-zero value. FC=0 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="R2R_DIFFCS_DLY_F0" width="5" begin="12" end="8" resetval="0x1" description="Additional delay to insert between reads to different chip selects. Program to a non-zero value. FC=0 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="RW2MRW_DLY_F2" width="5" begin="4" end="0" resetval="0x8" description="Additional delay to insert between read or write and mode_reg_write. Allowed programming dependent on memory system. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_378" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_378" offset="0x5E8" width="32" description="">
		<bitfield id="W2R_DIFFCS_DLY_F1" width="5" begin="28" end="24" resetval="0x1" description="Additional delay to insert between writes and reads to different chip selects. Allowed programming dependent on memory system. FC=1 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="R2W_DIFFCS_DLY_F1" width="5" begin="20" end="16" resetval="0x1" description="Additional delay to insert between reads and writes to different chip selects. Program to a non-zero value. FC=1 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="R2R_DIFFCS_DLY_F1" width="5" begin="12" end="8" resetval="0x1" description="Additional delay to insert between reads to different chip selects. Program to a non-zero value. FC=1 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="W2W_DIFFCS_DLY_F0" width="5" begin="4" end="0" resetval="0x1" description="Additional delay to insert between writes to different chip selects. Program to a non-zero value. FC=0 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_379" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_379" offset="0x5EC" width="32" description="">
		<bitfield id="W2R_DIFFCS_DLY_F2" width="5" begin="28" end="24" resetval="0x1" description="Additional delay to insert between writes and reads to different chip selects. Allowed programming dependent on memory system. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="R2W_DIFFCS_DLY_F2" width="5" begin="20" end="16" resetval="0x1" description="Additional delay to insert between reads and writes to different chip selects. Program to a non-zero value. FC=2 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="R2R_DIFFCS_DLY_F2" width="5" begin="12" end="8" resetval="0x1" description="Additional delay to insert between reads to different chip selects. Program to a non-zero value. FC=2 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="W2W_DIFFCS_DLY_F1" width="5" begin="4" end="0" resetval="0x1" description="Additional delay to insert between writes to different chip selects. Program to a non-zero value. FC=1 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_380" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_380" offset="0x5F0" width="32" description="">
		<bitfield id="R2W_SAMECS_DLY_F2" width="5" begin="28" end="24" resetval="0x2" description="Additional delay to insert between reads and writes to the same chip select. Program to a non-zero value. FC=2 " range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="R2W_SAMECS_DLY_F1" width="5" begin="20" end="16" resetval="0x2" description="Additional delay to insert between reads and writes to the same chip select. Program to a non-zero value. FC=1 " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="R2W_SAMECS_DLY_F0" width="5" begin="12" end="8" resetval="0x2" description="Additional delay to insert between reads and writes to the same chip select. Program to a non-zero value. FC=0 " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="W2W_DIFFCS_DLY_F2" width="5" begin="4" end="0" resetval="0x1" description="Additional delay to insert between writes to different chip selects. Program to a non-zero value. FC=2 " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_381" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_381" offset="0x5F4" width="32" description="">
		<bitfield id="TDQSCK_MAX_F0" width="4" begin="27" end="24" resetval="0x0" description="Additional delay needed for tDQSCK. FC=0 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="W2W_SAMECS_DLY" width="5" begin="20" end="16" resetval="0x0" description="Additional delay to insert between two writes to the same chip select. Any value including 0 supported. " range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="W2R_SAMECS_DLY" width="5" begin="12" end="8" resetval="0x0" description="Additional delay to insert between writes and reads to the same chip select. " range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="R2R_SAMECS_DLY" width="5" begin="4" end="0" resetval="0x0" description="Additional delay to insert between two reads to the same chip select. Any value including 0 supported. " range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_382" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_382" offset="0x5F8" width="32" description="">
		<bitfield id="TDQSCK_MAX_F2" width="4" begin="27" end="24" resetval="0x0" description="Additional delay needed for tDQSCK. FC=2 " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TDQSCK_MIN_F1" width="3" begin="18" end="16" resetval="0x0" description="Additional delay needed for tDQSCK. FC=1 " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="TDQSCK_MAX_F1" width="4" begin="11" end="8" resetval="0x0" description="Additional delay needed for tDQSCK. FC=1 " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TDQSCK_MIN_F0" width="3" begin="2" end="0" resetval="0x0" description="Additional delay needed for tDQSCK. FC=0 " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_383" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_383" offset="0x5FC" width="32" description="">
		<bitfield id="AXI0_R_PRIORITY" width="3" begin="26" end="24" resetval="0x0" description="Priority of read commands from AXI port 0. 0 is the highest priority. This may only be changed before initialization begins or when the controller is quiescent, there is no data in the port FIFOs, and the AXI0_FIXED_PORT_PRIORITY_ENABLE parameter is low. " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="AXI0_FIXED_PORT_PRIORITY_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="Defines the priority control for AXI port 0 as per-port or per-command. Set to 1 for per-port with priority defined through the AXI.0._R_PRIORITY and AXI.0._W_PRIORITY parameters. Clear to 0 for per-command. " range="16" rwaccess="R/W"/> 
		<bitfield id="AXI0_ALL_STROBES_USED_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Enables use of the AWALLSTRB signal for AXI port 0. Set to 1 to enable. " range="8" rwaccess="R/W"/> 
		<bitfield id="TDQSCK_MIN_F2" width="3" begin="2" end="0" resetval="0x0" description="Additional delay needed for tDQSCK. FC=2 " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_384" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_384" offset="0x600" width="32" description="">
		<bitfield id="TDFI_PHY_RDLAT_F0" width="8" begin="31" end="24" resetval="0x6" description="Defines the DFI tPHY_RDLAT timing parameter [in DFI PHY clocks], the maximum cycles between a dfi_rddata_en assertion and a dfi_rddata_valid assertion. FC=0 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="MEM_RST_VALID" width="1" begin="16" end="16" resetval="0x0" description="Register access to mem_rst_valid signal. READ-ONLY " range="16" rwaccess="R"/> 
		<bitfield id="CKE_STATUS" width="2" begin="9" end="8" resetval="0x0" description="Register access to cke_status signal. READ-ONLY " range="9 - 8" rwaccess="R"/> 
		<bitfield id="AXI0_W_PRIORITY" width="3" begin="2" end="0" resetval="0x0" description="Priority of write commands from AXI port 0. 0 is the highest priority. This may only be changed before initialization begins or when the controller is quiescent, there is no data in the port FIFOs, and the AXI0_FIXED_PORT_PRIORITY_ENABLE parameter is low. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_385" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_385" offset="0x604" width="32" description="">
		<bitfield id="TDFI_CTRLUPD_MAX_F0" width="21" begin="20" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MAX timing parameter [in DFI clocks], the maximum cycles that dfi_ctrlupd_req can be asserted. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the UPDATE_ERROR_STATUS parameter. FC=0 " range="20 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_386" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_386" offset="0x608" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE0_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE0 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 0. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] set in the UPDATE_ERROR_STATUS parameter. FC=0 " range="31 - 0" rwaccess="R/W"/>
	</register>
