IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_398" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_398" offset="0x638" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE3_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE3 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 3. If programmed to a non-zero, a timing violation will cause an interrupt and bit [4] set in the UPDATE_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_399" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_399" offset="0x63C" width="32" description="">
		<bitfield id="TDFI_PHYUPD_RESP_F1" width="23" begin="22" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_phyupd_req assertion and a dfi_phyupd_ack assertion. If programmed to a non-zero, a timing violation will cause an interrupt and bit [5] set in the UPDATE_ERROR_STATUS parameter. FC=1 " range="22 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_400" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_400" offset="0x640" width="32" description="">
		<bitfield id="TDFI_CTRLUPD_INTERVAL_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_INTERVAL timing parameter [in DFI clocks], the maximum cycles between dfi_ctrlupd_req assertions. If programmed to a non-zero, a timing violation will cause an interrupt and bit [6] set in the UPDATE_ERROR_STATUS parameter. FC=1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_401" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_401" offset="0x644" width="32" description="">
		<bitfield id="TDFI_RDDATA_EN_F1" width="8" begin="31" end="24" resetval="0x0" description="DFI tRDDATA_EN timing parameter.  This is the number of DFI data phases between a read command and the first assertion of dfi_rddata_en_pN. FC=1 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TDFI_RDCSLAT_F1" width="8" begin="23" end="16" resetval="0x0" description="Defines the DFI tPHY_RDCSLAT timing parameter [in DFI PHY clocks], the maximum cycles between a read command and a dfi_rddata_cs_n assertion. FC=1 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_PHY_WRDATA_F1" width="3" begin="10" end="8" resetval="0x0" description="Defines the DFI tPHY_WRDATA timing parameter [in DFI PHY clocks], the maximum cycles between a dfi_wrdata_en assertion and a dfi_wrdata signal. FC=1 " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_CTRL_DELAY_F1" width="4" begin="3" end="0" resetval="0x2" description="Defines the DFI tCTRL_DELAY timing parameter [in DFI clocks], the delay between a DFI command change and a memory command. FC=1 " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_402" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_402" offset="0x648" width="32" description="">
		<bitfield id="TDFI_PHY_RDLAT_F2" width="8" begin="23" end="16" resetval="0x6" description="Defines the DFI tPHY_RDLAT timing parameter [in DFI PHY clocks], the maximum cycles between a dfi_rddata_en assertion and a dfi_rddata_valid assertion. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_PHY_WRLAT_F1" width="8" begin="15" end="8" resetval="0x0" description="DFI tPHY_WRLAT timing parameter. This is the number of DFI data phases between a write command and the first assertion of dfi_wrdata_en_pN. FC=1 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_WRCSLAT_F1" width="8" begin="7" end="0" resetval="0x0" description="Defines the DFI tPHY_WRCSLAT timing parameter [in DFI PHY clocks], the maximum cycles between a write command and a dfi_wrdata_cs_n assertion. FC=1 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_403" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_403" offset="0x64C" width="32" description="">
		<bitfield id="TDFI_CTRLUPD_MAX_F2" width="21" begin="20" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MAX timing parameter [in DFI clocks], the maximum cycles that dfi_ctrlupd_req can be asserted. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="20 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_404" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_404" offset="0x650" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE0_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE0 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 0. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_405" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_405" offset="0x654" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE1_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE1 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 1. If programmed to a non-zero, a timing violation will cause an interrupt and bit [2] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_406" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_406" offset="0x658" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE2_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE2 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 2. If programmed to a non-zero, a timing violation will cause an interrupt and bit [3] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_407" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_407" offset="0x65C" width="32" description="">
		<bitfield id="TDFI_PHYUPD_TYPE3_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_TYPE3 timing parameter [in DFI clocks], the maximum cycles that dfi_phyupd_req can assert after dfi_phyupd_ack for dfi_phyupd_type 3. If programmed to a non-zero, a timing violation will cause an interrupt and bit [4] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_408" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_408" offset="0x660" width="32" description="">
		<bitfield id="TDFI_PHYUPD_RESP_F2" width="23" begin="22" end="0" resetval="0x0" description="Defines the DFI tPHYUPD_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_phyupd_req assertion and a dfi_phyupd_ack assertion. If programmed to a non-zero, a timing violation will cause an interrupt and bit [5] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="22 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_409" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_409" offset="0x664" width="32" description="">
		<bitfield id="TDFI_CTRLUPD_INTERVAL_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_INTERVAL timing parameter [in DFI clocks], the maximum cycles between dfi_ctrlupd_req assertions. If programmed to a non-zero, a timing violation will cause an interrupt and bit [6] set in the UPDATE_ERROR_STATUS parameter. FC=2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_410" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_410" offset="0x668" width="32" description="">
		<bitfield id="TDFI_RDDATA_EN_F2" width="8" begin="31" end="24" resetval="0x0" description="DFI tRDDATA_EN timing parameter.  This is the number of DFI data phases between a read command and the first assertion of dfi_rddata_en_pN. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TDFI_RDCSLAT_F2" width="8" begin="23" end="16" resetval="0x0" description="Defines the DFI tPHY_RDCSLAT timing parameter [in DFI PHY clocks], the maximum cycles between a read command and a dfi_rddata_cs_n assertion. FC=2 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_PHY_WRDATA_F2" width="3" begin="10" end="8" resetval="0x0" description="Defines the DFI tPHY_WRDATA timing parameter [in DFI PHY clocks], the maximum cycles between a dfi_wrdata_en assertion and a dfi_wrdata signal. FC=2 " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_CTRL_DELAY_F2" width="4" begin="3" end="0" resetval="0x2" description="Defines the DFI tCTRL_DELAY timing parameter [in DFI clocks], the delay between a DFI command change and a memory command. FC=2 " range="3 - 0" rwaccess="R/W"/>
	</register>
