IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_411" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_411" offset="0x66C" width="32" description="">
		<bitfield id="DLL_RST_DELAY" width="16" begin="31" end="16" resetval="0x0" description="Minimum cycles required for DLL reset signal dll_rst_n to be held. If this signal is not being used by the PHY, this parameter may be ignored. " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_PHY_WRLAT_F2" width="8" begin="15" end="8" resetval="0x0" description="DFI tPHY_WRLAT timing parameter. This is the number of DFI data phases between a write command and the first assertion of dfi_wrdata_en_pN. FC=2 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_WRCSLAT_F2" width="8" begin="7" end="0" resetval="0x0" description="Defines the DFI tPHY_WRCSLAT timing parameter [in DFI PHY clocks], the maximum cycles between a write command and a dfi_wrdata_cs_n assertion. FC=2 " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_412" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_412" offset="0x670" width="32" description="">
		<bitfield id="DRAM_CLK_DISABLE" width="2" begin="17" end="16" resetval="0x0" description="Set value for the dfi_dram_clk_disable signal. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to disable. " range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="UPDATE_ERROR_STATUS" width="7" begin="14" end="8" resetval="0x0" description="Identifies the source of any DFI MC-initiated or PHY-initiated update errors. Value of 1 indicates a timing violation of the associated timing parameter. READ-ONLY " range="14 - 8" rwaccess="R"/> 
		<bitfield id="DLL_RST_ADJ_DLY" width="8" begin="7" end="0" resetval="0x0" description="Minimum cycles after setting master delay in DLL until the DLL reset signal dll_rst_n may be asserted. If this signal is not being used by the PHY, this parameter may be ignored. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_413" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_413" offset="0x674" width="32" description="">
		<bitfield id="TDFI_DRAM_CLK_ENABLE" width="4" begin="27" end="24" resetval="0x0" description="Defines the DFI tDRAM_CLK_ENABLE timing parameter [in DFI clocks], the delay between a dfi_dram_clk_disable de-assertion and the memory clock enable. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TDFI_DRAM_CLK_DISABLE" width="4" begin="19" end="16" resetval="0x0" description="Defines the DFI tDRAM_CLK_DISABLE timing parameter [in DFI clocks], the delay between a dfi_dram_clock_disable assertion and the memory clock disable. " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_CTRLUPD_MIN" width="16" begin="15" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MIN timing parameter [in DFI clocks], the minimum cycles that dfi_ctrlupd_req must be asserted. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_414" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_414" offset="0x678" width="32" description="">
		<bitfield id="STRATEGY_2TICK_COUNT" width="3" begin="26" end="24" resetval="0x0" description="NEED TO FiLL IN . " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="DISABLE_MEMORY_MASKED_WRITE" width="1" begin="16" end="16" resetval="0x0" description="Restricts the controller from masked write commands. Set to 1 to not issue these commands. Only used if connected to an LPDDR4 device. " range="16" rwaccess="R/W"/> 
		<bitfield id="TDFI_WRDATA_DELAY" width="8" begin="15" end="8" resetval="0x0" description="Defines the tWRDATA_DELAY timing parameter [in DFI PHY clocks], the maximum cycles between when the dfi_wrdata_en signal is asserted and when the corresponding write data transfer is completed on the DRAM bus. " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_PARIN_LAT" width="3" begin="2" end="0" resetval="0x0" description="Defines the DFI tPARIN_LAT timing parameter [in DFI PHY clocks], the maximum cycles between a DFI command and a dfi_parity_in signal assertion. " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_415" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_415" offset="0x67C" width="32" description="">
		<bitfield id="BANK_ACTIVATE_4TICK_COUNT" width="3" begin="26" end="24" resetval="0x1" description="NEED TO FiLL IN . " range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="STRATEGY_4TICK_COUNT" width="3" begin="18" end="16" resetval="0x1" description="NEED TO FiLL IN . " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PRE_2TICK_COUNT" width="3" begin="10" end="8" resetval="0x0" description="NEED TO FiLL IN . " range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="BANK_ACTIVATE_2TICK_COUNT" width="3" begin="2" end="0" resetval="0x0" description="NEED TO FiLL IN . " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_416" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_416" offset="0x680" width="32" description="">
		<bitfield id="TMP_NXN_TICK_PLUS_ADJ" width="4" begin="27" end="24" resetval="0x0" description="NEED TO FiLL IN . " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TMP_2X4_TICK_MINUS_ADJ" width="4" begin="19" end="16" resetval="0x1" description="NEED TO FiLL IN . " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TMP_2X4_TICK_PLUS_ADJ" width="4" begin="11" end="8" resetval="0x0" description="NEED TO FiLL IN . " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PRE_4TICK_COUNT" width="3" begin="2" end="0" resetval="0x1" description="NEED TO FiLL IN . " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_417" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_417" offset="0x684" width="32" description="">
		<bitfield id="TRAS_TICK_PLUS_ADJ" width="4" begin="27" end="24" resetval="0x1" description="NEED TO FiLL IN . " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="ODT_TICK_MINUS_ADJ" width="4" begin="19" end="16" resetval="0x1" description="NEED TO FiLL IN . " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="ODT_TICK_PLUS_ADJ" width="4" begin="11" end="8" resetval="0x0" description="NEED TO FiLL IN . " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TMP_NXN_TICK_MINUS_ADJ" width="4" begin="3" end="0" resetval="0x1" description="NEED TO FiLL IN . " range="3 - 0" rwaccess="R/W"/>
	</register>
