IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_418" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_418" offset="0x688" width="32" description="">
		<bitfield id="TWR_TICK_PLUS_ADJ" width="4" begin="27" end="24" resetval="0x2" description="NEED TO FiLL IN . " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TRP_TICK_MINUS_ADJ" width="4" begin="19" end="16" resetval="0x0" description="NEED TO FiLL IN . " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TRP_TICK_PLUS_ADJ" width="4" begin="11" end="8" resetval="0x1" description="NEED TO FiLL IN . " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TRAS_TICK_MINUS_ADJ" width="4" begin="3" end="0" resetval="0x0" description="NEED TO FiLL IN . " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_419" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_419" offset="0x68C" width="32" description="">
		<bitfield id="TRFC_TICK_PLUS_ADJ" width="4" begin="27" end="24" resetval="0x0" description="NEED TO FiLL IN . " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TMP_4X2_TICK_MINUS_ADJ" width="4" begin="19" end="16" resetval="0x0" description="NEED TO FiLL IN . " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TMP_4X2_TICK_PLUS_ADJ" width="4" begin="11" end="8" resetval="0x2" description="NEED TO FiLL IN . " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TWR_TICK_MINUS_ADJ" width="4" begin="3" end="0" resetval="0x0" description="NEED TO FiLL IN . " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_420" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_420" offset="0x690" width="32" description="">
		<bitfield id="WL_TICK_PLUS_ADJ" width="4" begin="27" end="24" resetval="0x2" description="NEED TO FiLL IN . " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="RL_TICK_MINUS_ADJ" width="4" begin="19" end="16" resetval="0x0" description="NEED TO FiLL IN . " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="RL_TICK_PLUS_ADJ" width="4" begin="11" end="8" resetval="0x2" description="NEED TO FiLL IN . " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TRFC_TICK_MINUS_ADJ" width="4" begin="3" end="0" resetval="0x1" description="NEED TO FiLL IN . " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_421" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_421" offset="0x694" width="32" description="">
		<bitfield id="NWR_F2" width="8" begin="31" end="24" resetval="0x40" description="DRAM NWR value in cycles. FC=2 " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="NWR_F1" width="8" begin="23" end="16" resetval="0x40" description="DRAM NWR value in cycles. FC=1 " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NWR_F0" width="8" begin="15" end="8" resetval="0x40" description="DRAM NWR value in cycles. FC=0 " range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="WL_TICK_MINUS_ADJ" width="4" begin="3" end="0" resetval="0x0" description="NEED TO FiLL IN . " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_422" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_CTL_422" offset="0x698" width="32" description="">
		<bitfield id="TDFI_CTRLMSG_RESP_F2" width="7" begin="22" end="16" resetval="0x0" description="Defines the DFI tCTRLMSG_RESP timing parameter [in DFI clocks], the maximum number of DFI clocks allowed for dfi_ctrlmsg_ack to assert after dfi_ctrlmsg_req goes high. FC=2 " range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="TDFI_CTRLMSG_RESP_F1" width="7" begin="14" end="8" resetval="0x0" description="Defines the DFI tCTRLMSG_RESP timing parameter [in DFI clocks], the maximum number of DFI clocks allowed for dfi_ctrlmsg_ack to assert after dfi_ctrlmsg_req goes high. FC=1 " range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="TDFI_CTRLMSG_RESP_F0" width="7" begin="6" end="0" resetval="0x0" description="Defines the DFI tCTRLMSG_RESP timing parameter [in DFI clocks], the maximum number of DFI clocks allowed for dfi_ctrlmsg_ack to assert after dfi_ctrlmsg_req goes high. FC=0 " range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_0" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_0" offset="0x2000" width="32" description="">
		<bitfield id="PI_DRAM_CLASS" width="4" begin="11" end="8" resetval="0x0" description="Defines the memory class for the PI." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_START" width="1" begin="0" end="0" resetval="0x0" description="Initiate command processing in the PI. Set to 1 to initiate." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_1" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_1" offset="0x2004" width="32" description="">
		<bitfield id="PI_VERSION_0" width="32" begin="31" end="0" resetval="0x2928507362" description="Holds the PI version number. This is a unique number for each PHY IP delivery. This will help in identifying different version of the PHY IP. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_2" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_2" offset="0x2008" width="32" description="">
		<bitfield id="PI_VERSION_1" width="32" begin="31" end="0" resetval="0x118797680" description="Holds the PI version number. This is a unique number for each PHY IP delivery. This will help in identifying different version of the PHY IP. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_3" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_3" offset="0x200C" width="32" description="">
		<bitfield id="PI_NORMAL_LVL_SEQ" width="1" begin="24" end="24" resetval="0x0" description="Enable the PI to finish all the pending leveling before releasing the DFI bus." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_RELEASE_DFI" width="1" begin="16" end="16" resetval="0x1" description="This is a status whether PI has release DFI. READ-ONLY." range="16" rwaccess="R"/> 
		<bitfield id="PI_ID" width="16" begin="15" end="0" resetval="0x4999" description="Holds the PI ID number. This is a Cadence DDR PHY IP identifier. It is set to 0x1387. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_4" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_4" offset="0x2010" width="32" description="">
		<bitfield id="PI_TCMD_GAP" width="16" begin="31" end="16" resetval="0x0" description="Specifies the minimum gap in DFI clocks between two commands. Used to guard the timing from the last command of MC and the first command of PI when MC hand over the control of DFI to PI." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_NOTCARE_PHYUPD" width="2" begin="9" end="8" resetval="0x0" description="Allow the PI to issue a master request to the controller if a phyupd_req from the PHY has been detected.bit[1] represents supports in normal state;bit[0] represents supports in initialization state. Set to 1 to issue the master request." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_INIT_LVL_EN" width="1" begin="0" end="0" resetval="0x0" description="Enables the initial leveling sequence after PI initialization procedure. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_5" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_5" offset="0x2014" width="32" description="">
		<bitfield id="PI_DFI_PHYMSTR_TYPE" width="2" begin="25" end="24" resetval="0x0" description="DFI Master Request Type used for dfi 4.1 verision: This signal indicates the required state of DRAM when PHY becomes the master. Each memory rank uses one bit. 1'b0: IDLE. The MC should close all the pages. 1'b1: IDLE or Self Refresh." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_DFI_VERSION" width="1" begin="16" end="16" resetval="0x0" description="Define the DFI master version, set 1 for DFI4.1, set 0 for DFI4.0" range="16" rwaccess="R/W"/> 
		<bitfield id="PI_TRAIN_ALL_FREQ_REQ" width="1" begin="8" end="8" resetval="0x0" description="Triggers training for all supported frequencies in PI_FREQ_MAP. Applies to LPDDR4 devices onlyh. Set to 1 to trigger. Only applicable after memory initialization has been completed. Can be used to train new frequencies that were not available at initialization time. WRITE-ONLY" range="8" rwaccess="W"/>
	</register>
