IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_6" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_6" offset="0x2018" width="32" description="">
		<bitfield id="PI_DFI_PHYMSTR_STATE_SEL_R" width="1" begin="8" end="8" resetval="0x0" description="DFI PHY Master State Select: Indication from the PHY to the MC whether the requested memory state is IDLE or Self refresh. 'b0: indicates that the corresponding CS must be put into the IDLE state. 'b1: indicates that the corresponding CS must be put into the Self refresh state." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_DFI_PHYMSTR_CS_STATE_R" width="1" begin="0" end="0" resetval="0x0" description="This signal indicates the state of the DRAM when the PHY becomes the master. 'b0: The PHY specifies the required state, using the dfi_phymstr_state_sel signal. 'b1: is reserved." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_7" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_7" offset="0x201C" width="32" description="">
		<bitfield id="PI_TDFI_PHYMSTR_MAX" width="32" begin="31" end="0" resetval="0x0" description="Indicates the maximum number of DFI clock cycles registered while the dfi_phymstr_req signal is asserted and the dfi_phymstr_ack signal is asserted. READ-ONLY." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_8" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_8" offset="0x2020" width="32" description="">
		<bitfield id="PI_TDFI_PHYMSTR_RESP" width="20" begin="19" end="0" resetval="0x0" description="Indicates the maximum number of DFI clock cycles registered between a dfi_phymstr_req signal assertion and a dfi_phymstr_ack signal assertion. READ-ONLY" range="19 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_9" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_9" offset="0x2024" width="32" description="">
		<bitfield id="PI_TDFI_PHYUPD_RESP" width="20" begin="19" end="0" resetval="0x0" description="Indicates the maximum number of DFI clock cycles registered between a dfi_phyupd_req signal assertion and a dfi_phyupd_ack signal assertion. READ-ONLY." range="19 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_10" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_10" offset="0x2028" width="32" description="">
		<bitfield id="PI_TDFI_PHYUPD_MAX" width="32" begin="31" end="0" resetval="0x0" description="Indicates the maximum number of DFI clock cycles registered while the dfi_phyupd_req signal is asserted and the dfi_phy_ack signal is asserted. READ-ONLY." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_11" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_11" offset="0x202C" width="32" description="">
		<bitfield id="PI_INIT_DFS_CALVL_ONLY" width="1" begin="8" end="8" resetval="0x0" description="Enables frequency training for CA leveling only. Other trainings are not performed." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_INIT_WORK_FREQ" width="5" begin="4" end="0" resetval="0x0" description="Indicates the initial work frequency after initialization and initial leveling sequence." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_12" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_12" offset="0x2030" width="32" description="">
		<bitfield id="PI_FREQ_MAP" width="32" begin="31" end="0" resetval="0x0" description="Frequency map for supported working frequencies. Each bit represents one supported frequency." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_13" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_13" offset="0x2034" width="32" description="">
		<bitfield id="PI_SWLVL_CS_SEL" width="1" begin="24" end="24" resetval="0x0" description="Defines which chip selects are active in swlvl, 0 for binary, 1 for one-hot." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_CS_MAP" width="2" begin="17" end="16" resetval="0x3" description="Defines which chip selects are active." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_SW_RST_N" width="1" begin="0" end="0" resetval="0x1" description="User request to reset the whole PI except the parameter modules. Set 0 to reset, set to 1 to release." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_14" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_14" offset="0x2038" width="32" description="">
		<bitfield id="PI_TMRR" width="4" begin="27" end="24" resetval="0x0" description="DRAM tMRR value in memory clock cycles." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_SRX_LVL_TARGET_CS_EN" width="1" begin="16" end="16" resetval="0x0" description="Defines self refresh exit trigger target rank/ranks training or all ranks training. 1: The rank/ranks exit from self refresh will trigger the corresponding rank/ranks training. Note: If multiple ranks exit from self refresh, current design only support the multiple ranks srx command issues at the same time. 0: Any rank/ranks exit from self refresh will trigger all ranks training" range="16" rwaccess="R/W"/> 
		<bitfield id="PI_RANK_NUM_PER_CKE" width="5" begin="12" end="8" resetval="0x0" description="Defines the number of chip selects share one cke" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CS_MASK" width="2" begin="1" end="0" resetval="0x0" description="Defines which chip selects are active." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_15" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_15" offset="0x203C" width="32" description="">
		<bitfield id="PI_MCAREF_FORWARD_ONLY" width="1" begin="16" end="16" resetval="0x0" description="Controls the generation of AREF from the PI module or forward the MC received value." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_VRCG_EN" width="3" begin="10" end="8" resetval="0x0" description="Whether enable VRCG mode in two cases: bit0 - when DFS. bit1-when setting DQ Vref. bit2-when setting CBT." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TMPRR" width="4" begin="3" end="0" resetval="0x0" description="DRAM tMPRR value in memory clock cycles." range="3 - 0" rwaccess="R/W"/>
	</register>
