IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_16" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_16" offset="0x2040" width="32" description="">
		<bitfield id="PI_ON_DFIBUS" width="1" begin="24" end="24" resetval="0x0" description="Monitors the state of the PI controlling the DFI bus. 1 means PI is in control. READ-ONLY." range="24" rwaccess="R"/> 
		<bitfield id="PI_TREF_INTERVAL" width="20" begin="19" end="0" resetval="0x0" description="Defines the cycles between refreshes to different chip selects." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_17" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_17" offset="0x2044" width="32" description="">
		<bitfield id="PI_SW_WRLVL_RESP_0" width="1" begin="24" end="24" resetval="0x0" description="Write leveling response for data slice 0. READ-ONLY" range="24" rwaccess="R"/> 
		<bitfield id="PI_SWLVL_OP_DONE" width="1" begin="16" end="16" resetval="0x0" description="Reports the status of the software leveling operation. Value of 1 indicates operation complete. READ-ONLY" range="16" rwaccess="R"/> 
		<bitfield id="PI_SWLVL_LOAD" width="1" begin="8" end="8" resetval="0x0" description="User request to load delays and execute software leveling. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_DATA_RETENTION" width="1" begin="0" end="0" resetval="0x0" description="Monitors the readiness for the PHY to be put into data retention mode after pi_sref_entry req parameter has been written. 1 means ready for data retention. READ-ONLY." range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_18" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_18" offset="0x2048" width="32" description="">
		<bitfield id="PI_SW_CALVL_RESP_0" width="2" begin="25" end="24" resetval="0x0" description="CA leveling response for address slice 0. READ-ONLY" range="25 - 24" rwaccess="R"/> 
		<bitfield id="PI_SW_RDLVL_RESP_1" width="2" begin="17" end="16" resetval="0x0" description="Read leveling response for data slice 1. READ-ONLY" range="17 - 16" rwaccess="R"/> 
		<bitfield id="PI_SW_RDLVL_RESP_0" width="2" begin="9" end="8" resetval="0x0" description="Read leveling response for data slice 0. READ-ONLY" range="9 - 8" rwaccess="R"/> 
		<bitfield id="PI_SW_WRLVL_RESP_1" width="1" begin="0" end="0" resetval="0x0" description="Write leveling response for data slice 1. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_19" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_19" offset="0x204C" width="32" description="">
		<bitfield id="PI_SWLVL_WR_SLICE_0" width="1" begin="24" end="24" resetval="0x0" description="SW leveling write command in WDQ training. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_EXIT" width="1" begin="16" end="16" resetval="0x0" description="User request to exit software leveling. Set to 1 to exit. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_START" width="1" begin="8" end="8" resetval="0x0" description="User request to initiate software leveling of type in the SW_LEVELING_MODE parameter. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_SW_LEVELING_MODE" width="3" begin="2" end="0" resetval="0x0" description="Defines the leveling operation for software leveling. Set to 'b111 for DDR4 VREF training, set to b001 for write leveling, set to b010 for read data eye training, or set to b011 for read gate training, set to b100 for ca training, set to b101 for wdq training." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_20" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_20" offset="0x2050" width="32" description="">
		<bitfield id="PI_SWLVL_WR_SLICE_1" width="1" begin="24" end="24" resetval="0x0" description="SW leveling write command in WDQ training. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_SW_WDQLVL_RESP_0" width="2" begin="17" end="16" resetval="0x0" description="Leveling response for data slice 0. READ-ONLY" range="17 - 16" rwaccess="R"/> 
		<bitfield id="PI_SWLVL_VREF_UPDATE_SLICE_0" width="1" begin="8" end="8" resetval="0x0" description="SW leveling vref update command in WDQ training. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_RD_SLICE_0" width="1" begin="0" end="0" resetval="0x0" description="SW leveling read command in WDQ training. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_21" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_21" offset="0x2054" width="32" description="">
		<bitfield id="PI_SWLVL_SM2_START" width="1" begin="24" end="24" resetval="0x0" description="SW leveling start command for stage 2. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_SW_WDQLVL_RESP_1" width="2" begin="17" end="16" resetval="0x0" description="Leveling response for data slice 1. READ-ONLY" range="17 - 16" rwaccess="R"/> 
		<bitfield id="PI_SWLVL_VREF_UPDATE_SLICE_1" width="1" begin="8" end="8" resetval="0x0" description="SW leveling vref update command in WDQ training. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_RD_SLICE_1" width="1" begin="0" end="0" resetval="0x0" description="SW leveling read command in WDQ training. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_22" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_22" offset="0x2058" width="32" description="">
		<bitfield id="PI_DFS_PERIOD_EN" width="1" begin="24" end="24" resetval="0x0" description="Enable the DFS triggered periodic leveling." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_SEQUENTIAL_LVL_REQ" width="1" begin="16" end="16" resetval="0x0" description="User request to initiate all possible leveling sequences. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_SM2_RD" width="1" begin="8" end="8" resetval="0x0" description="SW leveling read command for stage 2. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_SWLVL_SM2_WR" width="1" begin="0" end="0" resetval="0x0" description="SW leveling write command for stage 2. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_23" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_23" offset="0x205C" width="32" description="">
		<bitfield id="PI_WRLVL_REQ" width="1" begin="24" end="24" resetval="0x0" description="User request to initiate write leveling. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_DFI40_POLARITY" width="1" begin="16" end="16" resetval="0x0" description="Defines the polarity of the dfi_wrdata_cs_n/dfi_rddata_cs_n signals." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_MPD_PERIOD_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable the max power saving mode exit triggered periodic leveling." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_SRE_PERIOD_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable the self refresh exit triggered periodic leveling." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_24" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_24" offset="0x2060" width="32" description="">
		<bitfield id="PI_WLMRD" width="6" begin="29" end="24" resetval="0x0" description="Delay from issuing MRS to first write leveling strobe." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WLDQSEN" width="6" begin="21" end="16" resetval="0x0" description="Delay from issuing MRS to first DQS strobe for write leveling." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_CS" width="1" begin="8" end="8" resetval="0x0" description="Specifies the target chip select for the write leveling operation initiated through the WRLVL_REQ parameter." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_CS_SW" width="2" begin="1" end="0" resetval="0x0" description="Specifies the target chip select for the write leveling operation initiated through the WRLVL_REQ parameter." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_25" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_25" offset="0x2064" width="32" description="">
		<bitfield id="PI_WRLVL_DISABLE_DFS" width="1" begin="24" end="24" resetval="0x0" description="Disable automatic write leveling on freq change. Set to 1 to disable wrlvl on dfs,set 0 enable wrlvl on dfs." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_ON_SREF_EXIT" width="1" begin="16" end="16" resetval="0x0" description="Enables automatic write leveling on a self-refresh exit. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_INTERVAL" width="16" begin="15" end="0" resetval="0x0" description="Number of long count sequences counted between automatic write leveling commands." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_26" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_26" offset="0x2068" width="32" description="">
		<bitfield id="PI_WRLVL_ON_MPD_EXIT" width="1" begin="24" end="24" resetval="0x0" description="Enables automatic write leveling on a maximum power down mode exit. Set to 1 to enable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_CS_MAP" width="2" begin="17" end="16" resetval="0x0" description="Defines the chip select map for write leveling operations. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable chip for write leveling." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_ROTATE" width="1" begin="8" end="8" resetval="0x0" description="Enables rotational CS for counter triggered automatic write leveling. Set to 1, only one rank's write levling will process, the rank number is rotational for each time that write leveling been triggered by counter expiring. Set to 0 or not a short pattern leveling [indicated by dfi_lvl_periodic], the counter expired write leveling will process all the ranks." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_RESP_MASK" width="2" begin="1" end="0" resetval="0x0" description="Mask for the dfi_wrlvl_resp signal during write leveling." range="1 - 0" rwaccess="R/W"/>
	</register>
