IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_27" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_27" offset="0x206C" width="32" description="">
		<bitfield id="PI_TDFI_WRLVL_EN" width="8" begin="15" end="8" resetval="0x0" description="Defines the DFI tWRLVL_EN timing parameter [in DFI clocks], the minimum cycles from a dfi_wrlvl_en assertion to the first dfi_wrlvl_strobe assertion." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_ERROR_STATUS" width="1" begin="0" end="0" resetval="0x0" description="Holds the error associated with the write level error interrupt. Bit [0] set indicates a TDFI_WRLVL_MAX parameter violation and bit [1] set indicates a TDFI_WRLVL_RESP parameter violation. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_28" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_28" offset="0x2070" width="32" description="">
		<bitfield id="PI_TDFI_WRLVL_RESP" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tWRLVL_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_wrlvl_req assertion and a dfi_wrlvl_en assertion." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_29" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_29" offset="0x2074" width="32" description="">
		<bitfield id="PI_TDFI_WRLVL_MAX" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tWRLVL_MAX timing parameter [in DFI clocks], the maximum cycles between a dfi_wrlvl_en assertion and a valid dfi_wrlvl_resp." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_30" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_30" offset="0x2078" width="32" description="">
		<bitfield id="PI_ODT_VALUE" width="2" begin="25" end="24" resetval="0x0" description="When using LPDDR4, this value will be driven out on the dfi_odt signal." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TODTH_RD" width="4" begin="19" end="16" resetval="0x0" description="Defines the minimum DRAM cycles of ODT high time for a read command, in memory clocks." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TODTH_WR" width="4" begin="11" end="8" resetval="0x0" description="Defines the minimum DRAM cycles of ODT high time for a write command, in memory clocks." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_STROBE_NUM" width="5" begin="4" end="0" resetval="0x0" description="Defines the number of write leveling strobes generated." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_31" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_31" offset="0x207C" width="32" description="">
		<bitfield id="PI_ADDRESS_MIRRORING" width="2" begin="1" end="0" resetval="0x0" description="Indicates which chip selects support address mirroring. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_32" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_32" offset="0x2080" width="32" description="">
		<bitfield id="PI_CA_PARITY_ERROR_INJECT" width="26" begin="25" end="0" resetval="0x0" description="Selects bit to corrupt on the CA bus for CA parity error injection." range="25 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_33" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_33" offset="0x2084" width="32" description="">
		<bitfield id="PI_RDLVL_GATE_REQ" width="1" begin="24" end="24" resetval="0x0" description="User request to initiate gate training. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_RDLVL_REQ" width="1" begin="16" end="16" resetval="0x0" description="User request to initiate data eye training. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_34" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_34" offset="0x2088" width="32" description="">
		<bitfield id="PI_RDLVL_CS" width="1" begin="8" end="8" resetval="0x0" description="Specifies the target chip select for the data eye training operation initiated through the RDLVL_REQ parameter or the gate training operation initiated through the RDLVL_GATE_REQ parameter." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_CS_SW" width="2" begin="1" end="0" resetval="0x0" description="Specifies the target chip select for the data eye training operation initiated through the RDLVL_REQ parameter or the gate training operation initiated through the RDLVL_GATE_REQ parameter." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_35" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_35" offset="0x208C" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_0" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 0 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_36" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_36" offset="0x2090" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_1" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 1 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_37" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_37" offset="0x2094" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_2" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 2 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_38" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_38" offset="0x2098" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_3" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 3 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_39" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_39" offset="0x209C" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_4" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 4 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_40" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_40" offset="0x20A0" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_5" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 5 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_41" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_41" offset="0x20A4" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_6" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 6 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_42" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_42" offset="0x20A8" width="32" description="">
		<bitfield id="PI_RDLVL_PAT_7" width="32" begin="31" end="0" resetval="0x0" description="Non-default pattern 7 used for read data eye training of DDR4 or LPDDR4, and read dbi training of DDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_43" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_43" offset="0x20AC" width="32" description="">
		<bitfield id="PI_RDLVL_GATE_ON_SREF_EXIT" width="1" begin="24" end="24" resetval="0x0" description="Enables automatic gate training on a self-refresh exit. Set to 1 to enable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_DISABLE_DFS" width="1" begin="16" end="16" resetval="0x0" description="Disables automatic data eye training on freq change. Set to 1 to disable rdlvl on dfs,Set to 0 to enable rdlvl on dfs." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_ON_SREF_EXIT" width="1" begin="8" end="8" resetval="0x0" description="Enables automatic data eye training on a self-refresh exit. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_SEQ_EN" width="4" begin="3" end="0" resetval="0x0" description="Specifies the pattern, format and MPR for data eye training." range="3 - 0" rwaccess="R/W"/>
	</register>
