IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_44" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_44" offset="0x20B0" width="32" description="">
		<bitfield id="PI_RDLVL_ROTATE" width="1" begin="24" end="24" resetval="0x0" description="Enables rotational CS for interval data eye training. Set to 1 for rotating CS." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_ON_MPD_EXIT" width="1" begin="16" end="16" resetval="0x0" description="Enables automatic gate training on a maximum power down mode exit. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_ON_MPD_EXIT" width="1" begin="8" end="8" resetval="0x0" description="Enables automatic data eye training on a maximum power down mode exit. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_DISABLE_DFS" width="1" begin="0" end="0" resetval="0x0" description="Disables automatic gate training on freq change. Set to 1 to disable rdlvl_gate on dfs,Set to 0 to enable rdlvl_gate on dfs." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_45" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_45" offset="0x20B4" width="32" description="">
		<bitfield id="PI_RDLVL_GATE_CS_MAP" width="2" begin="17" end="16" resetval="0x0" description="Defines the chip select map for gate training operations. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable chip for gate training." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_CS_MAP" width="2" begin="9" end="8" resetval="0x0" description="Defines the chip select map for data eye training operations. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable chip for data eye training." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_ROTATE" width="1" begin="0" end="0" resetval="0x0" description="Enables rotational CS for interval gate training. Set to 1 for rotating CS." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_46" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_46" offset="0x20B8" width="32" description="">
		<bitfield id="PI_TDFI_RDLVL_RR" width="10" begin="9" end="0" resetval="0x0" description="Defines the DFI tRDLVL_RR timing parameter [in DFI clocks], the minimum cycles between read commands." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_47" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_47" offset="0x20BC" width="32" description="">
		<bitfield id="PI_TDFI_RDLVL_RESP" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tRDLVL_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_rdlvl_req or dfi_rdlvl_gate_req assertion and a dfi_rdlvl_en or dfi_rdlvl_gate_en assertion." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_48" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_48" offset="0x20C0" width="32" description="">
		<bitfield id="PI_TDFI_RDLVL_EN" width="8" begin="15" end="8" resetval="0x0" description="Defines the DFI tRDLVL_EN timing parameter [in DFI clocks], the minimum cycles from a dfi_rdlvl_en or dfi_rdlvl_gate_en assertion to the first read or MRR. Set to 1 means the minium value[1 cycle], set to 0 means the maxium value" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_RESP_MASK" width="2" begin="1" end="0" resetval="0x0" description="Mask for the dfi_rdlvl_resp signal during data eye training." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_49" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_49" offset="0x20C4" width="32" description="">
		<bitfield id="PI_TDFI_RDLVL_MAX" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tRDLVL_MAX timing parameter [in DFI clocks], the maximum cycles between a dfi_rdlvl_en or dfi_rdlvl_gate_en assertion and a valid dfi_rdlvl_resp." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_50" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_50" offset="0x20C8" width="32" description="">
		<bitfield id="PI_RDLVL_INTERVAL" width="16" begin="23" end="8" resetval="0x0" description="Number of long count sequences counted between automatic data eye training commands." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_ERROR_STATUS" width="1" begin="0" end="0" resetval="0x0" description="Holds the error associated with the data eye training error or gate training error interrupt. Uppermost bit set indicates a TDFI_RDLVL_RESP parameter violation. Next uppermost bit set indicates a TDFI_RDLVL_MAX parameter violation. Lower bits are reserved. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_51" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_51" offset="0x20CC" width="32" description="">
		<bitfield id="PI_RDLVL_PATTERN_NUM" width="4" begin="27" end="24" resetval="0x0" description="Defines the number of pattern supported in read leveling." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_PATTERN_START" width="4" begin="19" end="16" resetval="0x0" description="Defines the start pattern in read leveling." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_INTERVAL" width="16" begin="15" end="0" resetval="0x0" description="Number of long count sequences counted between automatic gate training commands." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_52" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_52" offset="0x20D0" width="32" description="">
		<bitfield id="PI_REG_DIMM_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Enable registered DIMM operation. Set to 1 to enable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_RD_PREAMBLE_TRAINING_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable read preamble training during gate training. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_STROBE_NUM" width="5" begin="12" end="8" resetval="0x0" description="Defines the number of back to back MPC command in one read process in read gate training." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_STROBE_NUM" width="5" begin="4" end="0" resetval="0x0" description="Defines the number of back to back MPC command in one read process in read eye training." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_53" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_53" offset="0x20D4" width="32" description="">
		<bitfield id="PI_CALVL_CS_SW" width="2" begin="25" end="24" resetval="0x0" description="Specifies the target chip select for the CA training operation initiated through the CALVL_REQ parameter." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_REQ" width="1" begin="16" end="16" resetval="0x0" description="User request to initiate CA training. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PI_TDFI_PHY_WRLAT" width="8" begin="15" end="8" resetval="0x0" description="Holds the calculated DFI tPHY_WRLAT timing parameter [in DFI PHY clocks], the maximum cycles between a write command and a dfi_wrdata_en assertion. READ-ONLY" range="15 - 8" rwaccess="R"/> 
		<bitfield id="PI_TDFI_RDDATA_EN" width="8" begin="7" end="0" resetval="0x0" description="Holds the calculated DFI tRDDATA_EN timing parameter [in DFI PHY clocks], the maximum cycles between a read command and a dfi_rddata_en assertion. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_54" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_54" offset="0x20D8" width="32" description="">
		<bitfield id="PI_CALVL_SEQ_EN" width="2" begin="25" end="24" resetval="0x0" description="Specifies which CA training patterns will be used. Set to 0 for pattern 0 only, set to 1 for patterns 0 and 1, set to 2 for patterns 0, 1 and 2, or set to 3 for all patterns." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_CS" width="1" begin="0" end="0" resetval="0x0" description="Specifies the target chip select for the CA training operation initiated through the CALVL_REQ parameter." range="0" rwaccess="R/W"/>
	</register>
