IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_55" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_55" offset="0x20DC" width="32" description="">
		<bitfield id="PI_CALVL_ROTATE" width="1" begin="24" end="24" resetval="0x0" description="Enables rotational CS for interval CA training. Set to 1 for rotating CS." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_DISABLE_DFS" width="1" begin="16" end="16" resetval="0x0" description="Disables automatic CA training on freq change. Set to 1 to disable CA training on dfs, Set to 0 to enable CA training ." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_ON_SREF_EXIT" width="1" begin="8" end="8" resetval="0x0" description="Enables automatic CA training on a self-refresh exit. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_PERIODIC" width="1" begin="0" end="0" resetval="0x0" description="Enables the use of the dfi_lvl_periodic signal during CA training. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_56" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_56" offset="0x20E0" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_EN" width="8" begin="15" end="8" resetval="0x0" description="Defines the DFI tCALVL_EN timing parameter [in DFI clocks], the minimum cycles between a dfi_calvl_en assertion and a dfi_cke de-assertion." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_CS_MAP" width="2" begin="1" end="0" resetval="0x0" description="Defines the chip select map for CA training operations. Bit [0] controls cs0, bit [1] controls cs1, etc. Set each bit to 1 to enable chip for CA training." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_57" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_57" offset="0x20E4" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_RESP" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCALVL_RESP timing parameter [in DFI clocks], the maximum cycles between a dfi_calvl_req assertion and a dfi_calvl_en assertion." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_58" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_58" offset="0x20E8" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_MAX" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCALVL_MAX timing parameter [in DFI clocks], the maximum cycles between a dfi_calvl_en assertion and a valid dfi_calvl_resp." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_59" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_59" offset="0x20EC" width="32" description="">
		<bitfield id="PI_CALVL_INTERVAL" width="16" begin="31" end="16" resetval="0x0" description="Number of long count sequences counted between automatic CA training commands." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_ERROR_STATUS" width="2" begin="9" end="8" resetval="0x0" description="Holds the error associated with the CA training error interrupt. Bit [0] set indicates a TDFI_CALVL_RESP parameter violation and bit [1] set indicates a TDFI_CALVL_MAX parameter violation. READ-ONLY" range="9 - 8" rwaccess="R"/> 
		<bitfield id="PI_CALVL_RESP_MASK" width="1" begin="0" end="0" resetval="0x0" description="Mask for the dfi_calvl_resp signal during CA training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_60" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_60" offset="0x20F0" width="32" description="">
		<bitfield id="PI_TCAEXT" width="5" begin="28" end="24" resetval="0x0" description="DRAM tCAEXT value in memory cycles." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TCACKEH" width="5" begin="20" end="16" resetval="0x0" description="DRAM tCACKEH value in memory cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCAMRD" width="6" begin="13" end="8" resetval="0x0" description="DRAM tCAMRD value in memory cycles." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCACKEL" width="5" begin="4" end="0" resetval="0x0" description="DRAM tCACKEL value in memory cycles." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_61" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_61" offset="0x20F4" width="32" description="">
		<bitfield id="PI_TDFI_INIT_START_MIN" width="8" begin="31" end="24" resetval="0x0" description="Minimum number of DFI clocks before dfi_init_start can be driven after a previous command/training event." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_NORMAL_STEPSIZE" width="4" begin="19" end="16" resetval="0x0" description="The adjust step for the post-initial Vref[ca] training." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_STEPSIZE" width="4" begin="11" end="8" resetval="0x0" description="The adjust step for the initial Vref[ca] training." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CA_TRAIN_VREF_EN" width="1" begin="0" end="0" resetval="0x0" description="Control for VREF training during CA training post power-on initialization. Set to enable VREF training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_62" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_62" offset="0x20F8" width="32" description="">
		<bitfield id="PI_REFRESH_BETWEEN_SEGMENT_DISABLE" width="1" begin="24" end="24" resetval="0x1" description="Disable the refresh between CA first and second segment training. Set to 1 to disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_SW_CA_TRAIN_VREF" width="7" begin="22" end="16" resetval="0x0" description="The Vref value which is set for SW step by step CA training." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_STROBE_NUM" width="5" begin="12" end="8" resetval="0x0" description="The consecutive dfi_calvl_strobe number when updating the CA vref data." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKCKEH" width="8" begin="7" end="0" resetval="0x0" description="DRAM tCKELCK Clock and command valid before CKE HIGH." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_63" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_63" offset="0x20FC" width="32" description="">
		<bitfield id="PI_TDFI_INIT_COMPLETE_MIN" width="8" begin="31" end="24" resetval="0x0" description="Minimum number of DFI clocks from dfi_init_complete to a command/training event." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_DRAM_CLK_DISABLE_DEASSERT_SEL" width="1" begin="16" end="16" resetval="0x0" description="Indicate dfi_dram_clk_disable deassert following dfi_init_start deassert or dfi_init_complete assert. Set to 0: dfi_dram_clk_disable deassert following dfi_init_start deassert. Set to 1: dfi_dram_clk_disable deassert following dfi_init_complete assert." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_INIT_STARTORCOMPLETE_2_CLKDISABLE" width="8" begin="15" end="8" resetval="0x0" description="Defines the delay from deasserting of dfi_init_start or asserting of dfi_init_complete to deasserting of dfi_dram_clk_disable in DFI clock." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CLKDISABLE_2_INIT_START" width="8" begin="7" end="0" resetval="0x0" description="Defines the delay from the asserting of dfi_dram_clk_disable to the asserting of dfi_init_start in DFI clock." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_64" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_64" offset="0x2100" width="32" description="">
		<bitfield id="PI_MC_DFS_PI_SET_VREF_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Enable the PI to set VREF value after DFS issued by MC. MR12 and MR14 for LPDDR4. MR6 for DDR4. 1 means disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_VREFLVL_DISABLE_DFS" width="1" begin="16" end="16" resetval="0x0" description="Disables automatic VREF training on freq change. Set to 1 to disable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_PDA_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable per-DRAM addressability during VREF training. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_CS" width="1" begin="0" end="0" resetval="0x0" description="Specifies the target chip select for the VREF training operation." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_65" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_65" offset="0x2104" width="32" description="">
		<bitfield id="PI_WDQLVL_RESP_MASK" width="2" begin="25" end="24" resetval="0x0" description="Write DQ training response mask. When set to 1, the dfi_wdqlvl_en of the slice is not asserted." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_BST_NUM" width="3" begin="18" end="16" resetval="0x0" description="Defines the number of write/read bursts issued at each step in write DQ training." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_EN" width="1" begin="8" end="8" resetval="0x0" description="Control for VREF training as part of non-initialization write DQ training." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_INIT_COMPLETE_TO_MC_DELAY_COUNT" width="8" begin="7" end="0" resetval="0x0" description="It controls the time PI bypass CKE at the beginning of PI mask dfi_init_complete to controller." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_66" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_66" offset="0x2108" width="32" description="">
		<bitfield id="PI_WDQLVL_VREF_NORMAL_STEPSIZE" width="5" begin="28" end="24" resetval="0x0" description="Write DQ training vref step size for post_initial training." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_INITIAL_STEPSIZE" width="5" begin="20" end="16" resetval="0x0" description="Write DQ training vref step size for initial training." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_CS_MAP" width="2" begin="9" end="8" resetval="0x0" description="Map of CS's included in write DQ training sequence." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_ROTATE" width="1" begin="0" end="0" resetval="0x0" description="Enables write DQ training rotate for interval training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_67" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_67" offset="0x210C" width="32" description="">
		<bitfield id="PI_WDQLVL_CS" width="1" begin="24" end="24" resetval="0x0" description="Write DQ training target chip select." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_CS_SW" width="2" begin="17" end="16" resetval="0x0" description="Write DQ training target chip select." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_REQ" width="1" begin="8" end="8" resetval="0x0" description="SW write to initiate Write DQ training request. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PI_WDQLVL_PERIODIC" width="1" begin="0" end="0" resetval="0x0" description="Enables periodic write DQ training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_68" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_68" offset="0x2110" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_EN" width="8" begin="7" end="0" resetval="0x0" description="DFI timing param tWDQLVL_EN. Minimum number of DFI clocks required after the write DQ training enable signal is asserted until the first write command may be asserted." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_69" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_69" offset="0x2114" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_RESP" width="32" begin="31" end="0" resetval="0x0" description="DFI timing param tWDQLVL_RESP. Maximum number of DFI clocks that may occur between a write DQ training request and the associated mode enable." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_70" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_70" offset="0x2118" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_MAX" width="32" begin="31" end="0" resetval="0x0" description="DFI timing param tWDQLVL_MAX. Maximum number of DFI clocks that the PI will wait for a response from the PHY." range="31 - 0" rwaccess="R/W"/>
	</register>
