IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_71" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_71" offset="0x211C" width="32" description="">
		<bitfield id="PI_WDQLVL_ON_MPD_EXIT" width="1" begin="24" end="24" resetval="0x0" description="Issue a write DQ training command on maximum power saving mode exit." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_ON_SREF_EXIT" width="1" begin="16" end="16" resetval="0x0" description="Issue a write DQ training command on self-refresh exit." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_INTERVAL" width="16" begin="15" end="0" resetval="0x0" description="Sets the maximum number of long count sequences allowed between automatic write DQ training operations." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_72" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_72" offset="0x2120" width="32" description="">
		<bitfield id="PI_WDQLVL_NEED_SAVE_RESTORE" width="2" begin="17" end="16" resetval="0x0" description="Enables the use of functional DRAM address space for write DQ training, 1 = enable, not for LPDDR4." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_ERROR_STATUS" width="2" begin="9" end="8" resetval="0x0" description="Holds the error associated with the write dq level error interrupt. Bit [0] set indicates a PI_TDFI_WDQLVL_MAX parameter violation and bit [1] set indicates a PI_TDFI_WDQLVL_RESP parameter violation. READ-ONLY." range="9 - 8" rwaccess="R"/> 
		<bitfield id="PI_WDQLVL_DISABLE_DFS" width="1" begin="0" end="0" resetval="0x0" description="Disable automatic write DQ training on freq change. Set to 1 to disable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_73" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_73" offset="0x2124" width="32" description="">
		<bitfield id="PI_WDQLVL_DRAM_LVL_START_ADDR_0" width="32" begin="31" end="0" resetval="0x0" description="Start address of WDQ leveling, not for LPDDR4." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_74" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_74" offset="0x2128" width="32" description="">
		<bitfield id="PI_NO_MEMORY_DM" width="1" begin="16" end="16" resetval="0x0" description="Defines if the attached memory supports the Data Mask function, 1 = not supported." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_DM_LEVEL_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable for write DM training as part of the write DQ training, not for LPDDR4." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_DRAM_LVL_START_ADDR_1" width="1" begin="0" end="0" resetval="0x0" description="Start address of WDQ leveling, not for LPDDR4." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_75" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_75" offset="0x212C" width="32" description="">
		<bitfield id="PI_WDQLVL_NIBBLE_MODE" width="1" begin="24" end="24" resetval="0x0" description="WDQ Training Nibble mode indication. When set to 1, nibble mode is enabled, and the training timing is doubled." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_SWLVL_SM2_DM_NIBBLE_START" width="1" begin="16" end="16" resetval="0x0" description="Start command for stage 2, when in the process of DM leveling or nibble mode. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PI_TDFI_WDQLVL_WW" width="10" begin="9" end="0" resetval="0x0" description="Minimum number of DFI clocks to be inserted between write commands during the DM portion of write DQ training." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_76" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_76" offset="0x2130" width="32" description="">
		<bitfield id="PI_WDQLVL_PDA_VREF_TRAIN" width="1" begin="24" end="24" resetval="0x0" description="Enable for the use of PDA to set the VREF during write DQ training, 1 = enabled." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_PDA_EN" width="1" begin="16" end="16" resetval="0x0" description="Enable for the use of write DQ training for PDA mode, 1 = enabled." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_DQS_OSC_PERIOD_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable for DQS oscillator triggered periodic write DQ training, 1 = enabled." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_OSC_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable for DQS oscillator triggered write DQ training, 1 = enabled." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_77" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_77" offset="0x2134" width="32" description="">
		<bitfield id="PI_TCCD" width="5" begin="28" end="24" resetval="0x0" description="DRAM CAS-to-CAS value in cycles." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ROW_DIFF" width="3" begin="18" end="16" resetval="0x0" description="Difference between number of address pins available and number being used." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_BANK_DIFF" width="2" begin="9" end="8" resetval="0x0" description="Difference between number of bank pins available and number being used." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_DBILVL_RESP_MASK" width="2" begin="1" end="0" resetval="0x0" description="Mask for the dfi_rdlvl_resp signal during read dbi training." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_78" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_78" offset="0x2138" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_79" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_79" offset="0x213C" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_80" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_80" offset="0x2140" width="32" description="">
		
	</register>
