IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_81" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_81" offset="0x2144" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_82" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_82" offset="0x2148" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_83" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_83" offset="0x214C" width="32" description="">
		<bitfield id="PI_INT_STATUS" width="30" begin="29" end="0" resetval="0x0" description="Status of interrupt features in the PI. READ-ONLY" range="29 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_84" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_84" offset="0x2150" width="32" description="">
		<bitfield id="PI_INT_ACK" width="29" begin="28" end="0" resetval="0x0" description="Clear the corresponding interrupt bit of the PI_INT_STATUS parameter. WRITE-ONLY" range="28 - 0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_85" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_85" offset="0x2154" width="32" description="">
		<bitfield id="PI_INT_MASK" width="30" begin="29" end="0" resetval="0x0" description="Mask for PI_int signals from the PI_INT_STATUS parameter." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_86" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_86" offset="0x2158" width="32" description="">
		<bitfield id="PI_BIST_EXP_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="Expected data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_87" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_87" offset="0x215C" width="32" description="">
		<bitfield id="PI_BIST_EXP_DATA_1" width="32" begin="31" end="0" resetval="0x0" description="Expected data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_88" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_88" offset="0x2160" width="32" description="">
		<bitfield id="PI_BIST_FAIL_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="Actual data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_89" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_89" offset="0x2164" width="32" description="">
		<bitfield id="PI_BIST_FAIL_DATA_1" width="32" begin="31" end="0" resetval="0x0" description="Actual data on BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_90" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_90" offset="0x2168" width="32" description="">
		<bitfield id="PI_BIST_FAIL_ADDR_0" width="32" begin="31" end="0" resetval="0x0" description="The burst aligned address of BIST error. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_91" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_91" offset="0x216C" width="32" description="">
		<bitfield id="PI_CMD_SWAP_EN" width="1" begin="24" end="24" resetval="0x0" description="Command pin swap function enable" range="24" rwaccess="R/W"/> 
		<bitfield id="PI_LONG_COUNT_MASK" width="5" begin="20" end="16" resetval="0x0" description="Reduces the length of the long counter from 1024 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_BSTLEN" width="6" begin="13" end="8" resetval="0x2" description="Encoded burst length sent to DRAMs during initialization." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_FAIL_ADDR_1" width="1" begin="0" end="0" resetval="0x0" description="The burst aligned address of BIST error. READ-ONLY" range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_92" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_92" offset="0x2170" width="32" description="">
		<bitfield id="PI_BG_MUX_1" width="5" begin="28" end="24" resetval="0x0" description="Command pin BG_1 mux selector" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_BG_MUX_0" width="5" begin="20" end="16" resetval="0x0" description="Command pin BG_0 mux selector" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ACT_N_MUX" width="5" begin="12" end="8" resetval="0x0" description="Command pin ACT_N mux selector" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_PARITY_IN_MUX" width="5" begin="4" end="0" resetval="0x0" description="Command pin parity mux selector" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_93" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_93" offset="0x2174" width="32" description="">
		<bitfield id="PI_BANK_MUX_0" width="5" begin="28" end="24" resetval="0x0" description="Command pin BANK_0 mux selector" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WE_N_MUX" width="5" begin="20" end="16" resetval="0x0" description="Command pin WE_N mux selector" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CAS_N_MUX" width="5" begin="12" end="8" resetval="0x0" description="Command pin CAS_N mux selector" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RAS_N_MUX" width="5" begin="4" end="0" resetval="0x0" description="Command pin RAS_N mux selector" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_94" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_94" offset="0x2178" width="32" description="">
		<bitfield id="PI_DATA_BYTE_SWAP_SLICE1" width="1" begin="24" end="24" resetval="0x0" description="DATA pin 1 mux selector" range="24" rwaccess="R/W"/> 
		<bitfield id="PI_DATA_BYTE_SWAP_SLICE0" width="1" begin="16" end="16" resetval="0x0" description="DATA pin 0 mux selector" range="16" rwaccess="R/W"/> 
		<bitfield id="PI_DATA_BYTE_SWAP_EN" width="1" begin="8" end="8" resetval="0x0" description="DATA pin swap function enable" range="8" rwaccess="R/W"/> 
		<bitfield id="PI_BANK_MUX_1" width="5" begin="4" end="0" resetval="0x0" description="Command pin BANK_1 mux selector" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_95" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_95" offset="0x217C" width="32" description="">
		<bitfield id="PI_UPDATE_ERROR_STATUS" width="2" begin="25" end="24" resetval="0x0" description="Identifies the source of any DFI PI-initiated update errors. Value of 1 indicates a timing violation of the associated timing parameter. Bit 1-0: ctrlupd_max_error, ctrlupd_interval_error. Bit 6-2: reserved. READ-ONLY" range="25 - 24" rwaccess="R"/> 
		<bitfield id="PI_TDFI_CTRLUPD_MIN" width="16" begin="23" end="8" resetval="0x0" description="Reports the DFI tCTRLUPD_MIN timing parameter [in DFI clocks], the minimum cycles that dfi_ctrlupd_req must be asserted." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CTRLUPD_REQ_PER_AREF_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable an automatic PI initiated update [dfi_ctrlupd_req] after every refresh. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
