IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_96" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_96" offset="0x2180" width="32" description="">
		<bitfield id="PI_BIST_LFSR_PATTERN_DONE" width="1" begin="24" end="24" resetval="0x0" description="BIST operation lfsr pattern, data pattern 1'b0 means the data is useful,1'b1 means next pattern sequence can ingore. READ-ONLY" range="24" rwaccess="R"/> 
		<bitfield id="PI_BIST_RESULT" width="2" begin="17" end="16" resetval="0x0" description="BIST operation status [pass/fail]. Bit [0] indicates data check status and bit [1] indicates address check status. Value of 1 is a passing result. READ-ONLY" range="17 - 16" rwaccess="R"/> 
		<bitfield id="PI_BIST_GO" width="1" begin="8" end="8" resetval="0x0" description="Initiate a BIST operation. Set to 1 to trigger." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_PARIN_LAT" width="3" begin="2" end="0" resetval="0x0" description="Defines the DFI tPARIN_LAT timing parameter [in DFI PHY clocks], the maximum cycles between a DFI command and a dfi_parity_in signal assertion." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_97" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_97" offset="0x2184" width="32" description="">
		<bitfield id="PI_BIST_ADDR_CHECK" width="1" begin="16" end="16" resetval="0x0" description="Enable address checking with BIST operation. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_DATA_CHECK" width="1" begin="8" end="8" resetval="0x0" description="Enable data checking with BIST operation. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_ADDR_SPACE" width="8" begin="7" end="0" resetval="0x0" description="Sets the number of address bits to check during BIST operation. The end address of BIST is start_address+[1 shifted up by PI_ADDR_SPACE]-1. The end address should not beyond the actual memory address range." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_98" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_98" offset="0x2188" width="32" description="">
		<bitfield id="PI_BIST_START_ADDRESS_0" width="32" begin="31" end="0" resetval="0x0" description="Start BIST checking at this address." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_99" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_99" offset="0x218C" width="32" description="">
		<bitfield id="PI_MBIST_INIT_PATTERN" width="8" begin="15" end="8" resetval="0x0" description="PI mbist data check, random lfsr pattern mode init pattern seed." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_START_ADDRESS_1" width="1" begin="0" end="0" resetval="0x0" description="Start BIST checking at this address." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_100" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_100" offset="0x2190" width="32" description="">
		<bitfield id="PI_BIST_DATA_MASK" width="32" begin="31" end="0" resetval="0x0" description="Mask applied to data for BIST error checking. Bit [0] controls memory data path bit [0], bit [1] controls memory data path bit [1], etc. The mask range is the data transfer size in each memory clock cycle [The data on a rising edge and a failing edge]. Set each bit to 1 to mask." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_101" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_101" offset="0x2194" width="32" description="">
		<bitfield id="PI_BIST_ERR_STOP" width="12" begin="27" end="16" resetval="0x0" description="Defines the maximum number of error occurrences allowed prior to quitting when the BIST_TEST_MODE parameter is set to 1, 2 or 3. A value of 0 will allow the test to run to completion." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_ERR_COUNT" width="12" begin="11" end="0" resetval="0x0" description="Indicates the number of BIST errors found when the BIST_TEST_MODE parameter is set to 1, 2 or 3. READ-ONLY" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_102" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_102" offset="0x2198" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_0_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_103" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_103" offset="0x219C" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_0_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_104" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_104" offset="0x21A0" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_1_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_105" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_105" offset="0x21A4" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_1_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_106" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_106" offset="0x21A8" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_2_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_107" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_107" offset="0x21AC" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_2_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_108" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_108" offset="0x21B0" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_3_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
