IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_109" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_109" offset="0x21B4" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_3_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_110" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_110" offset="0x21B8" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_4_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_111" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_111" offset="0x21BC" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_4_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_112" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_112" offset="0x21C0" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_5_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_113" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_113" offset="0x21C4" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_5_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_114" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_114" offset="0x21C8" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_6_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_115" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_115" offset="0x21CC" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_6_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_116" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_116" offset="0x21D0" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_7_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_117" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_117" offset="0x21D4" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_7_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_118" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_118" offset="0x21D8" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_8_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_119" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_119" offset="0x21DC" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_8_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_120" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_120" offset="0x21E0" width="32" description="">
		<bitfield id="PI_BIST_ADDR_MASK_9_0" width="32" begin="31" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_121" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_121" offset="0x21E4" width="32" description="">
		<bitfield id="PI_BIST_PAT_MODE" width="2" begin="25" end="24" resetval="0x0" description="Sets the pattern mode of BIST. 'b00 indicates using built-in pattern. 'b01 indicates checkerboard pattern, each data transfer inverts the last data transfer based on the built-in pattern. 'b10 indicates using both user pattern and built-in pattern. 'b11 indicates using pi lfsr random pattern." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_ADDR_MODE" width="2" begin="17" end="16" resetval="0x0" description="Sets the address traversing order of BIST. 'b00 indicates fast column order [burst-column-bank-row-rank]. 'b01 indicates fast row order [burst-row-column-bank-rank]. 'b10 indicates fast bank order [burst-bank-column-row-rank]." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_MODE" width="3" begin="10" end="8" resetval="0x0" description="Sets the BIST data checking mode. 'b00 indicates MOVI13N mode. 'b01 indicates March C mode. 'b10 indicates GALPAT mode. 'b11 indicates PRBS mode. 'b100 indicates programmable March data check mode." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_BIST_ADDR_MASK_9_1" width="2" begin="1" end="0" resetval="0x0" description="Defines an address to be masked during the BIST operation.." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_122" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_122" offset="0x21E8" width="32" description="">
		<bitfield id="PI_BIST_USER_PAT_0" width="32" begin="31" end="0" resetval="0x0" description="Sets the user-specified pattern of BIST." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_123" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_123" offset="0x21EC" width="32" description="">
		<bitfield id="PI_BIST_USER_PAT_1" width="32" begin="31" end="0" resetval="0x0" description="Sets the user-specified pattern of BIST." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_124" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_124" offset="0x21F0" width="32" description="">
		<bitfield id="PI_BIST_PAT_NUM" width="6" begin="5" end="0" resetval="0x0" description="Sets the max used pattern number of BIST from a total of 8 built-in patterns. Ex. set to 3, The BIST would use pattern 1, 2 and 3." range="5 - 0" rwaccess="R/W"/>
	</register>
