IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_125" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_125" offset="0x21F4" width="32" description="">
		<bitfield id="PI_BIST_STAGE_0" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_126" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_126" offset="0x21F8" width="32" description="">
		<bitfield id="PI_BIST_STAGE_1" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_127" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_127" offset="0x21FC" width="32" description="">
		<bitfield id="PI_BIST_STAGE_2" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_128" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_128" offset="0x2200" width="32" description="">
		<bitfield id="PI_BIST_STAGE_3" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_129" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_129" offset="0x2204" width="32" description="">
		<bitfield id="PI_BIST_STAGE_4" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_130" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_130" offset="0x2208" width="32" description="">
		<bitfield id="PI_BIST_STAGE_5" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_131" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_131" offset="0x220C" width="32" description="">
		<bitfield id="PI_BIST_STAGE_6" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_132" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_132" offset="0x2210" width="32" description="">
		<bitfield id="PI_BIST_STAGE_7" width="30" begin="29" end="0" resetval="0x0" description="Sets the programmable algorithm of each stage X when pi_bist_mmode = 'h4." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_133" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_133" offset="0x2214" width="32" description="">
		<bitfield id="PI_SELF_REFRESH_EN" width="1" begin="24" end="24" resetval="0x0" description="Control for PI to enable self refresh mode. Set to 1 to enable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_CRC_CALC" width="1" begin="16" end="16" resetval="0x0" description="Defines where CRC is performed; set to 1 for PI responsibility or clear to 0 for PHY responsibility." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_BG_ROTATE_EN" width="1" begin="8" end="8" resetval="0x0" description="Enable bank group rotation. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_COL_DIFF" width="4" begin="3" end="0" resetval="0x0" description="Difference between number of column pins available and number being used." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_134" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_134" offset="0x2218" width="32" description="">
		<bitfield id="PI_SREF_ENTRY_REQ" width="1" begin="24" end="24" resetval="0x0" description="In PI power up data retention, PI can issued sref entry command. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PI_SREFRESH_EXIT_NO_REFRESH" width="1" begin="16" end="16" resetval="0x0" description="Disables the automatic refresh request associated with self-refresh exit. Set to 1 to disable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_PWRUP_SREFRESH_EXIT" width="1" begin="8" end="8" resetval="0x0" description="PI control powerup via self-refresh instead of full memory initialization. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_MC_PWRUP_SREFRESH_EXIT" width="1" begin="0" end="0" resetval="0x0" description="It indicates MC control powerup via self-refresh instead of full memory initialization. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_135" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_135" offset="0x221C" width="32" description="">
		<bitfield id="PI_NO_AUTO_MRR_INIT" width="1" begin="24" end="24" resetval="0x0" description="Disable MRR commands during initialization. Set to 1 to disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_NO_PHY_IND_TRAIN_INIT" width="1" begin="16" end="16" resetval="0x0" description="Disable PHY Independent Training during initialization. Set to 1 to disable." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_NO_MRW_INIT" width="1" begin="8" end="8" resetval="0x0" description="Disable MRW commands after training during initialization. Set to 1 to disable." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_NO_MRW_BT_INIT" width="1" begin="0" end="0" resetval="0x0" description="Disable MRW commands before training during initialization. Set to 1 to disable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_136" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_136" offset="0x2220" width="32" description="">
		<bitfield id="PI_TRST_PWRON" width="32" begin="31" end="0" resetval="0x0" description="Duration of memory reset during power-on initialization." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_137" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_137" offset="0x2224" width="32" description="">
		<bitfield id="PI_CKE_INACTIVE" width="32" begin="31" end="0" resetval="0x0" description="Number of cycles after reset before CKE will be active." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_138" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_138" offset="0x2228" width="32" description="">
		<bitfield id="PI_DLL_RST_DELAY" width="16" begin="31" end="16" resetval="0x0" description="Minimum cycles required for DLL reset signal dll_rst_n to be held." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_DRAM_INIT_EN" width="1" begin="8" end="8" resetval="0x0" description="Control for the initialization of DRAM by the PI." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_DLL_RST" width="1" begin="0" end="0" resetval="0x0" description="Enables use of the DLL reset [dll_rst_n]." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_139" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_139" offset="0x222C" width="32" description="">
		<bitfield id="PI_DLL_RST_ADJ_DLY" width="8" begin="7" end="0" resetval="0x0" description="Minimum cycles after setting master delay in DLL until the DLL reset signal dll_rst_n may be asserted." range="7 - 0" rwaccess="R/W"/>
	</register>
