IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_140" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_140" offset="0x2230" width="32" description="">
		<bitfield id="PI_WRITE_MODEREG" width="26" begin="25" end="0" resetval="0x0" description="Write memory mode register data to the DRAMs. Bits [7:0] define the memory mode register number if bit [23] is set, bits [15:8] define the chip select if bit [24] is clear, bits [23:16] define which memory mode register/s to write, bit [24] defines whether all chip selects will be written, and bit [25] triggers the write." range="25 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_141" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_141" offset="0x2234" width="32" description="">
		<bitfield id="PI_MRW_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Write memory mode register status. Bit [0] set indicates a WRITE_MODEREG parameter programming error. Bit [1] set indicates a PASR error. Bit [2] is Reserved. Bit [3] set indicates a self refresh or deep power down error. Bit [4] set indicates that a write to MR3 or MR11 was attempted [write_modereg bit [25] was asserted with bit [17] set, or bit [23] was asserted with bits [7:0] defining MR3 or MR11] during tZQCAL after a ZQ calibration start command. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_142" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_142" offset="0x2238" width="32" description="">
		<bitfield id="PI_READ_MODEREG" width="17" begin="16" end="0" resetval="0x0" description="Read the specified memory mode register from specified chip when start bit set. Bits [7:0] define the memory mode register and bits [15:8] define the chip select. Set bit [16] to 1 to trigger." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_143" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_143" offset="0x223C" width="32" description="">
		<bitfield id="PI_NO_ZQ_INIT" width="1" begin="24" end="24" resetval="0x0" description="Disable ZQ operations during initialization. Set to 1 to disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_PERIPHERAL_MRR_DATA_0" width="24" begin="23" end="0" resetval="0x0" description="Data and chip returned from memory mode register read requested by the READ_MODEREG parameter, Bits [15:0] define MRR data, [23:16] define the chip select. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_144" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_144" offset="0x2240" width="32" description="">
		<bitfield id="PI_ZQ_REQ_PENDING" width="1" begin="16" end="16" resetval="0x0" description="Indicates that a ZQ command is currently in progress or waiting to run. When this is asserted, no writes to ZQ_REQ should occur. READ-ONLY" range="16" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_145" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_145" offset="0x2244" width="32" description="">
		<bitfield id="PI_MONITOR_0" width="8" begin="31" end="24" resetval="0x0" description="Monitor register 0. READ-ONLY." range="31 - 24" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_0" width="1" begin="16" end="16" resetval="0x0" description="Selection of captures for pi_monitor_0." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_0" width="4" begin="11" end="8" resetval="0x0" description="Selection of sources for pi_monitor_0." range="11 - 8" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_146" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_146" offset="0x2248" width="32" description="">
		<bitfield id="PI_MONITOR_SRC_SEL_2" width="4" begin="27" end="24" resetval="0x0" description="Selection of sources for pi_monitor_2." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_1" width="8" begin="23" end="16" resetval="0x0" description="Monitor register 1. READ-ONLY." range="23 - 16" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_1" width="1" begin="8" end="8" resetval="0x0" description="Selection of captures for pi_monitor_1." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_1" width="4" begin="3" end="0" resetval="0x0" description="Selection of sources for pi_monitor_1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_147" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_147" offset="0x224C" width="32" description="">
		<bitfield id="PI_MONITOR_CAP_SEL_3" width="1" begin="24" end="24" resetval="0x0" description="Selection of captures for pi_monitor_3." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_3" width="4" begin="19" end="16" resetval="0x0" description="Selection of sources for pi_monitor_3." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_2" width="8" begin="15" end="8" resetval="0x0" description="Monitor register 2. READ-ONLY." range="15 - 8" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_2" width="1" begin="0" end="0" resetval="0x0" description="Selection of captures for pi_monitor_2." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_148" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_148" offset="0x2250" width="32" description="">
		<bitfield id="PI_MONITOR_4" width="8" begin="31" end="24" resetval="0x0" description="Monitor register 4. READ-ONLY." range="31 - 24" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_4" width="1" begin="16" end="16" resetval="0x0" description="Selection of captures for pi_monitor_4." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_4" width="4" begin="11" end="8" resetval="0x0" description="Selection of sources for pi_monitor_4." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_3" width="8" begin="7" end="0" resetval="0x0" description="Monitor register 3. READ-ONLY." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_149" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_149" offset="0x2254" width="32" description="">
		<bitfield id="PI_MONITOR_SRC_SEL_6" width="4" begin="27" end="24" resetval="0x0" description="Selection of sources for pi_monitor_6." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_5" width="8" begin="23" end="16" resetval="0x0" description="Monitor register 5. READ-ONLY." range="23 - 16" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_5" width="1" begin="8" end="8" resetval="0x0" description="Selection of captures for pi_monitor_5." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_5" width="4" begin="3" end="0" resetval="0x0" description="Selection of sources for pi_monitor_5." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_150" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_150" offset="0x2258" width="32" description="">
		<bitfield id="PI_MONITOR_CAP_SEL_7" width="1" begin="24" end="24" resetval="0x0" description="Selection of captures for pi_monitor_7." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_SRC_SEL_7" width="4" begin="19" end="16" resetval="0x0" description="Selection of sources for pi_monitor_7." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MONITOR_6" width="8" begin="15" end="8" resetval="0x0" description="Monitor register 6. READ-ONLY." range="15 - 8" rwaccess="R"/> 
		<bitfield id="PI_MONITOR_CAP_SEL_6" width="1" begin="0" end="0" resetval="0x0" description="Selection of captures for pi_monitor_6." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_151" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_151" offset="0x225C" width="32" description="">
		<bitfield id="PI_MONITOR_7" width="8" begin="7" end="0" resetval="0x0" description="Monitor register 7. READ-ONLY." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_152" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_152" offset="0x2260" width="32" description="">
		<bitfield id="PI_MONITOR_STROBE" width="8" begin="7" end="0" resetval="0x0" description="Strobe the pi_monitor once. Every bit corresponds respectively with a pi_monitor. WRITE-ONLY" range="7 - 0" rwaccess="W"/>
	</register>
