IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_153" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_153" offset="0x2264" width="32" description="">
		<bitfield id="PI_FREQ_RETENTION_NUM" width="5" begin="20" end="16" resetval="0x0" description="Monitor active freq number in PI for data_retention" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_FREQ_NUMBER_STATUS" width="5" begin="12" end="8" resetval="0x0" description="Monitor active freq number in PI. READ-ONLY." range="12 - 8" rwaccess="R"/> 
		<bitfield id="PI_DLL_LOCK" width="1" begin="0" end="0" resetval="0x0" description="Monitor dfi_init_complete from PHY. READ-ONLY." range="0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_154" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_154" offset="0x2268" width="32" description="">
		<bitfield id="PI_POWER_REDUC_EN" width="1" begin="16" end="16" resetval="0x0" description="PI Power reduction enable, 1 = enabled." range="16" rwaccess="R/W"/> 
		<bitfield id="PI_PHYMSTR_TYPE" width="2" begin="1" end="0" resetval="0x0" description="Defines how the controller should set the state of DRAM before turning control of the DFI bus over to the PI." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_155" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_155" offset="0x226C" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_156" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_156" offset="0x2270" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_157" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_157" offset="0x2274" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_158" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_158" offset="0x2278" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_159" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_159" offset="0x227C" width="32" description="">
		<bitfield id="PI_WRLVL_MAX_STROBE_PEND" width="8" begin="23" end="16" resetval="0x0" description="Defines the maximum number of wrlvl_strobes that be accumulated before an AREF is prevented from being generated." range="23 - 16" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_160" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_160" offset="0x2280" width="32" description="">
		<bitfield id="PI_TREFBW_THR" width="9" begin="8" end="0" resetval="0x0" description="Threshold value to control the AREF command interval. When the number of pending AREF is over this value, the interval is expanded to be tREF/8." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_161" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_161" offset="0x2284" width="32" description="">
		<bitfield id="PI_FREQ_CHANGE_REG_COPY" width="5" begin="4" end="0" resetval="0x0" description="In non-DFI 4.0 mode, contains the frequency copy value." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_162" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_162" offset="0x2288" width="32" description="">
		<bitfield id="PI_NO_CATR_READ" width="1" begin="24" end="24" resetval="0x0" description="Defines how the LPDDR4 termination status is determined. 1: PI use PI_CATR to get DRAM CA Termination status. 0: PI reads DRAM MR0.OP7 to get DRAM CA Termination status." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_CATR" width="2" begin="17" end="16" resetval="0x0" description="It indicates LP4 DRAM CA terminition ON/OFF state. Each bit corresponds to each chip select. 1:ON 0:OFF. This parameter is active when PI_NO_CATR_READ==1. When PI_NO_CATR_READ==0, this param is inactive" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_FREQ_SEL_FROM_REGIF" width="1" begin="0" end="0" resetval="0x0" description="In non-DFI 4.0 mode, user select the frequency copies from pi_freq_change_reg_copy." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_163" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_163" offset="0x228C" width="32" description="">
		<bitfield id="PI_NOTCARE_MC_INIT_START" width="1" begin="24" end="24" resetval="0x0" description="Defines whether PI waits for the controller to initiate dfi_init_start before PI memory initialization, 1: wait for dfi_init_start" range="24" rwaccess="R/W"/> 
		<bitfield id="PI_DISABLE_PHYMSTR_REQ" width="1" begin="16" end="16" resetval="0x0" description="PI mask dfi_phymstr_req to the controller and get dfi bus without dfi_phymstr_ack, 1: disconnect" range="16" rwaccess="R/W"/> 
		<bitfield id="PI_DISCONNECT_MC" width="1" begin="8" end="8" resetval="0x0" description="PI disconnects the controller from the PHY, 1: disconnect" range="8" rwaccess="R/W"/> 
		<bitfield id="PI_MASK_INIT_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description="Enable the masking of the dfi_init_complete signal back to the controller, 1: mask." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_164" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_164" offset="0x2290" width="32" description="">
		<bitfield id="PI_TVREF_F0" width="16" begin="23" end="8" resetval="0x0" description="Defines the number of cycles that the PI should wait before issuing the next command after a VREF training MRW command for frequency set 0." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_PHYMSTR_REQ_ACK_LOOP_DELAY" width="3" begin="2" end="0" resetval="0x0" description="The delay between phymstr_req and inner phymstr_ack when PI_DISABLE_PHYMSTR_REQ set 1" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_165" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_165" offset="0x2294" width="32" description="">
		<bitfield id="PI_TVREF_F2" width="16" begin="31" end="16" resetval="0x0" description="Defines the number of cycles that the PI should wait before issuing the next command after a VREF training MRW command for frequency set 2." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TVREF_F1" width="16" begin="15" end="0" resetval="0x0" description="Defines the number of cycles that the PI should wait before issuing the next command after a VREF training MRW command for frequency set 1." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_166" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_166" offset="0x2298" width="32" description="">
		<bitfield id="PI_TSDO_F2" width="8" begin="23" end="16" resetval="0x0" description="The delay from the read preamble training MRS command to the data strobe drive out for frequency set 2, in PI clocks" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TSDO_F1" width="8" begin="15" end="8" resetval="0x0" description="The delay from the read preamble training MRS command to the data strobe drive out for frequency set 1, in PI clocks" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TSDO_F0" width="8" begin="7" end="0" resetval="0x0" description="The delay from the read preamble training MRS command to the data strobe drive out for frequency set 0, in PI clocks" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_167" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_167" offset="0x229C" width="32" description="">
		<bitfield id="PI_TDELAY_RDWR_2_BUS_IDLE_F0" width="8" begin="7" end="0" resetval="0x0" description="The delay from read or write to bus idle for frequency set 0. Recommend setting is: delay time from read command issued to last read data received." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_168" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_168" offset="0x22A0" width="32" description="">
		<bitfield id="PI_TDELAY_RDWR_2_BUS_IDLE_F1" width="8" begin="7" end="0" resetval="0x0" description="The delay from read or write to bus idle for frequency set 1. Recommend setting is: delay time from read command issued to last read data received." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_169" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_169" offset="0x22A4" width="32" description="">
		<bitfield id="PI_ZQINIT_F0" width="12" begin="19" end="8" resetval="0x0" description="Number of cycles needed for a ZQINIT command for frequency set 0." range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TDELAY_RDWR_2_BUS_IDLE_F2" width="8" begin="7" end="0" resetval="0x0" description="The delay from read or write to bus idle for frequency set 2. Recommend setting is: delay time from read command issued to last read data received." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_170" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_170" offset="0x22A8" width="32" description="">
		<bitfield id="PI_ZQINIT_F2" width="12" begin="27" end="16" resetval="0x0" description="Number of cycles needed for a ZQINIT command for frequency set 2." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ZQINIT_F1" width="12" begin="11" end="0" resetval="0x0" description="Number of cycles needed for a ZQINIT command for frequency set 1." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_171" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_171" offset="0x22AC" width="32" description="">
		<bitfield id="PI_TPARITY_ERROR_CMD_INHIBIT_F0" width="8" begin="31" end="24" resetval="0x0" description="Defines the window after the PI receives a parity error during which DRAM commands will not execute for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CA_PARITY_LAT_F0" width="4" begin="19" end="16" resetval="0x0" description="DRAM CA parity latency value in cycles for frequency set 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ADDITIVE_LAT_F0" width="6" begin="13" end="8" resetval="0x0" description="DRAM additive latency value in cycles for frequency set 0." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLAT_F0" width="7" begin="6" end="0" resetval="0x0" description="DRAM WRLAT value in cycles for frequency set 0." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_172" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_172" offset="0x22B0" width="32" description="">
		<bitfield id="PI_CA_PARITY_LAT_F1" width="4" begin="27" end="24" resetval="0x0" description="DRAM CA parity latency value in cycles for frequency set 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ADDITIVE_LAT_F1" width="6" begin="21" end="16" resetval="0x0" description="DRAM additive latency value in cycles for frequency set 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WRLAT_F1" width="7" begin="14" end="8" resetval="0x0" description="DRAM WRLAT value in cycles for frequency set 1." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CASLAT_LIN_F0" width="7" begin="6" end="0" resetval="0x0" description="Sets latency from read command sent to data received from/to controller for frequency set 0. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller." range="6 - 0" rwaccess="R/W"/>
	</register>
