IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_173" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_173" offset="0x22B4" width="32" description="">
		<bitfield id="PI_ADDITIVE_LAT_F2" width="6" begin="29" end="24" resetval="0x0" description="DRAM additive latency value in cycles for frequency set 2." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WRLAT_F2" width="7" begin="22" end="16" resetval="0x0" description="DRAM WRLAT value in cycles for frequency set 2." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CASLAT_LIN_F1" width="7" begin="14" end="8" resetval="0x0" description="Sets latency from read command sent to data received from/to controller for frequency set 1. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TPARITY_ERROR_CMD_INHIBIT_F1" width="8" begin="7" end="0" resetval="0x0" description="Defines the window after the PI receives a parity error during which DRAM commands will not execute for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_174" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_174" offset="0x22B8" width="32" description="">
		<bitfield id="PI_CASLAT_LIN_F2" width="7" begin="22" end="16" resetval="0x0" description="Sets latency from read command sent to data received from/to controller for frequency set 2. Bit [0] is half-cycle increment and the upper bits define memory CAS latency for the controller." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TPARITY_ERROR_CMD_INHIBIT_F2" width="8" begin="15" end="8" resetval="0x0" description="Defines the window after the PI receives a parity error during which DRAM commands will not execute for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CA_PARITY_LAT_F2" width="4" begin="3" end="0" resetval="0x0" description="DRAM CA parity latency value in cycles for frequency set 2." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_175" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_175" offset="0x22BC" width="32" description="">
		<bitfield id="PI_TRFC_F0" width="10" begin="9" end="0" resetval="0x0" description="DRAM tRFC value in memory clocks for frequency set 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_176" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_176" offset="0x22C0" width="32" description="">
		<bitfield id="PI_TREF_F0" width="20" begin="19" end="0" resetval="0x0" description="DRAM tREF value in memory clocks for frequency set 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_177" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_177" offset="0x22C4" width="32" description="">
		<bitfield id="PI_TRFC_F1" width="10" begin="9" end="0" resetval="0x0" description="DRAM tRFC value in memory clocks for frequency set 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_178" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_178" offset="0x22C8" width="32" description="">
		<bitfield id="PI_TREF_F1" width="20" begin="19" end="0" resetval="0x0" description="DRAM tREF value in memory clocks for frequency set 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_179" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_179" offset="0x22CC" width="32" description="">
		<bitfield id="PI_TRFC_F2" width="10" begin="9" end="0" resetval="0x0" description="DRAM tRFC value in memory clocks for frequency set 2." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_180" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_180" offset="0x22D0" width="32" description="">
		<bitfield id="PI_TDFI_CTRL_DELAY_F0" width="4" begin="27" end="24" resetval="0x2" description="Defines the DFI tCTRL_DELAY timing parameter [in DFI clocks] for frequency set 0, the delay between a DFI command change and a memory command." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TREF_F2" width="20" begin="19" end="0" resetval="0x0" description="DRAM tREF value in memory clocks for frequency set 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_181" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_181" offset="0x22D4" width="32" description="">
		<bitfield id="PI_WRLVL_EN_F1" width="2" begin="25" end="24" resetval="0x0" description="Enable the PI write leveling module for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Enable the PI write leveling module for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CTRL_DELAY_F2" width="4" begin="11" end="8" resetval="0x2" description="Defines the DFI tCTRL_DELAY timing parameter [in DFI clocks] for frequency set 2, the delay between a DFI command change and a memory command." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CTRL_DELAY_F1" width="4" begin="3" end="0" resetval="0x2" description="Defines the DFI tCTRL_DELAY timing parameter [in DFI clocks] for frequency set 1, the delay between a DFI command change and a memory command." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_182" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_182" offset="0x22D8" width="32" description="">
		<bitfield id="PI_TDFI_WRLVL_WW_F0" width="10" begin="17" end="8" resetval="0x0" description="Defines the DFI tWRLVL_WW timing parameter [in DFI clocks] for frequency set 0, the minimum cycles between dfi_wrlvl_strobe assertions." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLVL_EN_F2" width="2" begin="1" end="0" resetval="0x0" description="Enable the PI write leveling module for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_183" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_183" offset="0x22DC" width="32" description="">
		<bitfield id="PI_TDFI_WRLVL_WW_F2" width="10" begin="25" end="16" resetval="0x0" description="Defines the DFI tWRLVL_WW timing parameter [in DFI clocks] for frequency set 2, the minimum cycles between dfi_wrlvl_strobe assertions." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_WRLVL_WW_F1" width="10" begin="9" end="0" resetval="0x0" description="Defines the DFI tWRLVL_WW timing parameter [in DFI clocks] for frequency set 1, the minimum cycles between dfi_wrlvl_strobe assertions." range="9 - 0" rwaccess="R/W"/>
	</register>
