IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_184" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_184" offset="0x22E0" width="32" description="">
		<bitfield id="PI_ODT_EN_F1" width="1" begin="24" end="24" resetval="0x0" description="Enable support of DRAM ODT. When enabled, PI will assert and de-assert ODT output to DRAM as needed for frequency set 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PI_TODTL_2CMD_F1" width="8" begin="23" end="16" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command for frequency set 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_EN_F0" width="1" begin="8" end="8" resetval="0x0" description="Enable support of DRAM ODT. When enabled, PI will assert and de-assert ODT output to DRAM as needed for frequency set 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_TODTL_2CMD_F0" width="8" begin="7" end="0" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_185" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_185" offset="0x22E4" width="32" description="">
		<bitfield id="PI_TODTON_MIN_F0" width="4" begin="27" end="24" resetval="0x0" description="Defines the point in time when the device termination circuit leaves High-Z and ODT resistance begins to turn on for frequency set 0." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ODTLON_F0" width="4" begin="19" end="16" resetval="0x0" description="Defines the latency from a CAS-2 command to the tODTon reference for frequency set 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_EN_F2" width="1" begin="8" end="8" resetval="0x0" description="Enable support of DRAM ODT. When enabled, PI will assert and de-assert ODT output to DRAM as needed for frequency set 2." range="8" rwaccess="R/W"/> 
		<bitfield id="PI_TODTL_2CMD_F2" width="8" begin="7" end="0" resetval="0x0" description="Defines the DRAM delay from an ODT de-assertion to the next non-write, non-read command for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_186" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_186" offset="0x22E8" width="32" description="">
		<bitfield id="PI_TODTON_MIN_F2" width="4" begin="27" end="24" resetval="0x0" description="Defines the point in time when the device termination circuit leaves High-Z and ODT resistance begins to turn on for frequency set 2." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ODTLON_F2" width="4" begin="19" end="16" resetval="0x0" description="Defines the latency from a CAS-2 command to the tODTon reference for frequency set 2." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TODTON_MIN_F1" width="4" begin="11" end="8" resetval="0x0" description="Defines the point in time when the device termination circuit leaves High-Z and ODT resistance begins to turn on for frequency set 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_ODTLON_F1" width="4" begin="3" end="0" resetval="0x0" description="Defines the latency from a CAS-2 command to the tODTon reference for frequency set 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_187" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_187" offset="0x22EC" width="32" description="">
		<bitfield id="PI_RD_TO_ODTH_F0" width="6" begin="29" end="24" resetval="0x0" description="Defines the delay from a read command to ODT assertion for frequency set 0." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WR_TO_ODTH_F2" width="6" begin="21" end="16" resetval="0x0" description="Defines the delay from a write command to ODT assertion for frequency set 2." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WR_TO_ODTH_F1" width="6" begin="13" end="8" resetval="0x0" description="Defines the delay from a write command to ODT assertion for frequency set 1." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WR_TO_ODTH_F0" width="6" begin="5" end="0" resetval="0x0" description="Defines the delay from a write command to ODT assertion for frequency set 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_188" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_188" offset="0x22F0" width="32" description="">
		<bitfield id="PI_RDLVL_GATE_EN_F0" width="2" begin="25" end="24" resetval="0x0" description="Enable the PI gate training module for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Enable the PI data eye training module for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RD_TO_ODTH_F2" width="6" begin="13" end="8" resetval="0x0" description="Defines the delay from a read command to ODT assertion for frequency set 2." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RD_TO_ODTH_F1" width="6" begin="5" end="0" resetval="0x0" description="Defines the delay from a read command to ODT assertion for frequency set 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_189" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_189" offset="0x22F4" width="32" description="">
		<bitfield id="PI_RDLVL_GATE_EN_F2" width="2" begin="25" end="24" resetval="0x0" description="Enable the PI gate training module for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_EN_F2" width="2" begin="17" end="16" resetval="0x0" description="Enable the PI data eye training module for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_GATE_EN_F1" width="2" begin="9" end="8" resetval="0x0" description="Enable the PI gate training module for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_EN_F1" width="2" begin="1" end="0" resetval="0x0" description="Enable the PI data eye training module for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_190" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_190" offset="0x22F8" width="32" description="">
		<bitfield id="PI_RDLVL_PAT0_EN_F0" width="2" begin="25" end="24" resetval="0x0" description="Enable PATTERN-0 for read training for frequency set 0. bit1 for normal; bit0 for initialization." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TWR_MPR_F2" width="8" begin="23" end="16" resetval="0x0" description="Number of cycles after MPR write command and before any other command for frequency set 2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TWR_MPR_F1" width="8" begin="15" end="8" resetval="0x0" description="Number of cycles after MPR write command and before any other command for frequency set 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TWR_MPR_F0" width="8" begin="7" end="0" resetval="0x0" description="Number of cycles after MPR write command and before any other command for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_191" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_191" offset="0x22FC" width="32" description="">
		<bitfield id="PI_RDLVL_PAT0_EN_F1" width="2" begin="25" end="24" resetval="0x0" description="Enable PATTERN-0 for read training for frequency set 1. bit1 for normal; bit0 for initialization." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_MULTI_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Enable Multi-pattern [from PI_RDLVL_PATTERN_START, total PI_RDLVL_PATTERN_NUM] for read training for frequency set 0. bit1 for normal; bit0 for initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_DFE_EN_F0" width="2" begin="9" end="8" resetval="0x0" description="Enable DFE [PATTERN 8,9] for read training for frequency set 0. bit1 for normal; bit0 for initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_RXCAL_EN_F0" width="2" begin="1" end="0" resetval="0x0" description="Enable RX Offset calibration [PATTERN 14,15] for read training for frequency set 0. bit1 for normal; bit0 for initialization." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_192" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_192" offset="0x2300" width="32" description="">
		<bitfield id="PI_RDLVL_PAT0_EN_F2" width="2" begin="25" end="24" resetval="0x0" description="Enable PATTERN-0 for read training for frequency set 2. bit1 for normal; bit0 for initialization." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_MULTI_EN_F1" width="2" begin="17" end="16" resetval="0x0" description="Enable Multi-pattern [from PI_RDLVL_PATTERN_START, total PI_RDLVL_PATTERN_NUM] for read training for frequency set 1. bit1 for normal; bit0 for initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_DFE_EN_F1" width="2" begin="9" end="8" resetval="0x0" description="Enable DFE [PATTERN 8,9] for read training for frequency set 1. bit1 for normal; bit0 for initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_RXCAL_EN_F1" width="2" begin="1" end="0" resetval="0x0" description="Enable RX Offset calibration [PATTERN 14,15] for read training for frequency set 1. bit1 for normal; bit0 for initialization." range="1 - 0" rwaccess="R/W"/>
	</register>
