IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_193" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_193" offset="0x2304" width="32" description="">
		<bitfield id="PI_RDLAT_ADJ_F0" width="8" begin="31" end="24" resetval="0x0" description="Adjusts the relative timing between DFI read commands and the dfi_rddata_en signal for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_MULTI_EN_F2" width="2" begin="17" end="16" resetval="0x0" description="Enable Multi-pattern [from PI_RDLVL_PATTERN_START, total PI_RDLVL_PATTERN_NUM] for read training for frequency set 2. bit1 for normal; bit0 for initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_DFE_EN_F2" width="2" begin="9" end="8" resetval="0x0" description="Enable DFE [PATTERN 8,9] for read training for frequency set 2. bit1 for normal; bit0 for initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLVL_RXCAL_EN_F2" width="2" begin="1" end="0" resetval="0x0" description="Enable RX Offset calibration [PATTERN 14,15] for read training for frequency set 2. bit1 for normal; bit0 for initialization." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_194" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_194" offset="0x2308" width="32" description="">
		<bitfield id="PI_WRLAT_ADJ_F1" width="8" begin="31" end="24" resetval="0x0" description="Adjusts the relative timing in memory clocks between DFI write commands and the dfi_wrdata_en signal for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WRLAT_ADJ_F0" width="8" begin="23" end="16" resetval="0x0" description="Adjusts the relative timing in memory clocks between DFI write commands and the dfi_wrdata_en signal for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_RDLAT_ADJ_F2" width="8" begin="15" end="8" resetval="0x0" description="Adjusts the relative timing between DFI read commands and the dfi_rddata_en signal for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RDLAT_ADJ_F1" width="8" begin="7" end="0" resetval="0x0" description="Adjusts the relative timing between DFI read commands and the dfi_rddata_en signal for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_195" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_195" offset="0x230C" width="32" description="">
		<bitfield id="PI_TDFI_PHY_WRDATA_F2" width="3" begin="26" end="24" resetval="0x0" description="Defines the DFI tPHY_WRDATA timing parameter [in DFI PHY clocks] for frequency set 2, the maximum cycles between a dfi_wrdata_en assertion and a dfi_wrdata signal." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_PHY_WRDATA_F1" width="3" begin="18" end="16" resetval="0x0" description="Defines the DFI tPHY_WRDATA timing parameter [in DFI PHY clocks] for frequency set 1, the maximum cycles between a dfi_wrdata_en assertion and a dfi_wrdata signal." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_PHY_WRDATA_F0" width="3" begin="10" end="8" resetval="0x0" description="Defines the DFI tPHY_WRDATA timing parameter [in DFI PHY clocks] for frequency set 0, the maximum cycles between a dfi_wrdata_en assertion and a dfi_wrdata signal." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WRLAT_ADJ_F2" width="8" begin="7" end="0" resetval="0x0" description="Adjusts the relative timing in memory clocks between DFI write commands and the dfi_wrdata_en signal for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_196" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_196" offset="0x2310" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_CAPTURE_F0" width="10" begin="25" end="16" resetval="0x0" description="Defines the DFI tCALVL_CAPTURE timing parameter [in DFI clocks] for frequency set 0, the minimum cycles between a calibration command and a dfi_calvl_capture pulse." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_CC_F0" width="10" begin="9" end="0" resetval="0x0" description="Defines the DFI tCALVL_CC timing parameter [in DFI clocks] for frequency set 0, the minimum cycles between calibration commands." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_197" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_197" offset="0x2314" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_CAPTURE_F1" width="10" begin="25" end="16" resetval="0x0" description="Defines the DFI tCALVL_CAPTURE timing parameter [in DFI clocks] for frequency set 1, the minimum cycles between a calibration command and a dfi_calvl_capture pulse." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_CC_F1" width="10" begin="9" end="0" resetval="0x0" description="Defines the DFI tCALVL_CC timing parameter [in DFI clocks] for frequency set 1, the minimum cycles between calibration commands." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_198" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_198" offset="0x2318" width="32" description="">
		<bitfield id="PI_TDFI_CALVL_CAPTURE_F2" width="10" begin="25" end="16" resetval="0x0" description="Defines the DFI tCALVL_CAPTURE timing parameter [in DFI clocks] for frequency set 2, the minimum cycles between a calibration command and a dfi_calvl_capture pulse." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_CC_F2" width="10" begin="9" end="0" resetval="0x0" description="Defines the DFI tCALVL_CC timing parameter [in DFI clocks] for frequency set 2, the minimum cycles between calibration commands." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_199" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_199" offset="0x231C" width="32" description="">
		<bitfield id="PI_TMRZ_F0" width="5" begin="28" end="24" resetval="0x0" description="Defines the delay between a MRW CA exit command and the DQ tristate in memory clocks for frequency set 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_EN_F2" width="2" begin="17" end="16" resetval="0x0" description="Enable the PI CA training module. Bit[1] represents the support when non-initialization for frequency set 2. Bit[0]represents the support when initialization. Set to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_EN_F1" width="2" begin="9" end="8" resetval="0x0" description="Enable the PI CA training module. Bit[1] represents the support when non-initialization for frequency set 1. Bit[0]represents the support when initialization. Set to 1 to enable." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_EN_F0" width="2" begin="1" end="0" resetval="0x0" description="Enable the PI CA training module. Bit[1] represents the support when non-initialization for frequency set 0. Bit[0]represents the support when initialization. Set to 1 to enable." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_200" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_200" offset="0x2320" width="32" description="">
		<bitfield id="PI_TMRZ_F1" width="5" begin="20" end="16" resetval="0x0" description="Defines the delay between a MRW CA exit command and the DQ tristate in memory clocks for frequency set 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCAENT_F0" width="14" begin="13" end="0" resetval="0x0" description="Defines the DRAM tCAENT term, in memory clocks for frequency set 0." range="13 - 0" rwaccess="R/W"/>
	</register>
