IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_201" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_201" offset="0x2324" width="32" description="">
		<bitfield id="PI_TMRZ_F2" width="5" begin="20" end="16" resetval="0x0" description="Defines the delay between a MRW CA exit command and the DQ tristate in memory clocks for frequency set 2." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCAENT_F1" width="14" begin="13" end="0" resetval="0x0" description="Defines the DRAM tCAENT term, in memory clocks for frequency set 1." range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_202" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_202" offset="0x2328" width="32" description="">
		<bitfield id="PI_TDFI_CASEL_F0" width="5" begin="28" end="24" resetval="0x0" description="Defines the DFI tcalvl_ca_sel timing parameter, the width of dfi_calvl_ca_sel in PHY DFI clock cycles for frequency set 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CACSCA_F0" width="5" begin="20" end="16" resetval="0x0" description="Defines the DFI tcalvl_cs_ca timing parameter, the number of PHY DFI clocks from the assertion of dfi_calvl_ca_sel to the assertion of dfi_cs for frequency set 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCAENT_F2" width="14" begin="13" end="0" resetval="0x0" description="Defines the DRAM tCAENT term, in memory clocks for frequency set 2." range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_203" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_203" offset="0x232C" width="32" description="">
		<bitfield id="PI_TVREF_LONG_F0" width="10" begin="25" end="16" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter  gt  1 for frequency set 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TVREF_SHORT_F0" width="10" begin="9" end="0" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter = 1 for frequency set 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_204" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_204" offset="0x2330" width="32" description="">
		<bitfield id="PI_TVREF_SHORT_F1" width="10" begin="25" end="16" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter = 1 for frequency set 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CASEL_F1" width="5" begin="12" end="8" resetval="0x0" description="Defines the DFI tcalvl_ca_sel timing parameter, the width of dfi_calvl_ca_sel in PHY DFI clock cycles for frequency set 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CACSCA_F1" width="5" begin="4" end="0" resetval="0x0" description="Defines the DFI tcalvl_cs_ca timing parameter, the number of PHY DFI clocks from the assertion of dfi_calvl_ca_sel to the assertion of dfi_cs for frequency set 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_205" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_205" offset="0x2334" width="32" description="">
		<bitfield id="PI_TDFI_CASEL_F2" width="5" begin="28" end="24" resetval="0x0" description="Defines the DFI tcalvl_ca_sel timing parameter, the width of dfi_calvl_ca_sel in PHY DFI clock cycles for frequency set 2." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CACSCA_F2" width="5" begin="20" end="16" resetval="0x0" description="Defines the DFI tcalvl_cs_ca timing parameter, the number of PHY DFI clocks from the assertion of dfi_calvl_ca_sel to the assertion of dfi_cs for frequency set 2." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TVREF_LONG_F1" width="10" begin="9" end="0" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter  gt  1 for frequency set 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_206" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_206" offset="0x2338" width="32" description="">
		<bitfield id="PI_TVREF_LONG_F2" width="10" begin="25" end="16" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter  gt  1 for frequency set 2." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TVREF_SHORT_F2" width="10" begin="9" end="0" resetval="0x0" description="Defines the delay in PI clock cycles between the dfi_calvl_strobe to the next command if the pi_calvl_vref_stepsize parameter = 1 for frequency set 2." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_207" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_207" offset="0x233C" width="32" description="">
		<bitfield id="PI_CALVL_VREF_INITIAL_STOP_POINT_F1" width="7" begin="30" end="24" resetval="0x0" description="The end point of initial training for the Vref[ca] training for frequency set 1 { vrefca_range, vref_ca_setting[5:0]}." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_START_POINT_F1" width="7" begin="22" end="16" resetval="0x0" description="The start point of initial training for the Vref[ca] training for frequency set 1 { vrefca_range, vref_ca_setting[5:0]}." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_STOP_POINT_F0" width="7" begin="14" end="8" resetval="0x0" description="The end point of initial training for the Vref[ca] training for frequency set 0 { vrefca_range, vref_ca_setting[5:0]}." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_START_POINT_F0" width="7" begin="6" end="0" resetval="0x0" description="The start point of initial training for the Vref[ca] training for frequency set 0 { vrefca_range, vref_ca_setting[5:0]}." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_208" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_208" offset="0x2340" width="32" description="">
		<bitfield id="PI_CALVL_VREF_DELTA_F1" width="4" begin="27" end="24" resetval="0x0" description="The delta fro the current CA vref for non-initial CA training for frequency set 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_DELTA_F0" width="4" begin="19" end="16" resetval="0x0" description="The delta fro the current CA vref for non-initial CA training for frequency set 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_STOP_POINT_F2" width="7" begin="14" end="8" resetval="0x0" description="The end point of initial training for the Vref[ca] training for frequency set 2 { vrefca_range, vref_ca_setting[5:0]}." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_INITIAL_START_POINT_F2" width="7" begin="6" end="0" resetval="0x0" description="The start point of initial training for the Vref[ca] training for frequency set 2 { vrefca_range, vref_ca_setting[5:0]}." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_209" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_209" offset="0x2344" width="32" description="">
		<bitfield id="PI_TMRWCKEL_F0" width="8" begin="31" end="24" resetval="0x0" description="Valid Clock and CS Requirement before CKE deassert after MRW Command for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TXP_F0" width="5" begin="20" end="16" resetval="0x0" description="CKE assert to next valid command delay for frequency set 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_STROBE_F0" width="4" begin="11" end="8" resetval="0x0" description="Minimum number of DFI PHY clocks from dfi_calvl_data to dfi_calvl_strobe mode for frequency set 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CALVL_VREF_DELTA_F2" width="4" begin="3" end="0" resetval="0x0" description="The delta fro the current CA vref for non-initial CA training for frequency set 2." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_210" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_210" offset="0x2348" width="32" description="">
		<bitfield id="PI_TMRWCKEL_F1" width="8" begin="31" end="24" resetval="0x0" description="Valid Clock and CS Requirement before CKE deassert after MRW Command for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TXP_F1" width="5" begin="20" end="16" resetval="0x0" description="CKE assert to next valid command delay for frequency set 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_STROBE_F1" width="4" begin="11" end="8" resetval="0x0" description="Minimum number of DFI PHY clocks from dfi_calvl_data to dfi_calvl_strobe mode for frequency set 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKELCK_F0" width="5" begin="4" end="0" resetval="0x0" description="Valid Clock Requirement after CKE deassert for frequency set 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_211" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_211" offset="0x234C" width="32" description="">
		<bitfield id="PI_TMRWCKEL_F2" width="8" begin="31" end="24" resetval="0x0" description="Valid Clock and CS Requirement before CKE deassert after MRW Command for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TXP_F2" width="5" begin="20" end="16" resetval="0x0" description="CKE assert to next valid command delay for frequency set 2." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_CALVL_STROBE_F2" width="4" begin="11" end="8" resetval="0x0" description="Minimum number of DFI PHY clocks from dfi_calvl_data to dfi_calvl_strobe mode for frequency set 2." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKELCK_F1" width="5" begin="4" end="0" resetval="0x0" description="Valid Clock Requirement after CKE deassert for frequency set 1." range="4 - 0" rwaccess="R/W"/>
	</register>
