IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_212" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_212" offset="0x2350" width="32" description="">
		<bitfield id="PI_TDFI_INIT_START_F0" width="24" begin="31" end="8" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks] for frequency set 0, the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY." range="31 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKELCK_F2" width="5" begin="4" end="0" resetval="0x0" description="Valid Clock Requirement after CKE deassert for frequency set 2." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_213" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_213" offset="0x2354" width="32" description="">
		<bitfield id="PI_TDFI_INIT_COMPLETE_F0" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks] for frequency set 0, the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_214" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_214" offset="0x2358" width="32" description="">
		<bitfield id="PI_TDFI_INIT_START_F1" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks] for frequency set 1, the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_215" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_215" offset="0x235C" width="32" description="">
		<bitfield id="PI_TDFI_INIT_COMPLETE_F1" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks] for frequency set 1, the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_216" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_216" offset="0x2360" width="32" description="">
		<bitfield id="PI_TDFI_INIT_START_F2" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_START timing parameter [in DFI clocks] for frequency set 2, the maximum number of cycles between a dfi_init_start assertion and a dfi_init_complete de-assertion from the PHY." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_217" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_217" offset="0x2364" width="32" description="">
		<bitfield id="PI_TCKEHDQS_F0" width="6" begin="29" end="24" resetval="0x0" description="The DRAM timing tCKEHDQS, minimum delay from CKE high to strobe high impedance for frequency set 0." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_INIT_COMPLETE_F2" width="24" begin="23" end="0" resetval="0x0" description="Defines the DFI tINIT_COMPLETE timing parameter [in DFI clocks] for frequency set 2, the maximum cycles between a dfi_init_start de-assertion and a dfi_init_complete assertion from the PHY." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_218" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_218" offset="0x2368" width="32" description="">
		<bitfield id="PI_TCKEHDQS_F1" width="6" begin="21" end="16" resetval="0x0" description="The DRAM timing tCKEHDQS, minimum delay from CKE high to strobe high impedance for frequency set 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TFC_F0" width="10" begin="9" end="0" resetval="0x0" description="The delay in PHY clock cycles from setting MR13.OP7 to any valid command for frequency set 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_219" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_219" offset="0x236C" width="32" description="">
		<bitfield id="PI_TCKEHDQS_F2" width="6" begin="21" end="16" resetval="0x0" description="The DRAM timing tCKEHDQS, minimum delay from CKE high to strobe high impedance for frequency set 2." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TFC_F1" width="10" begin="9" end="0" resetval="0x0" description="The delay in PHY clock cycles from setting MR13.OP7 to any valid command for frequency set 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_220" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_220" offset="0x2370" width="32" description="">
		<bitfield id="PI_VREF_EN_F1" width="2" begin="25" end="24" resetval="0x0" description="Enable VREF training during power-up initialization for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Enable VREF training during power-up initialization for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TFC_F2" width="10" begin="9" end="0" resetval="0x0" description="The delay in PHY clock cycles from setting MR13.OP7 to any valid command for frequency set 2." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_221" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_221" offset="0x2374" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_WR_F0" width="10" begin="17" end="8" resetval="0x0" description="Switch time from write to read for frequency set 0." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_EN_F2" width="2" begin="1" end="0" resetval="0x0" description="Enable VREF training during power-up initialization for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization. Set to 1 to enable." range="1 - 0" rwaccess="R/W"/>
	</register>
