IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_222" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_222" offset="0x2378" width="32" description="">
		<bitfield id="PI_WDQLVL_VREF_INITIAL_STOP_POINT_F0" width="7" begin="30" end="24" resetval="0x0" description="Write DQ training vref initial training stop value for frequency set 0." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_INITIAL_START_POINT_F0" width="7" begin="22" end="16" resetval="0x0" description="Write DQ training vref initial training start value for frequency set 0." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_WDQLVL_RW_F0" width="10" begin="9" end="0" resetval="0x0" description="Switch time from read to write for frequency set 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_223" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_223" offset="0x237C" width="32" description="">
		<bitfield id="PI_WDQLVL_CL_F0" width="5" begin="28" end="24" resetval="0x0" description="CL when the Read DBI disabled while doing WDQ training for frequency set 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_NTP_TRAIN_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Indicates whether the no topology WDQ training is enabled. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_EN_F0" width="2" begin="9" end="8" resetval="0x0" description="Indicates if Write DQ leveling is enabled for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_DELTA_F0" width="4" begin="3" end="0" resetval="0x0" description="The delta from the current Write DQ vref adjustment for non-initial wdq training for frequency set 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_224" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_224" offset="0x2380" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_WR_F1" width="10" begin="25" end="16" resetval="0x0" description="Switch time from write to read for frequency set 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_WRLAT_ADJ_F0" width="8" begin="15" end="8" resetval="0x0" description="Adjusted Tdfi_wrdata_en value for PHY read timing when read dbi disabled for frequency set 0, used for WDQ training." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_RDLAT_ADJ_F0" width="8" begin="7" end="0" resetval="0x0" description="Adjusted Tdfi_rddata_en value for PHY read timing when read dbi disabled for frequency set 0, used for WDQ training." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_225" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_225" offset="0x2384" width="32" description="">
		<bitfield id="PI_WDQLVL_VREF_INITIAL_STOP_POINT_F1" width="7" begin="30" end="24" resetval="0x0" description="Write DQ training vref initial training stop value for frequency set 1." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_INITIAL_START_POINT_F1" width="7" begin="22" end="16" resetval="0x0" description="Write DQ training vref initial training start value for frequency set 1." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_WDQLVL_RW_F1" width="10" begin="9" end="0" resetval="0x0" description="Switch time from read to write for frequency set 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_226" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_226" offset="0x2388" width="32" description="">
		<bitfield id="PI_WDQLVL_CL_F1" width="5" begin="28" end="24" resetval="0x0" description="CL when the Read DBI disabled while doing WDQ training for frequency set 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_NTP_TRAIN_EN_F1" width="2" begin="17" end="16" resetval="0x0" description="Indicates whether the no topology WDQ training is enabled. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_EN_F1" width="2" begin="9" end="8" resetval="0x0" description="Indicates if Write DQ leveling is enabled for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_DELTA_F1" width="4" begin="3" end="0" resetval="0x0" description="The delta from the current Write DQ vref adjustment for non-initial wdq training for frequency set 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_227" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_227" offset="0x238C" width="32" description="">
		<bitfield id="PI_TDFI_WDQLVL_WR_F2" width="10" begin="25" end="16" resetval="0x0" description="Switch time from write to read for frequency set 2." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_WRLAT_ADJ_F1" width="8" begin="15" end="8" resetval="0x0" description="Adjusted Tdfi_wrdata_en value for PHY read timing when read dbi disabled for frequency set 1, used for WDQ training." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_RDLAT_ADJ_F1" width="8" begin="7" end="0" resetval="0x0" description="Adjusted Tdfi_rddata_en value for PHY read timing when read dbi disabled for frequency set 1, used for WDQ training." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_228" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_228" offset="0x2390" width="32" description="">
		<bitfield id="PI_WDQLVL_VREF_INITIAL_STOP_POINT_F2" width="7" begin="30" end="24" resetval="0x0" description="Write DQ training vref initial training stop value for frequency set 2." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_INITIAL_START_POINT_F2" width="7" begin="22" end="16" resetval="0x0" description="Write DQ training vref initial training start value for frequency set 2." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDFI_WDQLVL_RW_F2" width="10" begin="9" end="0" resetval="0x0" description="Switch time from read to write for frequency set 2." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_229" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_229" offset="0x2394" width="32" description="">
		<bitfield id="PI_WDQLVL_CL_F2" width="5" begin="28" end="24" resetval="0x0" description="CL when the Read DBI disabled while doing WDQ training for frequency set 2." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_NTP_TRAIN_EN_F2" width="2" begin="17" end="16" resetval="0x0" description="Indicates whether the no topology WDQ training is enabled. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_EN_F2" width="2" begin="9" end="8" resetval="0x0" description="Indicates if Write DQ leveling is enabled for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_VREF_DELTA_F2" width="4" begin="3" end="0" resetval="0x0" description="The delta from the current Write DQ vref adjustment for non-initial wdq training for frequency set 2." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_230" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_230" offset="0x2398" width="32" description="">
		<bitfield id="PI_RD_DBI_LEVEL_EN_F1" width="2" begin="25" end="24" resetval="0x0" description="Read DBI leveling enable, only can be enabled when READ DBI supported for DDR4, and PI_WDQLVL_EN or PI_RDLVL_EN configured by 1 for frequency set 1. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_RD_DBI_LEVEL_EN_F0" width="2" begin="17" end="16" resetval="0x0" description="Read DBI leveling enable, only can be enabled when READ DBI supported for DDR4, and PI_WDQLVL_EN or PI_RDLVL_EN configured by 1 for frequency set 0. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_WRLAT_ADJ_F2" width="8" begin="15" end="8" resetval="0x0" description="Adjusted Tdfi_wrdata_en value for PHY read timing when read dbi disabled for frequency set 2, used for WDQ training." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQLVL_RDLAT_ADJ_F2" width="8" begin="7" end="0" resetval="0x0" description="Adjusted Tdfi_rddata_en value for PHY read timing when read dbi disabled for frequency set 2, used for WDQ training." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_231" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_231" offset="0x239C" width="32" description="">
		<bitfield id="PI_TRCD_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM tRCD value in cycles for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TRP_F0" width="8" begin="23" end="16" resetval="0x0" description="DRAM tRP value in cycles for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TRTP_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM tRTP value in cycles for frequency set 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RD_DBI_LEVEL_EN_F2" width="2" begin="1" end="0" resetval="0x0" description="Read DBI leveling enable, only can be enabled when READ DBI supported for DDR4, and PI_WDQLVL_EN or PI_RDLVL_EN configured by 1 for frequency set 2. Bit[1] represents the support when non-initialization. Bit[0]represents the support when initialization." range="1 - 0" rwaccess="R/W"/>
	</register>
