IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_232" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_232" offset="0x23A0" width="32" description="">
		<bitfield id="PI_TWR_F0" width="8" begin="23" end="16" resetval="0x0" description="DRAM tWR value in cycles for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TWTR_F0" width="6" begin="13" end="8" resetval="0x0" description="DRAM tWTR value in cycles for frequency set 0." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCCD_L_F0" width="5" begin="4" end="0" resetval="0x0" description="DRAM CAS-to_CAS value within the same bank group in cycles for frequency set 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_233" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_233" offset="0x23A4" width="32" description="">
		<bitfield id="PI_TRAS_MAX_F0" width="20" begin="19" end="0" resetval="0x0" description="DRAM tRAS_MAX value in cycles for frequency set 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_234" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_234" offset="0x23A8" width="32" description="">
		<bitfield id="PI_TCCDMW_F0" width="6" begin="29" end="24" resetval="0x0" description="LPDDR4 DRAM tCCDMW in cycles for frequency set 0." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDQSCK_MAX_F0" width="4" begin="19" end="16" resetval="0x0" description="Additional delay needed for tDQSCK for frequency set 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TRAS_MIN_F0" width="9" begin="8" end="0" resetval="0x0" description="DRAM tRAS_MIN value in cycles for frequency set 0." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_235" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_235" offset="0x23AC" width="32" description="">
		<bitfield id="PI_TMOD_F0" width="8" begin="31" end="24" resetval="0x0" description="DRAM tMOD value in cycles for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TMRW_F0" width="8" begin="23" end="16" resetval="0x0" description="DRAM tMRW value in cycles for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TMRD_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value in cycles for frequency set 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TSR_F0" width="8" begin="7" end="0" resetval="0x0" description="Min cycles from sref entry to sref exit for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_236" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_236" offset="0x23B0" width="32" description="">
		<bitfield id="PI_TRP_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM tRP value in cycles for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TRTP_F1" width="8" begin="23" end="16" resetval="0x0" description="DRAM tRTP value in cycles for frequency set 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TMRD_PAR_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value when CA parity is enabled in cycles for frequency set 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TMOD_PAR_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM tMOD value when CA parity is enabled in cycles for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_237" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_237" offset="0x23B4" width="32" description="">
		<bitfield id="PI_TWR_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM tWR value in cycles for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TWTR_F1" width="6" begin="21" end="16" resetval="0x0" description="DRAM tWTR value in cycles for frequency set 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCCD_L_F1" width="5" begin="12" end="8" resetval="0x0" description="DRAM CAS-to_CAS value within the same bank group in cycles for frequency set 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TRCD_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM tRCD value in cycles for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_238" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_238" offset="0x23B8" width="32" description="">
		<bitfield id="PI_TRAS_MAX_F1" width="20" begin="19" end="0" resetval="0x0" description="DRAM tRAS_MAX value in cycles for frequency set 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_239" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_239" offset="0x23BC" width="32" description="">
		<bitfield id="PI_TCCDMW_F1" width="6" begin="29" end="24" resetval="0x0" description="LPDDR4 DRAM tCCDMW in cycles for frequency set 1." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDQSCK_MAX_F1" width="4" begin="19" end="16" resetval="0x0" description="Additional delay needed for tDQSCK for frequency set 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TRAS_MIN_F1" width="9" begin="8" end="0" resetval="0x0" description="DRAM tRAS_MIN value in cycles for frequency set 1." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_240" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_240" offset="0x23C0" width="32" description="">
		<bitfield id="PI_TMOD_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM tMOD value in cycles for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TMRW_F1" width="8" begin="23" end="16" resetval="0x0" description="DRAM tMRW value in cycles for frequency set 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TMRD_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value in cycles for frequency set 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TSR_F1" width="8" begin="7" end="0" resetval="0x0" description="Min cycles from sref entry to sref exit for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
