IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_241" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_241" offset="0x23C4" width="32" description="">
		<bitfield id="PI_TRP_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM tRP value in cycles for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TRTP_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM tRTP value in cycles for frequency set 2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TMRD_PAR_F1" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value when CA parity is enabled in cycles for frequency set 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TMOD_PAR_F1" width="8" begin="7" end="0" resetval="0x0" description="DRAM tMOD value when CA parity is enabled in cycles for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_242" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_242" offset="0x23C8" width="32" description="">
		<bitfield id="PI_TWR_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM tWR value in cycles for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TWTR_F2" width="6" begin="21" end="16" resetval="0x0" description="DRAM tWTR value in cycles for frequency set 2." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCCD_L_F2" width="5" begin="12" end="8" resetval="0x0" description="DRAM CAS-to_CAS value within the same bank group in cycles for frequency set 2." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TRCD_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM tRCD value in cycles for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_243" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_243" offset="0x23CC" width="32" description="">
		<bitfield id="PI_TRAS_MAX_F2" width="20" begin="19" end="0" resetval="0x0" description="DRAM tRAS_MAX value in cycles for frequency set 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_244" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_244" offset="0x23D0" width="32" description="">
		<bitfield id="PI_TCCDMW_F2" width="6" begin="29" end="24" resetval="0x0" description="LPDDR4 DRAM tCCDMW in cycles for frequency set 2." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TDQSCK_MAX_F2" width="4" begin="19" end="16" resetval="0x0" description="Additional delay needed for tDQSCK for frequency set 2." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TRAS_MIN_F2" width="9" begin="8" end="0" resetval="0x0" description="DRAM tRAS_MIN value in cycles for frequency set 2." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_245" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_245" offset="0x23D4" width="32" description="">
		<bitfield id="PI_TMOD_F2" width="8" begin="31" end="24" resetval="0x0" description="DRAM tMOD value in cycles for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TMRW_F2" width="8" begin="23" end="16" resetval="0x0" description="DRAM tMRW value in cycles for frequency set 2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TMRD_F2" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value in cycles for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TSR_F2" width="8" begin="7" end="0" resetval="0x0" description="Min cycles from sref entry to sref exit for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_246" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_246" offset="0x23D8" width="32" description="">
		<bitfield id="PI_TMRD_PAR_F2" width="8" begin="15" end="8" resetval="0x0" description="DRAM tMRD value when CA parity is enabled in cycles for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TMOD_PAR_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM tMOD value when CA parity is enabled in cycles for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_247" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_247" offset="0x23DC" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_MAX_F0" width="21" begin="20" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MAX timing parameter [in DFI clocks] for frequency set 0, the maximum cycles that dfi_ctrlupd_req can be asserted. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] set in the PI_UPDATE_ERROR_STATUS parameter." range="20 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_248" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_248" offset="0x23E0" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_INTERVAL_F0" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_INTERVAL timing parameter [in DFI clocks] for frequency set 0, the maximum cycles between dfi_ctrlupd_req assertions. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PI_UPDATE_ERROR_STATUS parameter." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_249" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_249" offset="0x23E4" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_MAX_F1" width="21" begin="20" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MAX timing parameter [in DFI clocks] for frequency set 1, the maximum cycles that dfi_ctrlupd_req can be asserted. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] set in the PI_UPDATE_ERROR_STATUS parameter." range="20 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_250" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_250" offset="0x23E8" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_INTERVAL_F1" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_INTERVAL timing parameter [in DFI clocks] for frequency set 1, the maximum cycles between dfi_ctrlupd_req assertions. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PI_UPDATE_ERROR_STATUS parameter." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_251" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_251" offset="0x23EC" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_MAX_F2" width="21" begin="20" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_MAX timing parameter [in DFI clocks] for frequency set 2, the maximum cycles that dfi_ctrlupd_req can be asserted. If programmed to a non-zero, a timing violation will cause an interrupt and bit [1] set in the PI_UPDATE_ERROR_STATUS parameter." range="20 - 0" rwaccess="R/W"/>
	</register>
