IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_252" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_252" offset="0x23F0" width="32" description="">
		<bitfield id="PI_TDFI_CTRLUPD_INTERVAL_F2" width="32" begin="31" end="0" resetval="0x0" description="Defines the DFI tCTRLUPD_INTERVAL timing parameter [in DFI clocks] for frequency set 2, the maximum cycles between dfi_ctrlupd_req assertions. If programmed to a non-zero, a timing violation will cause an interrupt and bit [0] set in the PI_UPDATE_ERROR_STATUS parameter." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_253" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_253" offset="0x23F4" width="32" description="">
		<bitfield id="PI_TXSR_F1" width="16" begin="31" end="16" resetval="0x0" description="DRAM TXSR value for frequency set 1 in cycles." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TXSR_F0" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXSR value for frequency set 0 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_254" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_254" offset="0x23F8" width="32" description="">
		<bitfield id="PI_TEXCKE_F1" width="6" begin="29" end="24" resetval="0x0" description="DRAM CKE low after SREF command timing for frequency set 1." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TEXCKE_F0" width="6" begin="21" end="16" resetval="0x0" description="DRAM CKE low after SREF command timing for frequency set 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TXSR_F2" width="16" begin="15" end="0" resetval="0x0" description="DRAM TXSR value for frequency set 2 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_255" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_255" offset="0x23FC" width="32" description="">
		<bitfield id="PI_TDLL_F0" width="16" begin="23" end="8" resetval="0x0" description="DRAM tDLL value for frequency set 0 in cycles." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TEXCKE_F2" width="6" begin="5" end="0" resetval="0x0" description="DRAM CKE low after SREF command timing for frequency set 2." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_256" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_256" offset="0x2400" width="32" description="">
		<bitfield id="PI_TDLL_F2" width="16" begin="31" end="16" resetval="0x0" description="DRAM tDLL value for frequency set 2 in cycles." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TDLL_F1" width="16" begin="15" end="0" resetval="0x0" description="DRAM tDLL value for frequency set 1 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_257" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_257" offset="0x2404" width="32" description="">
		<bitfield id="PI_TCKSRE_F1" width="8" begin="31" end="24" resetval="0x0" description="DRAM tCKSRE value." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_TCKSRX_F1" width="8" begin="23" end="16" resetval="0x0" description="DRAM tCKSRX value." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_TCKSRE_F0" width="8" begin="15" end="8" resetval="0x0" description="DRAM tCKSRE value." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKSRX_F0" width="8" begin="7" end="0" resetval="0x0" description="DRAM tCKSRX value." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_258" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_258" offset="0x2408" width="32" description="">
		<bitfield id="PI_TCKSRE_F2" width="8" begin="15" end="8" resetval="0x0" description="DRAM tCKSRE value." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_TCKSRX_F2" width="8" begin="7" end="0" resetval="0x0" description="DRAM tCKSRX value." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_259" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_259" offset="0x240C" width="32" description="">
		<bitfield id="PI_TINIT_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT value for frequency set 0 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_260" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_260" offset="0x2410" width="32" description="">
		<bitfield id="PI_TINIT3_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT3 value for frequency set 0 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_261" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_261" offset="0x2414" width="32" description="">
		<bitfield id="PI_TINIT4_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT4 value for frequency set 0 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_262" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_262" offset="0x2418" width="32" description="">
		<bitfield id="PI_TINIT5_F0" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT5 value for frequency set 0 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_263" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_263" offset="0x241C" width="32" description="">
		<bitfield id="PI_TXSNR_F0" width="16" begin="15" end="0" resetval="0x0" description="DRAM tXSNR value for frequency set 0 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_264" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_264" offset="0x2420" width="32" description="">
		<bitfield id="PI_TINIT_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT value for frequency set 1 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_265" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_265" offset="0x2424" width="32" description="">
		<bitfield id="PI_TINIT3_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT3 value for frequency set 1 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_266" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_266" offset="0x2428" width="32" description="">
		<bitfield id="PI_TINIT4_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT4 value for frequency set 1 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_267" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_267" offset="0x242C" width="32" description="">
		<bitfield id="PI_TINIT5_F1" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT5 value for frequency set 1 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
