IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_268" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_268" offset="0x2430" width="32" description="">
		<bitfield id="PI_TXSNR_F1" width="16" begin="15" end="0" resetval="0x0" description="DRAM tXSNR value for frequency set 1 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_269" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_269" offset="0x2434" width="32" description="">
		<bitfield id="PI_TINIT_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT value for frequency set 2 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_270" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_270" offset="0x2438" width="32" description="">
		<bitfield id="PI_TINIT3_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT3 value for frequency set 2 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_271" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_271" offset="0x243C" width="32" description="">
		<bitfield id="PI_TINIT4_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT4 value for frequency set 2 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_272" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_272" offset="0x2440" width="32" description="">
		<bitfield id="PI_TINIT5_F2" width="24" begin="23" end="0" resetval="0x0" description="DRAM tINIT5 value for frequency set 2 in cycles." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_273" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_273" offset="0x2444" width="32" description="">
		<bitfield id="PI_TXSNR_F2" width="16" begin="15" end="0" resetval="0x0" description="DRAM tXSNR value for frequency set 2 in cycles." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_274" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_274" offset="0x2448" width="32" description="">
		<bitfield id="PI_TZQCAL_F0" width="12" begin="27" end="16" resetval="0x0" description="Holds the DRAM ZQCAL value for frequency set 0 in cycles." range="27 - 16" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_275" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_275" offset="0x244C" width="32" description="">
		<bitfield id="PI_TZQLAT_F0" width="7" begin="6" end="0" resetval="0x0" description="Holds the DRAM ZQLAT value for frequency set 0 in cycles." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_276" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_276" offset="0x2450" width="32" description="">
		<bitfield id="PI_TZQCAL_F1" width="12" begin="27" end="16" resetval="0x0" description="Holds the DRAM ZQCAL value for frequency set 1 in cycles." range="27 - 16" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_277" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_277" offset="0x2454" width="32" description="">
		<bitfield id="PI_TZQLAT_F1" width="7" begin="6" end="0" resetval="0x0" description="Holds the DRAM ZQLAT value for frequency set 1 in cycles." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_278" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_278" offset="0x2458" width="32" description="">
		<bitfield id="PI_TZQCAL_F2" width="12" begin="27" end="16" resetval="0x0" description="Holds the DRAM ZQCAL value for frequency set 2 in cycles." range="27 - 16" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_279" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_279" offset="0x245C" width="32" description="">
		<bitfield id="PI_TZQLAT_F2" width="7" begin="6" end="0" resetval="0x0" description="Holds the DRAM ZQLAT value for frequency set 2 in cycles." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_280" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_280" offset="0x2460" width="32" description="">
		
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_281" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_281" offset="0x2464" width="32" description="">
		<bitfield id="PI_PREAMBLE_SUPPORT_F0" width="2" begin="25" end="24" resetval="0x0" description="bit0: Selection of one or two cycle preamble for read burst transfers. bit1: Selection of one or two cycles write burst transfers for NON-DDR5,one or multi[up to four] cycles  write burst transfers for DDR5." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_WDQ_OSC_DELTA_INDEX_F2" width="4" begin="19" end="16" resetval="0x0" description="WDQ DQS delay delta index for OSC triggered periodic training for frequency set 2. If the value is n, the delay is 2^n/512 cycle." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_WDQ_OSC_DELTA_INDEX_F1" width="4" begin="11" end="8" resetval="0x0" description="WDQ DQS delay delta index for OSC triggered periodic training for frequency set 1. If the value is n, the delay is 2^n/512 cycle." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_WDQ_OSC_DELTA_INDEX_F0" width="4" begin="3" end="0" resetval="0x0" description="WDQ DQS delay delta index for OSC triggered periodic training for frequency set 0. If the value is n, the delay is 2^n/512 cycle." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_282" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_282" offset="0x2468" width="32" description="">
		<bitfield id="PI_MEMDATA_RATIO_1" width="3" begin="26" end="24" resetval="0x0" description="Defines the ratio of the DRAM device size on chip select 1 to the memory data width. Program with the log2 ratio of the memory data width to the device data width." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MEMDATA_RATIO_0" width="3" begin="18" end="16" resetval="0x0" description="Defines the ratio of the DRAM device size on chip select 0 to the memory data width. Program with the log2 ratio of the memory data width to the device data width." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_PREAMBLE_SUPPORT_F2" width="2" begin="9" end="8" resetval="0x0" description="bit0: Selection of one or two cycle preamble for read burst transfers. bit1: Selection of one or two cycles write burst transfers for NON-DDR5,one or multi[up to four] cycles  write burst transfers for DDR5." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_PREAMBLE_SUPPORT_F1" width="2" begin="1" end="0" resetval="0x0" description="bit0: Selection of one or two cycle preamble for read burst transfers. bit1: Selection of one or two cycles write burst transfers for NON-DDR5,one or multi[up to four] cycles  write burst transfers for DDR5." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_283" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_283" offset="0x246C" width="32" description="">
		<bitfield id="PI_ODT_WR_MAP_CS1" width="2" begin="25" end="24" resetval="0x0" description="Determines which chip[s] will have termination when a write occurs on chip select 1. Set bit X to enable termination on csX when cs1 is performing a write." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_RD_MAP_CS1" width="2" begin="17" end="16" resetval="0x0" description="Determines which chip[s] will have termination when a read occurs on chip select 1. Set bit X to enable termination on csX when cs1 is performing a read." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_WR_MAP_CS0" width="2" begin="9" end="8" resetval="0x0" description="Determines which chip[s] will have termination when a write occurs on chip select 0. Set bit X to enable termination on csX when cs0 is performing a write." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_RD_MAP_CS0" width="2" begin="1" end="0" resetval="0x0" description="Determines which chip[s] will have termination when a read occurs on chip select 0. Set bit X to enable termination on csX when cs0 is performing a read." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_284" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_284" offset="0x2470" width="32" description="">
		<bitfield id="PI_VREF_VAL_DEV1_1" width="7" begin="30" end="24" resetval="0x0" description="Defines the range and value for VREF training for DRAM 1 for CS 1. If the PI_VREF_PDA_EN parameter is not set, device 0 values are used for all devices." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_VAL_DEV1_0" width="7" begin="22" end="16" resetval="0x0" description="Defines the range and value for VREF training for DRAM 1 for CS 0. If the PI_VREF_PDA_EN parameter is not set, device 0 values are used for all devices." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_VAL_DEV0_1" width="7" begin="14" end="8" resetval="0x0" description="Defines the range and value for VREF training for DRAM 0 for CS 1. If the PI_VREF_PDA_EN parameter is not set, device 0 values are used for all devices." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_VREF_VAL_DEV0_0" width="7" begin="6" end="0" resetval="0x0" description="Defines the range and value for VREF training for DRAM 0 for CS 0. If the PI_VREF_PDA_EN parameter is not set, device 0 values are used for all devices." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_285" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_285" offset="0x2474" width="32" description="">
		<bitfield id="PI_MR6_VREF_0_1" width="6" begin="29" end="24" resetval="0x0" description="The parameter stores the vref value of every devices of the same CS. It is updated after WDQLVL PDA mode completed. READ-ONLY." range="29 - 24" rwaccess="R"/> 
		<bitfield id="PI_MR6_VREF_0_0" width="6" begin="21" end="16" resetval="0x0" description="The parameter stores the vref value of every devices of the same CS. It is updated after WDQLVL PDA mode completed. READ-ONLY." range="21 - 16" rwaccess="R"/> 
		<bitfield id="PI_SLICE_PER_DEV_1" width="2" begin="9" end="8" resetval="0x0" description="Indicates the number of data slices per memory device.  The device width divided by 8." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_SLICE_PER_DEV_0" width="2" begin="1" end="0" resetval="0x0" description="Indicates the number of data slices per memory device.  The device width divided by 8." range="1 - 0" rwaccess="R/W"/>
	</register>
