IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_286" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_286" offset="0x2478" width="32" description="">
		<bitfield id="PI_MR15_DATA_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 15 for chip select 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR13_DATA_0" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 13 for chip select 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_VREF_1_1" width="6" begin="13" end="8" resetval="0x0" description="The parameter stores the vref value of every devices of the same CS. It is updated after WDQLVL PDA mode completed. READ-ONLY." range="13 - 8" rwaccess="R"/> 
		<bitfield id="PI_MR6_VREF_1_0" width="6" begin="5" end="0" resetval="0x0" description="The parameter stores the vref value of every devices of the same CS. It is updated after WDQLVL PDA mode completed. READ-ONLY." range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_287" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_287" offset="0x247C" width="32" description="">
		<bitfield id="PI_MR20_DATA_0" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 20 for chip select 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR17_DATA_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 17 for chip select 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR16_DATA_0" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 16 for chip select 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_288" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_288" offset="0x2480" width="32" description="">
		<bitfield id="PI_MR40_DATA_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 40 for chip select 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR32_DATA_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 32 for chip select 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_289" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_289" offset="0x2484" width="32" description="">
		<bitfield id="PI_MR17_DATA_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 17 for chip select 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR16_DATA_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 16 for chip select 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR15_DATA_1" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 15 for chip select 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR13_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 13 for chip select 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_290" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_290" offset="0x2488" width="32" description="">
		<bitfield id="PI_MR32_DATA_1" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register 32 for chip select 1." range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR20_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 20 for chip select 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_291" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_291" offset="0x248C" width="32" description="">
		<bitfield id="PI_CS_MUX_0" width="5" begin="28" end="24" resetval="0x0" description="Command pin CS_0 mux selector" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_CKE_MUX_1" width="5" begin="20" end="16" resetval="0x0" description="Command pin CKE_1 mux selector" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_CKE_MUX_0" width="5" begin="12" end="8" resetval="0x0" description="Command pin CKE_0 mux selector" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR40_DATA_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 40 for chip select 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_292" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_292" offset="0x2490" width="32" description="">
		<bitfield id="PI_RESET_N_MUX_0" width="5" begin="28" end="24" resetval="0x0" description="Command pin RESET_N_0 mux selector" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_MUX_1" width="5" begin="20" end="16" resetval="0x0" description="Command pin ODT_1 mux selector" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ODT_MUX_0" width="5" begin="12" end="8" resetval="0x0" description="Command pin ODT_0 mux selector" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_CS_MUX_1" width="5" begin="4" end="0" resetval="0x0" description="Command pin CS_1 mux selector" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_293" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_293" offset="0x2494" width="32" description="">
		<bitfield id="PI_MRSINGLE_DATA_0" width="17" begin="24" end="8" resetval="0x0" description="Data to program into memory mode register single write to chip select 0." range="24 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_RESET_N_MUX_1" width="5" begin="4" end="0" resetval="0x0" description="Command pin RESET_N_1 mux selector" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_294" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_294" offset="0x2498" width="32" description="">
		<bitfield id="PI_ZQ_CAL_START_MAP_0" width="2" begin="25" end="24" resetval="0x1" description="Defines which chip select[s] will receive ZQ calibration start commands simultaneously on iteration 0 of the ZQ START initialization and periodic command sequences. Clear to all zeros for no ZQ START commands." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MRSINGLE_DATA_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register single write to chip select 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_295" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_295" offset="0x249C" width="32" description="">
		<bitfield id="PI_ZQ_CAL_LATCH_MAP_1" width="2" begin="17" end="16" resetval="0x2" description="Defines which chip select[s] will receive ZQ calibration latch commands simultaneously on iteration 1 of the ZQ LATCH initialization and periodic command sequences. Clear to all zeros for no ZQ LATCH commands." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_ZQ_CAL_START_MAP_1" width="2" begin="9" end="8" resetval="0x2" description="Defines which chip select[s] will receive ZQ calibration start commands simultaneously on iteration 1 of the ZQ START initialization and periodic command sequences. Clear to all zeros for no ZQ START commands." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_ZQ_CAL_LATCH_MAP_0" width="2" begin="1" end="0" resetval="0x1" description="Defines which chip select[s] will receive ZQ calibration latch commands simultaneously on iteration 0 of the ZQ LATCH initialization and periodic command sequences. Clear to all zeros for no ZQ LATCH commands." range="1 - 0" rwaccess="R/W"/>
	</register>
