IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_296" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_296" offset="0x24A0" width="32" description="">
		<bitfield id="PI_DQS_OSC_BASE_VALUE_0_1" width="16" begin="31" end="16" resetval="0x0" description="Base value for comparison of oscillator measurement for device 0 of rank 1" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_DQS_OSC_BASE_VALUE_0_0" width="16" begin="15" end="0" resetval="0x0" description="Base value for comparison of oscillator measurement for device 0 of rank 0" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_297" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_297" offset="0x24A4" width="32" description="">
		<bitfield id="PI_MR0_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_298" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_298" offset="0x24A8" width="32" description="">
		<bitfield id="PI_MR1_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_299" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_299" offset="0x24AC" width="32" description="">
		<bitfield id="PI_MR2_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_300" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_300" offset="0x24B0" width="32" description="">
		<bitfield id="PI_MR3_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_301" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_301" offset="0x24B4" width="32" description="">
		<bitfield id="PI_MR4_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_302" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_302" offset="0x24B8" width="32" description="">
		<bitfield id="PI_MR5_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_303" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_303" offset="0x24BC" width="32" description="">
		<bitfield id="PI_MR11_DATA_F0_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 0 for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F0_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 0 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_304" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_304" offset="0x24C0" width="32" description="">
		<bitfield id="PI_MR23_DATA_F0_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 0 for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F0_0" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 0 for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F0_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 0 for frequency set 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F0_0" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 0 for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_305" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_305" offset="0x24C4" width="32" description="">
		<bitfield id="PI_MR0_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_306" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_306" offset="0x24C8" width="32" description="">
		<bitfield id="PI_MR1_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_307" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_307" offset="0x24CC" width="32" description="">
		<bitfield id="PI_MR2_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_308" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_308" offset="0x24D0" width="32" description="">
		<bitfield id="PI_MR3_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_309" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_309" offset="0x24D4" width="32" description="">
		<bitfield id="PI_MR4_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_310" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_310" offset="0x24D8" width="32" description="">
		<bitfield id="PI_MR5_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_311" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_311" offset="0x24DC" width="32" description="">
		<bitfield id="PI_MR11_DATA_F1_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 0 for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F1_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 0 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
