IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_312" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_312" offset="0x24E0" width="32" description="">
		<bitfield id="PI_MR23_DATA_F1_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 0 for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F1_0" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 0 for frequency set 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F1_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 0 for frequency set 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F1_0" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 0 for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_313" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_313" offset="0x24E4" width="32" description="">
		<bitfield id="PI_MR0_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_314" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_314" offset="0x24E8" width="32" description="">
		<bitfield id="PI_MR1_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_315" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_315" offset="0x24EC" width="32" description="">
		<bitfield id="PI_MR2_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_316" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_316" offset="0x24F0" width="32" description="">
		<bitfield id="PI_MR3_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_317" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_317" offset="0x24F4" width="32" description="">
		<bitfield id="PI_MR4_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_318" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_318" offset="0x24F8" width="32" description="">
		<bitfield id="PI_MR5_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_319" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_319" offset="0x24FC" width="32" description="">
		<bitfield id="PI_MR11_DATA_F2_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 0 for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F2_0" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 0 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_320" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_320" offset="0x2500" width="32" description="">
		<bitfield id="PI_MR23_DATA_F2_0" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 0 for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F2_0" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 0 for frequency set 2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F2_0" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 0 for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F2_0" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 0 for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_321" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_321" offset="0x2504" width="32" description="">
		<bitfield id="PI_MR0_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_322" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_322" offset="0x2508" width="32" description="">
		<bitfield id="PI_MR1_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_323" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_323" offset="0x250C" width="32" description="">
		<bitfield id="PI_MR2_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_324" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_324" offset="0x2510" width="32" description="">
		<bitfield id="PI_MR3_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_325" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_325" offset="0x2514" width="32" description="">
		<bitfield id="PI_MR4_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
