IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_326" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_326" offset="0x2518" width="32" description="">
		<bitfield id="PI_MR5_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_327" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_327" offset="0x251C" width="32" description="">
		<bitfield id="PI_MR11_DATA_F0_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 1 for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F0_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 1 for frequency set 0." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_328" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_328" offset="0x2520" width="32" description="">
		<bitfield id="PI_MR23_DATA_F0_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 1 for frequency set 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F0_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 1 for frequency set 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F0_1" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 1 for frequency set 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F0_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 1 for frequency set 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_329" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_329" offset="0x2524" width="32" description="">
		<bitfield id="PI_MR0_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_330" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_330" offset="0x2528" width="32" description="">
		<bitfield id="PI_MR1_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_331" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_331" offset="0x252C" width="32" description="">
		<bitfield id="PI_MR2_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_332" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_332" offset="0x2530" width="32" description="">
		<bitfield id="PI_MR3_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_333" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_333" offset="0x2534" width="32" description="">
		<bitfield id="PI_MR4_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_334" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_334" offset="0x2538" width="32" description="">
		<bitfield id="PI_MR5_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_335" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_335" offset="0x253C" width="32" description="">
		<bitfield id="PI_MR11_DATA_F1_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 1 for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F1_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 1 for frequency set 1." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_336" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_336" offset="0x2540" width="32" description="">
		<bitfield id="PI_MR23_DATA_F1_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 1 for frequency set 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F1_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 1 for frequency set 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F1_1" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 1 for frequency set 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F1_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 1 for frequency set 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_337" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_337" offset="0x2544" width="32" description="">
		<bitfield id="PI_MR0_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 0 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_338" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_338" offset="0x2548" width="32" description="">
		<bitfield id="PI_MR1_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 1 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_339" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_339" offset="0x254C" width="32" description="">
		<bitfield id="PI_MR2_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 2 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_340" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_340" offset="0x2550" width="32" description="">
		<bitfield id="PI_MR3_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 3 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_341" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_341" offset="0x2554" width="32" description="">
		<bitfield id="PI_MR4_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 4 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_342" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_342" offset="0x2558" width="32" description="">
		<bitfield id="PI_MR5_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 5 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_343" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_343" offset="0x255C" width="32" description="">
		<bitfield id="PI_MR11_DATA_F2_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 11 for chip select 1 for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR6_DATA_F2_1" width="17" begin="16" end="0" resetval="0x0" description="Data to program into memory mode register 6 for chip select 1 for frequency set 2." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_344" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PI_344" offset="0x2560" width="32" description="">
		<bitfield id="PI_MR23_DATA_F2_1" width="8" begin="31" end="24" resetval="0x0" description="Data to program into memory mode register 23 for chip select 1 for frequency set 2." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PI_MR22_DATA_F2_1" width="8" begin="23" end="16" resetval="0x0" description="Data to program into memory mode register 22 for chip select 1 for frequency set 2." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PI_MR14_DATA_F2_1" width="8" begin="15" end="8" resetval="0x0" description="Data to program into memory mode register 14 for chip select 1 for frequency set 2." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PI_MR12_DATA_F2_1" width="8" begin="7" end="0" resetval="0x0" description="Data to program into memory mode register 12 for chip select 1 for frequency set 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_0" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_0" offset="0x4000" width="32" description="">
		<bitfield id="PHY_CLK_WR_BYPASS_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Write data clock bypass mode slave delay setting for slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_PAD_DSLICE_IO_CFG_0" width="7" begin="14" end="8" resetval="0x0" description="Controls PCLK/PARK pin for pad for slice 0 with boot frequency." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RX_PCLK_CLK_SEL_0" width="3" begin="2" end="0" resetval="0x0" description="RX_PCLK boot clock frequency selection for slice 0." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1" offset="0x4004" width="32" description="">
		<bitfield id="PHY_WRITE_PATH_LAT_ADD_BYPASS_0" width="3" begin="26" end="24" resetval="0x0" description="Number of cycles on bypass mode to delay the incoming dfi_wrdata_en/dfi_wrdata signals for slice 0." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQS_SLAVE_DELAY_BYPASS_0" width="10" begin="17" end="8" resetval="0x0" description="Write DQS bypass mode slave delay setting for slice 0." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_IO_PAD_DELAY_TIMING_BYPASS_0" width="4" begin="3" end="0" resetval="0x0" description="Feedback pad's OPAD and IPAD delay timing on bypass mode for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_2" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_2" offset="0x4008" width="32" description="">
		<bitfield id="PHY_CLK_BYPASS_OVERRIDE_0" width="1" begin="24" end="24" resetval="0x0" description="Bypass mode override setting for slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_BYPASS_TWO_CYC_PREAMBLE_0" width="2" begin="17" end="16" resetval="0x0" description="Two_cycle_preamble for bypass mode for slice 0." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_GATE_BYPASS_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DQS bypass mode slave delay setting for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
