IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_3" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_3" offset="0x400C" width="32" description="">
		<bitfield id="PHY_SW_WRDQ3_SHIFT_0" width="6" begin="29" end="24" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ3 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ2_SHIFT_0" width="6" begin="21" end="16" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ2 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ1_SHIFT_0" width="6" begin="13" end="8" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ1 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ0_SHIFT_0" width="6" begin="5" end="0" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ0 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_4" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_4" offset="0x4010" width="32" description="">
		<bitfield id="PHY_SW_WRDQ7_SHIFT_0" width="6" begin="29" end="24" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ7 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ6_SHIFT_0" width="6" begin="21" end="16" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ6 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ5_SHIFT_0" width="6" begin="13" end="8" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ5 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQ4_SHIFT_0" width="6" begin="5" end="0" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQ4 for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_5" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_5" offset="0x4014" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_RDDATA_EN_DLY_0" width="5" begin="28" end="24" resetval="0x0" description="For LPDDR4 boot frequency, the number of cycles that the dfi_rddata_en signal is early for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RDDATA_EN_IE_DLY_0" width="2" begin="17" end="16" resetval="0x0" description="For LPDDR4 boot frequency, the number of cycles that the dfi_rddata_en signal is earlier than necessary for input enable generation for slice 0." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDQS_SHIFT_0" width="4" begin="11" end="8" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DQS for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bit [3] is the cycle_shift value." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_WRDM_SHIFT_0" width="6" begin="5" end="0" resetval="0x0" description="Manual override of automatic half_cycle_shift/cycle_shift for write DM for slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] are the cycle_shift value." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_6" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_6" offset="0x4018" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_WRPATH_GATE_DISABLE_0" width="2" begin="25" end="24" resetval="0x0" description="For LPDDR4 boot frequency, write path clock gating disable for slice 0. Bit [0]: disable pull in wrdata_en; Bit [1]: disable write path clock gating, clock always on" range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RDDQS_LATENCY_ADJUST_0" width="4" begin="19" end="16" resetval="0x0" description="For LPDDR4 boot frequency, the number of cycles to delay the incoming dfi_rddata_en for read DQS gate generation for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RPTR_UPDATE_0" width="4" begin="11" end="8" resetval="0x0" description="For LPDDR4 boot frequency, the offset in cycles from the dfi_rddata_en signal to releasing data from the entry FIFO for slice 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RDDATA_EN_TSEL_DLY_0" width="5" begin="4" end="0" resetval="0x0" description="For LPDDR4 boot frequency, the number of cycles that the dfi_rddata_en signal is earlier than necessary for TSEL enable generation for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_7" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_7" offset="0x401C" width="32" description="">
		<bitfield id="PHY_LPBK_CONTROL_0" width="9" begin="24" end="16" resetval="0x0" description="Loopback control bits for slice 0." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CTRL_LPBK_EN_0" width="2" begin="9" end="8" resetval="0x0" description="Loopback control en for slice 0." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RDDATA_EN_OE_DLY_0" width="5" begin="4" end="0" resetval="0x0" description="For LPDDR4 boot frequency, the number of cycles that the dfi_rddata_en signal is earlier than necessary for extended OE generation for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_8" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_8" offset="0x4020" width="32" description="">
		<bitfield id="PHY_GATE_DELAY_COMP_DISABLE_0" width="1" begin="8" end="8" resetval="0x0" description="use the control whether to compensate half_cycle when gate_slave_delay is larger than half_cycle for the gate close for slice 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_LPBK_DFX_TIMEOUT_EN_0" width="1" begin="0" end="0" resetval="0x0" description="Loopback read only test timeout mechanism enable for slice 0." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_9" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_9" offset="0x4024" width="32" description="">
		<bitfield id="PHY_AUTO_TIMING_MARGIN_CONTROL_0" width="32" begin="31" end="0" resetval="0x0" description="Auto timing marging control bits for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_10" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_10" offset="0x4028" width="32" description="">
		<bitfield id="PHY_AUTO_TIMING_MARGIN_OBS_0" width="28" begin="27" end="0" resetval="0x0" description="Observation register for the auto_timing_margin for slice 0. READ-ONLY" range="27 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_11" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_11" offset="0x402C" width="32" description="">
		<bitfield id="PHY_PRBS_PATTERN_START_0" width="7" begin="30" end="24" resetval="0x1" description="PRBS7 start pattern for slice 0." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PDA_MODE_EN_0" width="1" begin="16" end="16" resetval="0x0" description="When set to 1, the invalid DQs will be driven by the dfi_wrdata to make sure the tpda_s and tpda_h's timing is meet for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_IDLE_0" width="9" begin="8" end="0" resetval="0x0" description="When set to 1, the inavlid DQ will be driven to high, when set to 0, the invalid DQ will be driven to low for slice 0." range="8 - 0" rwaccess="R/W"/>
	</register>
