IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_12" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_12" offset="0x4030" width="32" description="">
		<bitfield id="PHY_RDLVL_MULTI_PATT_RST_DISABLE_0" width="1" begin="24" end="24" resetval="0x0" description="Read Leveling read level windows disable reset for slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_MULTI_PATT_ENABLE_0" width="1" begin="16" end="16" resetval="0x0" description="Read Leveling Multi-pattern enable for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_PRBS_PATTERN_MASK_0" width="9" begin="8" end="0" resetval="0x0" description="PRBS7 mask signal for slice 0." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_13" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_13" offset="0x4034" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ_BYPASS_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQS data clock bypass mode slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_TRAIN_OBS_0" width="7" begin="14" end="8" resetval="0x0" description="Observation register for best vref value for slice 0. READ-ONLY" range="14 - 8" rwaccess="R"/> 
		<bitfield id="PHY_VREF_INITIAL_STEPSIZE_0" width="6" begin="5" end="0" resetval="0x0" description="Data slice initial VREF training step size for slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_14" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_14" offset="0x4038" width="32" description="">
		<bitfield id="PHY_GATE_SMPL1_SLAVE_DELAY_0" width="9" begin="24" end="16" resetval="0x0" description="Number of cycles to delay the read DQS gate signal to generate gate1 signal for on-the-fly read DQS training for slice 0." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_SNAP_OBS_REGS_0" width="1" begin="8" end="8" resetval="0x0" description="Initiates a snapshot of the internal observation registers for slice 0. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_GATE_ERROR_DELAY_SELECT_0" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to wait for the DQS gate to close before flagging an error for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_15" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_15" offset="0x403C" width="32" description="">
		<bitfield id="PHY_GATE_SMPL2_SLAVE_DELAY_0" width="9" begin="24" end="16" resetval="0x0" description="Number of cycles to delay the read DQS gate signal to generate gate2 signal for on-the-fly read DQS training for slice 0." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_MEM_CLASS_0" width="3" begin="10" end="8" resetval="0x0" description="Indicates the type of DRAM for slice 0. 0 for DDR3, 1 for DDR4, 2 for DDR5, 4 for LPDDR2, 5 for LPDDR3. 6 for LPDDR4" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LPDDR_0" width="1" begin="0" end="0" resetval="0x0" description="Adds a cycle of delay for the slice 0 to match the address slice. Set to 1 to add a cycle" range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_16" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_16" offset="0x4040" width="32" description="">
		<bitfield id="ON_FLY_GATE_ADJUST_EN_0" width="2" begin="1" end="0" resetval="0x0" description="Control the on-the-fly gate adjustment for slice 0." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_17" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_17" offset="0x4044" width="32" description="">
		<bitfield id="PHY_GATE_TRACKING_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Report the on-the-fly gate measurement result for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_18" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_18" offset="0x4048" width="32" description="">
		<bitfield id="PHY_LP4_PST_AMBLE_0" width="2" begin="1" end="0" resetval="0x0" description="Controls the read postamble extension for LPDDR4 for slice 0." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_19" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_19" offset="0x404C" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT8_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 8 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_20" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_20" offset="0x4050" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT9_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 9 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_21" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_21" offset="0x4054" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT10_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 10 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_22" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_22" offset="0x4058" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT11_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 11 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_23" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_23" offset="0x405C" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT12_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 12 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_24" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_24" offset="0x4060" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT13_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 13 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_25" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_25" offset="0x4064" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT14_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 14 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_26" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_26" offset="0x4068" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT15_0" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 15 data for slice 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_27" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_27" offset="0x406C" width="32" description="">
		<bitfield id="PHY_RDDQ_ENC_OBS_SELECT_0" width="3" begin="26" end="24" resetval="0x0" description="Select value to map the internal read DQ slave delay encoded settings to the accessible read DQ encoded slave delay observation register for slice 0." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_MASTER_DLY_LOCK_OBS_SELECT_0" width="4" begin="19" end="16" resetval="0x0" description="Select value to map the internal master delay observation registers to the accessible master delay observation register for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_FIFO_PTR_RST_DISABLE_0" width="1" begin="8" end="8" resetval="0x0" description="Disables automatic reset of the read entry FIFO pointers for slice 0. Set to 1 to disable automatic resets." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_SLAVE_LOOP_CNT_UPDATE_0" width="3" begin="2" end="0" resetval="0x0" description="Reserved for future use for slice 0." range="2 - 0" rwaccess="R/W"/>
	</register>
