IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_28" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_28" offset="0x4070" width="32" description="">
		<bitfield id="PHY_FIFO_PTR_OBS_SELECT_0" width="4" begin="27" end="24" resetval="0x0" description="Select value to map the internal read entry FIFO read/write pointers to the accessible read entry FIFO pointer observation register for slice 0." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WR_SHIFT_OBS_SELECT_0" width="4" begin="19" end="16" resetval="0x0" description="Select value to map the internal write DQ/DQS automatic cycle/half_cycle shift settings to the accessible write DQ/DQS shift observation register for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WR_ENC_OBS_SELECT_0" width="4" begin="11" end="8" resetval="0x0" description="Select value to map the internal write DQ slave delay encoded settings to the accessible write DQ encoded slave delay observation register for slice 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ_ENC_OBS_SELECT_0" width="4" begin="3" end="0" resetval="0x0" description="Select value to map the internal read DQS DQ rise/fall slave delay encoded settings to the accessible read DQS DQ rise/fall encoded slave delay observation registers for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_29" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_29" offset="0x4074" width="32" description="">
		<bitfield id="PHY_WRLVL_CAPTURE_CNT_0" width="6" begin="29" end="24" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during write leveling for slice 0." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_ALGO_0" width="2" begin="17" end="16" resetval="0x0" description="Write leveling algorithm selection for slice 0." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_LVL_DEBUG_CONT_0" width="1" begin="8" end="8" resetval="0x0" description="Allows the leveling state machine to advance [when in debug mode] for slice 0. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_LVL_DEBUG_MODE_0" width="1" begin="0" end="0" resetval="0x0" description="Enables leveling debug mode for slice 0. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_30" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_30" offset="0x4078" width="32" description="">
		<bitfield id="PHY_GTLVL_UPDT_WAIT_CNT_0" width="4" begin="27" end="24" resetval="0x0" description="Number of cycles + 4 to wait after changing DQS slave delay setting during gate training for slice 0. The valid range is 0x0 to 0xB." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_CAPTURE_CNT_0" width="6" begin="21" end="16" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during gate training for slice 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_MASK_0" width="8" begin="15" end="8" resetval="0x0" description="For ECC slice, should set this register to do DQ bit mask for slice 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_UPDT_WAIT_CNT_0" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to wait after changing DQS slave delay setting during write leveling for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_31" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_31" offset="0x407C" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_OBS_SELECT_0" width="5" begin="28" end="24" resetval="0x0" description="Select value to map an individual DQ data window leading/trailing edge to the leading/trailing edge observation registers during read leveling for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_OP_MODE_0" width="2" begin="17" end="16" resetval="0x0" description="Read leveling algorithm select for slice 0. Clear to 0 to move linearly from left to right. Set to 1 to start inside the window, move left and then move right." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_UPDT_WAIT_CNT_0" width="4" begin="11" end="8" resetval="0x0" description="Number of cycles to wait after changing DQS slave delay setting during read leveling for slice 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_CAPTURE_CNT_0" width="6" begin="5" end="0" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during read leveling for slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_32" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_32" offset="0x4080" width="32" description="">
		<bitfield id="PHY_RDLVL_DATA_SWIZZLE_0" width="18" begin="25" end="8" resetval="0x0" description="Read level bit swizzling for DDR4 operation for slice 0." range="25 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_DATA_MASK_0" width="8" begin="7" end="0" resetval="0x0" description="Per-bit mask for read leveling for slice 0. If all bits are not used, only 1 bit should be cleared to 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_33" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_33" offset="0x4084" width="32" description="">
		<bitfield id="PHY_WDQLVL_PATT_0" width="3" begin="18" end="16" resetval="0x0" description="Defines the training patterns to be used during the write data leveling sequence for slice 0. Bit [0] corresponds to the LFSR data training pattern. Bit [1] corresponds to the CLK data training pattern. Bit [2] corresponds to user-defined data pattern training. If multiple bits are set, the training for each of the chosen patterns will be executed and the settings that give the smallest data valid window eye will be chosen." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_BURST_CNT_0" width="6" begin="13" end="8" resetval="0x0" description="Defines the write/read burst length in bytes during the write data leveling sequence for slice 0." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_CLK_JITTER_TOLERANCE_0" width="8" begin="7" end="0" resetval="0x0" description="Defines the minimum gap requirment for the LE and TE window for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_34" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_34" offset="0x4088" width="32" description="">
		<bitfield id="PHY_WDQLVL_DQDM_OBS_SELECT_0" width="4" begin="27" end="24" resetval="0x0" description="Select value to map an individual DQ data window leading/trailing edge to the leading/trailing edge observation registers during write data leveling for slice 0." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_UPDT_WAIT_CNT_0" width="4" begin="19" end="16" resetval="0x0" description="Number of cycles to wait after changing the DQ slave delay setting during write data leveling for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQDM_SLV_DLY_JUMP_OFFSET_0" width="11" begin="10" end="0" resetval="0x0" description="Defines the slave delay jump value when the TE window is found and begin to serch TE window for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_35" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_35" offset="0x408C" width="32" description="">
		<bitfield id="SC_PHY_WDQLVL_CLR_PREV_RESULTS_0" width="1" begin="24" end="24" resetval="0x0" description="Clears the previous result value to allow a clean slate comparison for future write DQ leveling results for slice 0. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PHY_WDQLVL_DM_DLY_STEP_0" width="4" begin="19" end="16" resetval="0x0" description="The slave delay line step for DM training for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQ_SLV_DELTA_0" width="8" begin="15" end="8" resetval="0x0" description="The margin for DQ0-7's LE and TE dealy to make sure the DQ bits can work during DM training for slice 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_PERIODIC_OBS_SELECT_0" width="8" begin="7" end="0" resetval="0x0" description="Select value to map specific information during or post periodic write data leveling for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
