IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_36" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_36" offset="0x4090" width="32" description="">
		<bitfield id="PHY_WDQLVL_DATADM_MASK_0" width="9" begin="8" end="0" resetval="0x0" description="Per-bit mask for write data leveling for slice 0. Set to 1 to mask any bit from the leveling process." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_37" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_37" offset="0x4094" width="32" description="">
		<bitfield id="PHY_USER_PATT0_0" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 0. This register holds the bytes 3 to 0 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_38" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_38" offset="0x4098" width="32" description="">
		<bitfield id="PHY_USER_PATT1_0" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 0. This register holds the bytes 7 to 4 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_39" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_39" offset="0x409C" width="32" description="">
		<bitfield id="PHY_USER_PATT2_0" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 0. This register holds the bytes 11 to 8 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_40" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_40" offset="0x40A0" width="32" description="">
		<bitfield id="PHY_USER_PATT3_0" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 0. This register holds the bytes 15 to 12 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_41" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_41" offset="0x40A4" width="32" description="">
		<bitfield id="PHY_NTP_MULT_TRAIN_0" width="1" begin="16" end="16" resetval="0x0" description="Control for single pass only No-Topology training for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_USER_PATT4_0" width="16" begin="15" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 0. This register holds the DM bit for the 15 to 0 DQ written/read from device." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_42" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_42" offset="0x40A8" width="32" description="">
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_0" width="10" begin="25" end="16" resetval="0x0" description="Threshold Criteria of period threshold after No-Topology training is completed for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_EARLY_THRESHOLD_0" width="10" begin="9" end="0" resetval="0x0" description="Threshold Criteria of early threshold after No-Topology training is completed for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_43" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_43" offset="0x40AC" width="32" description="">
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_MAX_0" width="10" begin="25" end="16" resetval="0x0" description="Maximum Threshold that phy_clk_wrdqs_slave_delay could cross boundary, to set period threshold/early threshold after No-Topology training is completed for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_MIN_0" width="10" begin="9" end="0" resetval="0x0" description="Minimum Threshold that phy_clk_wrdqs_slave_delay could cross boundary, to set period threshold/early threshold after No-Topology training is completed for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_44" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_44" offset="0x40B0" width="32" description="">
		<bitfield id="PHY_FIFO_PTR_OBS_0" width="8" begin="23" end="16" resetval="0x0" description="Observation register containing read entry FIFO pointers for slice 0. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="SC_PHY_MANUAL_CLEAR_0" width="6" begin="13" end="8" resetval="0x0" description="Manual reset/clear of internal logic for slice 0. Bit [0] initiates manual setup of the read DQS gate. Bit [1] is reset of read entry FIFO pointers. Bit [2] is reset of master delay min/max lock values. Bit [3] is manual reset of master delay unlock counter. Bit [4] is reset of leveling error bit in the leveling status registers. Bit [5] is clearing of the gate tracking observation register. Set each bit to 1 to initiate/reset. WRITE-ONLY" range="13 - 8" rwaccess="W"/> 
		<bitfield id="PHY_CALVL_VREF_DRIVING_SLICE_0" width="1" begin="0" end="0" resetval="0x0" description="Indicates if slice 0 is used to drive the VREF value to the device during CA training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_45" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_45" offset="0x40B4" width="32" description="">
		<bitfield id="PHY_LPBK_RESULT_OBS_0" width="32" begin="31" end="0" resetval="0x1048576" description="Observation register containing loopback status/results for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_46" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_46" offset="0x40B8" width="32" description="">
		<bitfield id="PHY_MASTER_DLY_LOCK_OBS_0" width="11" begin="26" end="16" resetval="0x0" description="Observation register containing master delay results for slice 0. READ-ONLY" range="26 - 16" rwaccess="R"/> 
		<bitfield id="PHY_LPBK_ERROR_COUNT_OBS_0" width="16" begin="15" end="0" resetval="0x0" description="Observation register containing total number of loopback error data for slice 0. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_47" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_47" offset="0x40BC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ_RISE_ADDER_SLV_DLY_ENC_OBS_0" width="8" begin="31" end="24" resetval="0x0" description="Observation register containing read DQS DQ rising edge adder slave delay encoded value for slice 0. READ-ONLY" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PHY_MEAS_DLY_STEP_VALUE_0" width="8" begin="23" end="16" resetval="0x0" description="Observation register containing fraction of the cycle in 1 delay element, numerator with demominator of 512, for slice 0. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_BASE_SLV_DLY_ENC_OBS_0" width="7" begin="14" end="8" resetval="0x0" description="Observation register containing read DQS base slave delay encoded value for slice 0. READ-ONLY" range="14 - 8" rwaccess="R"/> 
		<bitfield id="PHY_RDDQ_SLV_DLY_ENC_OBS_0" width="7" begin="6" end="0" resetval="0x0" description="Observation register containing read DQ slave delay encoded values for slice 0. READ-ONLY" range="6 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_48" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_48" offset="0x40C0" width="32" description="">
		<bitfield id="PHY_WRDQS_BASE_SLV_DLY_ENC_OBS_0" width="7" begin="30" end="24" resetval="0x0" description="Observation register containing write DQS base slave delay encoded value for slice 0. READ-ONLY" range="30 - 24" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_GATE_SLV_DLY_ENC_OBS_0" width="11" begin="18" end="8" resetval="0x0" description="Observation register containing read DQS gate slave delay encoded value for slice 0. READ-ONLY" range="18 - 8" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_DQ_FALL_ADDER_SLV_DLY_ENC_OBS_0" width="8" begin="7" end="0" resetval="0x0" description="Observation register containing read DQS DQ falling edge adder slave delay encoded value for slice 0. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_49" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_49" offset="0x40C4" width="32" description="">
		<bitfield id="PHY_WR_SHIFT_OBS_0" width="3" begin="18" end="16" resetval="0x0" description="Observation register containing automatic half cycle and cycle shift values for slice 0. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WR_ADDER_SLV_DLY_ENC_OBS_0" width="8" begin="15" end="8" resetval="0x0" description="Observation register containing write adder slave delay encoded value for slice 0. READ-ONLY" range="15 - 8" rwaccess="R"/> 
		<bitfield id="PHY_WRDQ_BASE_SLV_DLY_ENC_OBS_0" width="8" begin="7" end="0" resetval="0x0" description="Observation register containing write DQ base slave delay encoded value for slice 0. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_50" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_50" offset="0x40C8" width="32" description="">
		<bitfield id="PHY_WRLVL_HARD1_DELAY_OBS_0" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing write leveling first hard 1 DQS slave delay for slice 0. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WRLVL_HARD0_DELAY_OBS_0" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing write leveling last hard 0 DQS slave delay for slice 0. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_51" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_51" offset="0x40CC" width="32" description="">
		<bitfield id="PHY_WRLVL_STATUS_OBS_0" width="21" begin="20" end="0" resetval="0x0" description="Observation register containing write leveling status for slice 0. READ-ONLY" range="20 - 0" rwaccess="R"/>
	</register>
