IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_52" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_52" offset="0x40D0" width="32" description="">
		<bitfield id="PHY_GATE_SMPL2_SLV_DLY_ENC_OBS_0" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing gate sample2 slave delay encoded values for slice 0. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_GATE_SMPL1_SLV_DLY_ENC_OBS_0" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing gate sample1 slave delay encoded values for slice 0. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_53" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_53" offset="0x40D4" width="32" description="">
		<bitfield id="PHY_GTLVL_HARD1_DELAY_OBS_0" width="14" begin="29" end="16" resetval="0x0" description="Observation register containing gate training last hard 1 DQS slave delay for slice 0. READ-ONLY" range="29 - 16" rwaccess="R"/> 
		<bitfield id="PHY_GTLVL_HARD0_DELAY_OBS_0" width="14" begin="13" end="0" resetval="0x0" description="Observation register containing gate training first hard 0 DQS slave delay for slice 0. READ-ONLY" range="13 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_54" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_54" offset="0x40D8" width="32" description="">
		<bitfield id="PHY_GTLVL_STATUS_OBS_0" width="18" begin="17" end="0" resetval="0x0" description="Observation register containing gate training status for slice 0. READ-ONLY" range="17 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_55" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_55" offset="0x40DC" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_TE_DLY_OBS_0" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing read leveling data window trailing edge slave delay setting for slice 0. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_RDLVL_RDDQS_DQ_LE_DLY_OBS_0" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing read leveling data window leading edge slave delay setting for slice 0. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_56" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_56" offset="0x40E0" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_NUM_WINDOWS_OBS_0" width="2" begin="1" end="0" resetval="0x0" description="Observation register containing read leveling number of windows found for slice 0. READ-ONLY" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_57" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_57" offset="0x40E4" width="32" description="">
		<bitfield id="PHY_RDLVL_STATUS_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing read leveling status for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_58" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_58" offset="0x40E8" width="32" description="">
		<bitfield id="PHY_WDQLVL_DQDM_TE_DLY_OBS_0" width="11" begin="26" end="16" resetval="0x2047" description="Observation register containing write data leveling data window trailing edge slave delay setting for slice 0. READ-ONLY" range="26 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WDQLVL_DQDM_LE_DLY_OBS_0" width="11" begin="10" end="0" resetval="0x0" description="Observation register containing write data leveling data window leading edge slave delay setting for slice 0. READ-ONLY" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_59" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_59" offset="0x40EC" width="32" description="">
		<bitfield id="PHY_WDQLVL_STATUS_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing write data leveling status for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_60" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_60" offset="0x40F0" width="32" description="">
		<bitfield id="PHY_WDQLVL_PERIODIC_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing periodic write data leveling status for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_61" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_61" offset="0x40F4" width="32" description="">
		<bitfield id="PHY_DDL_MODE_0" width="31" begin="30" end="0" resetval="0x0" description="DDL mode for slice 0." range="30 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_62" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_62" offset="0x40F8" width="32" description="">
		<bitfield id="PHY_DDL_MASK_0" width="6" begin="5" end="0" resetval="0x0" description="DDL mask for slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_63" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_63" offset="0x40FC" width="32" description="">
		<bitfield id="PHY_DDL_TEST_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="DDL test observation for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_64" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_64" offset="0x4100" width="32" description="">
		<bitfield id="PHY_DDL_TEST_MSTR_DLY_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="DDL test observation delays for slice 0 master DDL. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_65" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_65" offset="0x4104" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ0_0" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ0 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_WDQS_OE_EXTEND_0" width="1" begin="8" end="8" resetval="0x0" description="LPDDR4 write preamble extension enable for slice 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_DDL_TRACK_UPD_THRESHOLD_0" width="8" begin="7" end="0" resetval="0x0" description="Specify threshold value for PHY init update tracking for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
