IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_66" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_66" offset="0x4108" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ2_0" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ2 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ1_0" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ1 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_67" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_67" offset="0x410C" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ4_0" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ4 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ3_0" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ3 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_68" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_68" offset="0x4110" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ6_0" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ6 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ5_0" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ5 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_69" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_69" offset="0x4114" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ7_0" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ7 for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_70" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_70" offset="0x4118" width="32" description="">
		<bitfield id="PHY_RX_CAL_DM_0" width="18" begin="17" end="0" resetval="0x0" description="RX Calibration codes for DM for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_71" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_71" offset="0x411C" width="32" description="">
		<bitfield id="PHY_RX_CAL_FDBK_0" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for FDBK for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQS_0" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQS for slice 0. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_72" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_72" offset="0x4120" width="32" description="">
		<bitfield id="PHY_FDBK_PWR_CTRL_0" width="3" begin="26" end="24" resetval="0x0" description="Shutoff gate feedback IO to reduce power for slice 0." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_STATIC_TOG_DISABLE_0" width="5" begin="20" end="16" resetval="0x0" description="Control to disable toggle during static activity for slice 0. bit0: Write path delay line disable; bit1: Read path delay line disable; bit2: Read data path disable; bit3: clk_phy disable; bit4: master delay line disable." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_BIAS_EN_0" width="11" begin="10" end="0" resetval="0x0" description="Controls RX_BIAS_EN pin for each pad for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_73" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_73" offset="0x4124" width="32" description="">
		<bitfield id="PHY_SLICE_PWR_RDC_DISABLE_0" width="1" begin="24" end="24" resetval="0x0" description="Data slice power reduction disable for slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_DCC_RXCAL_CTRL_GATE_DISABLE_0" width="1" begin="16" end="16" resetval="0x0" description="Data slice RX_CAL block power reduction disable for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDPATH_GATE_DISABLE_0" width="1" begin="8" end="8" resetval="0x0" description="Data slice read path power reduction disable for slice 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_SLV_DLY_CTRL_GATE_DISABLE_0" width="1" begin="0" end="0" resetval="0x0" description="Data slice slv_dly_control block power reduction disable for slice 0." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_74" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_74" offset="0x4128" width="32" description="">
		<bitfield id="PHY_DQS_TSEL_ENABLE_0" width="3" begin="26" end="24" resetval="0x0" description="Operation type tsel enables for DQS signals for slice 0. Bit [0] enables tsel_en during read cycles. Bit [1] enables tsel_en during write cycles. Bit [2] enables tsel_en during idle cycles. Set each bit to 1 to enable." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_SELECT_0" width="16" begin="23" end="8" resetval="0x0" description="Operation type tsel select values for DQ/DM signals for slice 0." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_ENABLE_0" width="3" begin="2" end="0" resetval="0x0" description="Operation type tsel enables for DQ/DM signals for slice 0. Bit [0] enables tsel_en during read cycles. Bit [1] enables tsel_en during write cycles. Bit [2] enables tsel_en during idle cycles. Set each bit to 1 to enable." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_75" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_75" offset="0x412C" width="32" description="">
		<bitfield id="PHY_VREF_INITIAL_START_POINT_0" width="7" begin="30" end="24" resetval="0x0" description="Data slice initial VREF training start value for slice 0." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_TWO_CYC_PREAMBLE_0" width="2" begin="17" end="16" resetval="0x0" description="2 cycle preamble support for slice 0. Bit [0] controls the 2 cycle read preamble. Bit [1] controls the 2 cycle write preamble. Set each bit to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_TSEL_SELECT_0" width="16" begin="15" end="0" resetval="0x0" description="Operation type tsel select values for DQS signals for slice 0." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_76" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_76" offset="0x4130" width="32" description="">
		<bitfield id="PHY_NTP_WDQ_STEP_SIZE_0" width="8" begin="31" end="24" resetval="0x0" description="Step size of WR DQ slave delay during No-Topology training for slice 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_TRAIN_EN_0" width="1" begin="16" end="16" resetval="0x0" description="Enable for No-Topology training for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_TRAINING_CTRL_0" width="2" begin="9" end="8" resetval="0x0" description="Data slice vref training enable control for slice 0." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_INITIAL_STOP_POINT_0" width="7" begin="6" end="0" resetval="0x0" description="Data slice initial VREF training stop value for slice 0." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_77" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_77" offset="0x4134" width="32" description="">
		<bitfield id="PHY_NTP_WDQ_STOP_0" width="11" begin="26" end="16" resetval="0x0" description="End of WR DQ slave delay in No-Topology training for slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WDQ_START_0" width="11" begin="10" end="0" resetval="0x0" description="Starting WR DQ slave delay in No-Topology training for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_78" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_78" offset="0x4138" width="32" description="">
		<bitfield id="PHY_SW_WDQLVL_DVW_MIN_EN_0" width="1" begin="24" end="24" resetval="0x0" description="SW override to enable use of PHY_WDQLVL_DVW_MIN for slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DVW_MIN_0" width="10" begin="17" end="8" resetval="0x0" description="Minimum data valid window across DQs and ranks for slice 0." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WDQ_BIT_EN_0" width="8" begin="7" end="0" resetval="0x0" description="Enable Bit for WR DQ during No-Topology training for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_79" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_79" offset="0x413C" width="32" description="">
		<bitfield id="PHY_PAD_RX_DCD_0_0" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_TX_DCD_0" width="5" begin="20" end="16" resetval="0x0" description="Controls TX_DCD pin for each pad for slice 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_FAST_LVL_EN_0" width="4" begin="11" end="8" resetval="0x0" description="Enable for fast multi-pattern window search for slice 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_PER_START_OFFSET_0" width="6" begin="5" end="0" resetval="0x0" description="Peridic training start point offset for slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_80" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_80" offset="0x4140" width="32" description="">
		<bitfield id="PHY_PAD_RX_DCD_4_0" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_3_0" width="5" begin="20" end="16" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_2_0" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_1_0" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_81" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_81" offset="0x4144" width="32" description="">
		<bitfield id="PHY_PAD_DM_RX_DCD_0" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for dm pad for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_7_0" width="5" begin="20" end="16" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_6_0" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_5_0" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
