IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_82" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_82" offset="0x4148" width="32" description="">
		<bitfield id="PHY_PAD_DSLICE_IO_CFG_0" width="7" begin="22" end="16" resetval="0x0" description="Controls PCLK/PARK pin for pad for slice 0." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_FDBK_RX_DCD_0" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for fdbk pad for slice 0." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_DQS_RX_DCD_0" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for dqs pad for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_83" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_83" offset="0x414C" width="32" description="">
		<bitfield id="PHY_RDDQ1_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQ1 slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ0_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DQ0 slave delay setting for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_84" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_84" offset="0x4150" width="32" description="">
		<bitfield id="PHY_RDDQ3_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQ3 slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ2_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DQ2 slave delay setting for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_85" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_85" offset="0x4154" width="32" description="">
		<bitfield id="PHY_RDDQ5_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQ5 slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ4_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DQ4 slave delay setting for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_86" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_86" offset="0x4158" width="32" description="">
		<bitfield id="PHY_RDDQ7_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQ7 slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ6_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DQ6 slave delay setting for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_87" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_87" offset="0x415C" width="32" description="">
		<bitfield id="PHY_RX_CAL_ALL_DLY_0" width="5" begin="28" end="24" resetval="0x0" description="Defines the number of cycles/half cycles that the rx_cal_all_opad signal should be asserted for. There is a phy_rx_cal_all_dly_X parameter for each of the slices of data sent on the DFI data bus for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_PCLK_CLK_SEL_0" width="3" begin="18" end="16" resetval="0x0" description="RX_PCLK clock frequency selection for slice 0." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDM_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Read DM/DBI slave delay setting for slice 0. May be used for data swap." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_88" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_88" offset="0x4160" width="32" description="">
		<bitfield id="PHY_DQS_OE_TIMING_0" width="8" begin="31" end="24" resetval="0x0" description="Start/end timing values for DQS output enable signals for slice 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_WR_TIMING_0" width="8" begin="23" end="16" resetval="0x0" description="Start/end timing values for DQ/DM write based termination enable and select signals for slice 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_RD_TIMING_0" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQ/DM read based termination enable and select signals for slice 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_OE_TIMING_0" width="8" begin="7" end="0" resetval="0x0" description="Start/end timing values for DQ/DM output enable signals for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_89" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_89" offset="0x4164" width="32" description="">
		<bitfield id="PHY_DQS_TSEL_WR_TIMING_0" width="8" begin="31" end="24" resetval="0x0" description="Start/end timing values for DQS write based termination enable and select signals for slice 0." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_OE_RD_TIMING_0" width="8" begin="23" end="16" resetval="0x0" description="Start/end timing values for DQS read based OE extension for slice 0." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_TSEL_RD_TIMING_0" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQS read based termination enable and select signals for slice 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_IO_PAD_DELAY_TIMING_0" width="4" begin="3" end="0" resetval="0x0" description="Feedback pad's OPAD and IPAD delay timing for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_90" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_90" offset="0x4168" width="32" description="">
		<bitfield id="PHY_PAD_VREF_CTRL_DQ_0" width="12" begin="27" end="16" resetval="0x0" description="Pad VREF control settings for DQ slice 0." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_SETTING_TIME_0" width="16" begin="15" end="0" resetval="0x0" description="Number of cycles for vref settle after setting is changed for slice 0." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_91" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_91" offset="0x416C" width="32" description="">
		<bitfield id="PHY_IE_MODE_0" width="2" begin="25" end="24" resetval="0x0" description="Input enable mode bits for slice 0. Bit [0] enables the mode where the input enables are always on; set to 1 to enable. Bit [1] disables the input enable on the DM signal; set to 1 to disable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_IE_DLY_0" width="2" begin="17" end="16" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for input enable generation for slice 0." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_IE_TIMING_0" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQS input enable signals for slice 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_IE_TIMING_0" width="8" begin="7" end="0" resetval="0x0" description="Start/end timing values for DQ/DM input enable signals for slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_92" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_92" offset="0x4170" width="32" description="">
		<bitfield id="PHY_WDQLVL_RDDATA_EN_TSEL_DLY_0" width="5" begin="28" end="24" resetval="0x0" description="For WR DQ training, the number of cycles that the dfi_rddata_en signal is earlier than necessary for TSEL enable generation for slice 0." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_RDDATA_EN_DLY_0" width="5" begin="20" end="16" resetval="0x0" description="For WR DQ training, the number of cycles that the dfi_rddata_en signal is early for slice 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_IE_ON_0" width="1" begin="8" end="8" resetval="0x0" description="IE control, 1 meams IE is always on during WR DQ training for slice 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_DBI_MODE_0" width="2" begin="1" end="0" resetval="0x0" description="DBI mode for slice 0. Bit [0] enables return of DBI read data." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_93" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_93" offset="0x4174" width="32" description="">
		<bitfield id="PHY_SW_MASTER_MODE_0" width="4" begin="19" end="16" resetval="0x0" description="Master delay line override settings for slice 0. Bit [0] enables software half clock mode. Bit [1] is the software half clock mode value. Bit [2] enables software bypass mode. Bit [3] is the software bypass mode value." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_OE_DLY_0" width="5" begin="12" end="8" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for LP4 OE extension generation for slice 0." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_TSEL_DLY_0" width="5" begin="4" end="0" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for TSEL enable generation for slice 0." range="4 - 0" rwaccess="R/W"/>
	</register>
