IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_106" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_106" offset="0x41A8" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ3_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ3 for slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ2_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ2 for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_107" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_107" offset="0x41AC" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ5_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ5 for slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ4_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ4 for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_108" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_108" offset="0x41B0" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ7_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ7 for slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ6_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ6 for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_109" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_109" offset="0x41B4" width="32" description="">
		<bitfield id="PHY_CLK_WRDQS_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Write clock slave delay setting for DQS for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDM_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DM for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_110" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_110" offset="0x41B8" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ0_RISE_SLAVE_DELAY_0" width="10" begin="17" end="8" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ0 for slice 0." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_THRESHOLD_ADJUST_0" width="2" begin="1" end="0" resetval="0x0" description="Write level threshold adjust value based on those thresholds for DQS for slice 0." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_111" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_111" offset="0x41BC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ1_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ1 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ0_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ0 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_112" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_112" offset="0x41C0" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ2_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ2 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ1_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ1 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_113" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_113" offset="0x41C4" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ3_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ3 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ2_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ2 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_114" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_114" offset="0x41C8" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ4_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ4 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ3_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ3 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_115" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_115" offset="0x41CC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ5_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ5 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ4_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ4 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_116" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_116" offset="0x41D0" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ6_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ6 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ5_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ5 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_117" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_117" offset="0x41D4" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ7_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ7 for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ6_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ6 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
