IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_118" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_118" offset="0x41D8" width="32" description="">
		<bitfield id="PHY_RDDQS_DM_RISE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DM for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ7_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ7 for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_119" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_119" offset="0x41DC" width="32" description="">
		<bitfield id="PHY_RDDQS_GATE_SLAVE_DELAY_0" width="10" begin="25" end="16" resetval="0x0" description="Read DQS slave delay setting for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DM_FALL_SLAVE_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DM for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_120" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_120" offset="0x41E0" width="32" description="">
		<bitfield id="PHY_WRLVL_DELAY_EARLY_THRESHOLD_0" width="10" begin="25" end="16" resetval="0x0" description="Write level delay threshold above which will be considered in previous cycle for slice 0." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WRITE_PATH_LAT_ADD_0" width="3" begin="10" end="8" resetval="0x0" description="Number of cycles to delay the incoming dfi_wrdata_en/dfi_wrdata signals for slice 0." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_LATENCY_ADJUST_0" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to delay the incoming dfi_rddata_en for read DQS gate generation for slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_121" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_121" offset="0x41E4" width="32" description="">
		<bitfield id="PHY_WRLVL_EARLY_FORCE_ZERO_0" width="1" begin="16" end="16" resetval="0x0" description="Force the final write level delay value [that meets the early threshold] to 0 for slice 0." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_DELAY_PERIOD_THRESHOLD_0" width="10" begin="9" end="0" resetval="0x0" description="Write level delay threshold below which will add a cycle of write path latency for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_122" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_122" offset="0x41E8" width="32" description="">
		<bitfield id="PHY_GTLVL_LAT_ADJ_START_0" width="4" begin="19" end="16" resetval="0x0" description="Initial read DQS gate cycle delay from dfi_rddata_en during gate training for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_RDDQS_SLV_DLY_START_0" width="10" begin="9" end="0" resetval="0x0" description="Initial read DQS gate slave delay setting during gate training for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_123" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_123" offset="0x41EC" width="32" description="">
		<bitfield id="PHY_NTP_PASS_0" width="1" begin="24" end="24" resetval="0x0" description="Indicates if No-topology training found a passing result for slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WRLAT_START_0" width="4" begin="19" end="16" resetval="0x0" description="Initial value for phy_write_path_lat_add for No-topology training and early threshold for slice 0." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQDM_SLV_DLY_START_0" width="11" begin="10" end="0" resetval="0x0" description="Initial DQ/DM slave delay setting during write data leveling for slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_124" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_124" offset="0x41F0" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_SLV_DLY_START_0" width="10" begin="9" end="0" resetval="0x0" description="Read leveling starting value for the DQS/DQ slave delay settings for slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_125" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_125" offset="0x41F4" width="32" description="">
		<bitfield id="PHY_DSLICE_PAD_RX_CTLE_SETTING_0" width="6" begin="21" end="16" resetval="0x0" description="Setting for RX ctle P/N of pad for slice 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DSLICE_PAD_BOOSTPN_SETTING_0" width="16" begin="15" end="0" resetval="0x0" description="Setting for boost P/N of pad for slice 0." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_256" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_256" offset="0x4400" width="32" description="">
		<bitfield id="PHY_CLK_WR_BYPASS_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Write data clock bypass mode slave delay setting for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_PAD_DSLICE_IO_CFG_1" width="7" begin="14" end="8" resetval="0x0" description="Controls PCLK/PARK pin for pad for slice 1 with boot frequency." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_RX_PCLK_CLK_SEL_1" width="3" begin="2" end="0" resetval="0x0" description="RX_PCLK boot clock frequency selection for slice 1." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_257" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_257" offset="0x4404" width="32" description="">
		<bitfield id="PHY_WRITE_PATH_LAT_ADD_BYPASS_1" width="3" begin="26" end="24" resetval="0x0" description="Number of cycles on bypass mode to delay the incoming dfi_wrdata_en/dfi_wrdata signals for slice 1." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQS_SLAVE_DELAY_BYPASS_1" width="10" begin="17" end="8" resetval="0x0" description="Write DQS bypass mode slave delay setting for slice 1." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_IO_PAD_DELAY_TIMING_BYPASS_1" width="4" begin="3" end="0" resetval="0x0" description="Feedback pad's OPAD and IPAD delay timing on bypass mode for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_258" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_258" offset="0x4408" width="32" description="">
		<bitfield id="PHY_CLK_BYPASS_OVERRIDE_1" width="1" begin="24" end="24" resetval="0x0" description="Bypass mode override setting for slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_BYPASS_TWO_CYC_PREAMBLE_1" width="2" begin="17" end="16" resetval="0x0" description="Two_cycle_preamble for bypass mode for slice 1." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_GATE_BYPASS_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DQS bypass mode slave delay setting for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
