IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_265" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_265" offset="0x4424" width="32" description="">
		<bitfield id="PHY_AUTO_TIMING_MARGIN_CONTROL_1" width="32" begin="31" end="0" resetval="0x0" description="Auto timing marging control bits for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_266" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_266" offset="0x4428" width="32" description="">
		<bitfield id="PHY_AUTO_TIMING_MARGIN_OBS_1" width="28" begin="27" end="0" resetval="0x0" description="Observation register for the auto_timing_margin for slice 1. READ-ONLY" range="27 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_267" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_267" offset="0x442C" width="32" description="">
		<bitfield id="PHY_PRBS_PATTERN_START_1" width="7" begin="30" end="24" resetval="0x1" description="PRBS7 start pattern for slice 1." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PDA_MODE_EN_1" width="1" begin="16" end="16" resetval="0x0" description="When set to 1, the invalid DQs will be driven by the dfi_wrdata to make sure the tpda_s and tpda_h's timing is meet for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_IDLE_1" width="9" begin="8" end="0" resetval="0x0" description="When set to 1, the inavlid DQ will be driven to high, when set to 0, the invalid DQ will be driven to low for slice 1." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_268" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_268" offset="0x4430" width="32" description="">
		<bitfield id="PHY_RDLVL_MULTI_PATT_RST_DISABLE_1" width="1" begin="24" end="24" resetval="0x0" description="Read Leveling read level windows disable reset for slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_MULTI_PATT_ENABLE_1" width="1" begin="16" end="16" resetval="0x0" description="Read Leveling Multi-pattern enable for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_PRBS_PATTERN_MASK_1" width="9" begin="8" end="0" resetval="0x0" description="PRBS7 mask signal for slice 1." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_269" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_269" offset="0x4434" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ_BYPASS_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQS data clock bypass mode slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_TRAIN_OBS_1" width="7" begin="14" end="8" resetval="0x0" description="Observation register for best vref value for slice 1. READ-ONLY" range="14 - 8" rwaccess="R"/> 
		<bitfield id="PHY_VREF_INITIAL_STEPSIZE_1" width="6" begin="5" end="0" resetval="0x0" description="Data slice initial VREF training step size for slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_270" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_270" offset="0x4438" width="32" description="">
		<bitfield id="PHY_GATE_SMPL1_SLAVE_DELAY_1" width="9" begin="24" end="16" resetval="0x0" description="Number of cycles to delay the read DQS gate signal to generate gate1 signal for on-the-fly read DQS training for slice 1." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_SNAP_OBS_REGS_1" width="1" begin="8" end="8" resetval="0x0" description="Initiates a snapshot of the internal observation registers for slice 1. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_GATE_ERROR_DELAY_SELECT_1" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to wait for the DQS gate to close before flagging an error for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_271" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_271" offset="0x443C" width="32" description="">
		<bitfield id="PHY_GATE_SMPL2_SLAVE_DELAY_1" width="9" begin="24" end="16" resetval="0x0" description="Number of cycles to delay the read DQS gate signal to generate gate2 signal for on-the-fly read DQS training for slice 1." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_MEM_CLASS_1" width="3" begin="10" end="8" resetval="0x0" description="Indicates the type of DRAM for slice 1. 0 for DDR3, 1 for DDR4, 2 for DDR5, 4 for LPDDR2, 5 for LPDDR3. 6 for LPDDR4" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LPDDR_1" width="1" begin="0" end="0" resetval="0x0" description="Adds a cycle of delay for the slice 1 to match the address slice. Set to 1 to add a cycle" range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_272" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_272" offset="0x4440" width="32" description="">
		<bitfield id="ON_FLY_GATE_ADJUST_EN_1" width="2" begin="1" end="0" resetval="0x0" description="Control the on-the-fly gate adjustment for slice 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_273" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_273" offset="0x4444" width="32" description="">
		<bitfield id="PHY_GATE_TRACKING_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Report the on-the-fly gate measurement result for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_274" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_274" offset="0x4448" width="32" description="">
		<bitfield id="PHY_LP4_PST_AMBLE_1" width="2" begin="1" end="0" resetval="0x0" description="Controls the read postamble extension for LPDDR4 for slice 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_275" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_275" offset="0x444C" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT8_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 8 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_276" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_276" offset="0x4450" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT9_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 9 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_277" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_277" offset="0x4454" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT10_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 10 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_278" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_278" offset="0x4458" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT11_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 11 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
