IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_279" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_279" offset="0x445C" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT12_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 12 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_280" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_280" offset="0x4460" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT13_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 13 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_281" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_281" offset="0x4464" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT14_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 14 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_282" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_282" offset="0x4468" width="32" description="">
		<bitfield id="PHY_RDLVL_PATT15_1" width="32" begin="31" end="0" resetval="0x0" description="Read leveling pattern 15 data for slice 1." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_283" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_283" offset="0x446C" width="32" description="">
		<bitfield id="PHY_RDDQ_ENC_OBS_SELECT_1" width="3" begin="26" end="24" resetval="0x0" description="Select value to map the internal read DQ slave delay encoded settings to the accessible read DQ encoded slave delay observation register for slice 1." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_MASTER_DLY_LOCK_OBS_SELECT_1" width="4" begin="19" end="16" resetval="0x0" description="Select value to map the internal master delay observation registers to the accessible master delay observation register for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_FIFO_PTR_RST_DISABLE_1" width="1" begin="8" end="8" resetval="0x0" description="Disables automatic reset of the read entry FIFO pointers for slice 1. Set to 1 to disable automatic resets." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_SLAVE_LOOP_CNT_UPDATE_1" width="3" begin="2" end="0" resetval="0x0" description="Reserved for future use for slice 1." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_284" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_284" offset="0x4470" width="32" description="">
		<bitfield id="PHY_FIFO_PTR_OBS_SELECT_1" width="4" begin="27" end="24" resetval="0x0" description="Select value to map the internal read entry FIFO read/write pointers to the accessible read entry FIFO pointer observation register for slice 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WR_SHIFT_OBS_SELECT_1" width="4" begin="19" end="16" resetval="0x0" description="Select value to map the internal write DQ/DQS automatic cycle/half_cycle shift settings to the accessible write DQ/DQS shift observation register for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WR_ENC_OBS_SELECT_1" width="4" begin="11" end="8" resetval="0x0" description="Select value to map the internal write DQ slave delay encoded settings to the accessible write DQ encoded slave delay observation register for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ_ENC_OBS_SELECT_1" width="4" begin="3" end="0" resetval="0x0" description="Select value to map the internal read DQS DQ rise/fall slave delay encoded settings to the accessible read DQS DQ rise/fall encoded slave delay observation registers for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_285" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_285" offset="0x4474" width="32" description="">
		<bitfield id="PHY_WRLVL_CAPTURE_CNT_1" width="6" begin="29" end="24" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during write leveling for slice 1." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_ALGO_1" width="2" begin="17" end="16" resetval="0x0" description="Write leveling algorithm selection for slice 1." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_LVL_DEBUG_CONT_1" width="1" begin="8" end="8" resetval="0x0" description="Allows the leveling state machine to advance [when in debug mode] for slice 1. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_LVL_DEBUG_MODE_1" width="1" begin="0" end="0" resetval="0x0" description="Enables leveling debug mode for slice 1. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_286" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_286" offset="0x4478" width="32" description="">
		<bitfield id="PHY_GTLVL_UPDT_WAIT_CNT_1" width="4" begin="27" end="24" resetval="0x0" description="Number of cycles + 4 to wait after changing DQS slave delay setting during gate training for slice 1. The valid range is 0x0 to 0xB." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_CAPTURE_CNT_1" width="6" begin="21" end="16" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during gate training for slice 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_MASK_1" width="8" begin="15" end="8" resetval="0x0" description="For ECC slice, should set this register to do DQ bit mask for slice 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_UPDT_WAIT_CNT_1" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to wait after changing DQS slave delay setting during write leveling for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_287" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_287" offset="0x447C" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_OBS_SELECT_1" width="5" begin="28" end="24" resetval="0x0" description="Select value to map an individual DQ data window leading/trailing edge to the leading/trailing edge observation registers during read leveling for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_OP_MODE_1" width="2" begin="17" end="16" resetval="0x0" description="Read leveling algorithm select for slice 1. Clear to 0 to move linearly from left to right. Set to 1 to start inside the window, move left and then move right." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_UPDT_WAIT_CNT_1" width="4" begin="11" end="8" resetval="0x0" description="Number of cycles to wait after changing DQS slave delay setting during read leveling for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_CAPTURE_CNT_1" width="6" begin="5" end="0" resetval="0x0" description="Number of samples to take at each DQS slave delay setting during read leveling for slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
