IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_288" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_288" offset="0x4480" width="32" description="">
		<bitfield id="PHY_RDLVL_DATA_SWIZZLE_1" width="18" begin="25" end="8" resetval="0x0" description="Read level bit swizzling for DDR4 operation for slice 1." range="25 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDLVL_DATA_MASK_1" width="8" begin="7" end="0" resetval="0x0" description="Per-bit mask for read leveling for slice 1. If all bits are not used, only 1 bit should be cleared to 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_289" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_289" offset="0x4484" width="32" description="">
		<bitfield id="PHY_WDQLVL_PATT_1" width="3" begin="18" end="16" resetval="0x0" description="Defines the training patterns to be used during the write data leveling sequence for slice 1. Bit [0] corresponds to the LFSR data training pattern. Bit [1] corresponds to the CLK data training pattern. Bit [2] corresponds to user-defined data pattern training. If multiple bits are set, the training for each of the chosen patterns will be executed and the settings that give the smallest data valid window eye will be chosen." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_BURST_CNT_1" width="6" begin="13" end="8" resetval="0x0" description="Defines the write/read burst length in bytes during the write data leveling sequence for slice 1." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_CLK_JITTER_TOLERANCE_1" width="8" begin="7" end="0" resetval="0x0" description="Defines the minimum gap requirment for the LE and TE window for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_290" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_290" offset="0x4488" width="32" description="">
		<bitfield id="PHY_WDQLVL_DQDM_OBS_SELECT_1" width="4" begin="27" end="24" resetval="0x0" description="Select value to map an individual DQ data window leading/trailing edge to the leading/trailing edge observation registers during write data leveling for slice 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_UPDT_WAIT_CNT_1" width="4" begin="19" end="16" resetval="0x0" description="Number of cycles to wait after changing the DQ slave delay setting during write data leveling for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQDM_SLV_DLY_JUMP_OFFSET_1" width="11" begin="10" end="0" resetval="0x0" description="Defines the slave delay jump value when the TE window is found and begin to serch TE window for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_291" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_291" offset="0x448C" width="32" description="">
		<bitfield id="SC_PHY_WDQLVL_CLR_PREV_RESULTS_1" width="1" begin="24" end="24" resetval="0x0" description="Clears the previous result value to allow a clean slate comparison for future write DQ leveling results for slice 1. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PHY_WDQLVL_DM_DLY_STEP_1" width="4" begin="19" end="16" resetval="0x0" description="The slave delay line step for DM training for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQ_SLV_DELTA_1" width="8" begin="15" end="8" resetval="0x0" description="The margin for DQ0-7's LE and TE dealy to make sure the DQ bits can work during DM training for slice 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_PERIODIC_OBS_SELECT_1" width="8" begin="7" end="0" resetval="0x0" description="Select value to map specific information during or post periodic write data leveling for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_292" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_292" offset="0x4490" width="32" description="">
		<bitfield id="PHY_WDQLVL_DATADM_MASK_1" width="9" begin="8" end="0" resetval="0x0" description="Per-bit mask for write data leveling for slice 1. Set to 1 to mask any bit from the leveling process." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_293" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_293" offset="0x4494" width="32" description="">
		<bitfield id="PHY_USER_PATT0_1" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 1. This register holds the bytes 3 to 0 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_294" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_294" offset="0x4498" width="32" description="">
		<bitfield id="PHY_USER_PATT1_1" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 1. This register holds the bytes 7 to 4 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_295" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_295" offset="0x449C" width="32" description="">
		<bitfield id="PHY_USER_PATT2_1" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 1. This register holds the bytes 11 to 8 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_296" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_296" offset="0x44A0" width="32" description="">
		<bitfield id="PHY_USER_PATT3_1" width="32" begin="31" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 1. This register holds the bytes 15 to 12 written/read from device." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_297" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_297" offset="0x44A4" width="32" description="">
		<bitfield id="PHY_NTP_MULT_TRAIN_1" width="1" begin="16" end="16" resetval="0x0" description="Control for single pass only No-Topology training for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_USER_PATT4_1" width="16" begin="15" end="0" resetval="0x0" description="User-defined pattern to be used during write data leveling for slice 1. This register holds the DM bit for the 15 to 0 DQ written/read from device." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_298" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_298" offset="0x44A8" width="32" description="">
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_1" width="10" begin="25" end="16" resetval="0x0" description="Threshold Criteria of period threshold after No-Topology training is completed for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_EARLY_THRESHOLD_1" width="10" begin="9" end="0" resetval="0x0" description="Threshold Criteria of early threshold after No-Topology training is completed for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_299" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_299" offset="0x44AC" width="32" description="">
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_MAX_1" width="10" begin="25" end="16" resetval="0x0" description="Maximum Threshold that phy_clk_wrdqs_slave_delay could cross boundary, to set period threshold/early threshold after No-Topology training is completed for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_PERIOD_THRESHOLD_MIN_1" width="10" begin="9" end="0" resetval="0x0" description="Minimum Threshold that phy_clk_wrdqs_slave_delay could cross boundary, to set period threshold/early threshold after No-Topology training is completed for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_300" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_300" offset="0x44B0" width="32" description="">
		<bitfield id="PHY_FIFO_PTR_OBS_1" width="8" begin="23" end="16" resetval="0x0" description="Observation register containing read entry FIFO pointers for slice 1. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="SC_PHY_MANUAL_CLEAR_1" width="6" begin="13" end="8" resetval="0x0" description="Manual reset/clear of internal logic for slice 1. Bit [0] initiates manual setup of the read DQS gate. Bit [1] is reset of read entry FIFO pointers. Bit [2] is reset of master delay min/max lock values. Bit [3] is manual reset of master delay unlock counter. Bit [4] is reset of leveling error bit in the leveling status registers. Bit [5] is clearing of the gate tracking observation register. Set each bit to 1 to initiate/reset. WRITE-ONLY" range="13 - 8" rwaccess="W"/> 
		<bitfield id="PHY_CALVL_VREF_DRIVING_SLICE_1" width="1" begin="0" end="0" resetval="0x0" description="Indicates if slice 1 is used to drive the VREF value to the device during CA training." range="0" rwaccess="R/W"/>
	</register>
