IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_301" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_301" offset="0x44B4" width="32" description="">
		<bitfield id="PHY_LPBK_RESULT_OBS_1" width="32" begin="31" end="0" resetval="0x1048576" description="Observation register containing loopback status/results for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_302" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_302" offset="0x44B8" width="32" description="">
		<bitfield id="PHY_MASTER_DLY_LOCK_OBS_1" width="11" begin="26" end="16" resetval="0x0" description="Observation register containing master delay results for slice 1. READ-ONLY" range="26 - 16" rwaccess="R"/> 
		<bitfield id="PHY_LPBK_ERROR_COUNT_OBS_1" width="16" begin="15" end="0" resetval="0x0" description="Observation register containing total number of loopback error data for slice 1. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_303" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_303" offset="0x44BC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ_RISE_ADDER_SLV_DLY_ENC_OBS_1" width="8" begin="31" end="24" resetval="0x0" description="Observation register containing read DQS DQ rising edge adder slave delay encoded value for slice 1. READ-ONLY" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PHY_MEAS_DLY_STEP_VALUE_1" width="8" begin="23" end="16" resetval="0x0" description="Observation register containing fraction of the cycle in 1 delay element, numerator with demominator of 512, for slice 1. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_BASE_SLV_DLY_ENC_OBS_1" width="7" begin="14" end="8" resetval="0x0" description="Observation register containing read DQS base slave delay encoded value for slice 1. READ-ONLY" range="14 - 8" rwaccess="R"/> 
		<bitfield id="PHY_RDDQ_SLV_DLY_ENC_OBS_1" width="7" begin="6" end="0" resetval="0x0" description="Observation register containing read DQ slave delay encoded values for slice 1. READ-ONLY" range="6 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_304" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_304" offset="0x44C0" width="32" description="">
		<bitfield id="PHY_WRDQS_BASE_SLV_DLY_ENC_OBS_1" width="7" begin="30" end="24" resetval="0x0" description="Observation register containing write DQS base slave delay encoded value for slice 1. READ-ONLY" range="30 - 24" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_GATE_SLV_DLY_ENC_OBS_1" width="11" begin="18" end="8" resetval="0x0" description="Observation register containing read DQS gate slave delay encoded value for slice 1. READ-ONLY" range="18 - 8" rwaccess="R"/> 
		<bitfield id="PHY_RDDQS_DQ_FALL_ADDER_SLV_DLY_ENC_OBS_1" width="8" begin="7" end="0" resetval="0x0" description="Observation register containing read DQS DQ falling edge adder slave delay encoded value for slice 1. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_305" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_305" offset="0x44C4" width="32" description="">
		<bitfield id="PHY_WR_SHIFT_OBS_1" width="3" begin="18" end="16" resetval="0x0" description="Observation register containing automatic half cycle and cycle shift values for slice 1. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WR_ADDER_SLV_DLY_ENC_OBS_1" width="8" begin="15" end="8" resetval="0x0" description="Observation register containing write adder slave delay encoded value for slice 1. READ-ONLY" range="15 - 8" rwaccess="R"/> 
		<bitfield id="PHY_WRDQ_BASE_SLV_DLY_ENC_OBS_1" width="8" begin="7" end="0" resetval="0x0" description="Observation register containing write DQ base slave delay encoded value for slice 1. READ-ONLY" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_306" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_306" offset="0x44C8" width="32" description="">
		<bitfield id="PHY_WRLVL_HARD1_DELAY_OBS_1" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing write leveling first hard 1 DQS slave delay for slice 1. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WRLVL_HARD0_DELAY_OBS_1" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing write leveling last hard 0 DQS slave delay for slice 1. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_307" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_307" offset="0x44CC" width="32" description="">
		<bitfield id="PHY_WRLVL_STATUS_OBS_1" width="21" begin="20" end="0" resetval="0x0" description="Observation register containing write leveling status for slice 1. READ-ONLY" range="20 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_308" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_308" offset="0x44D0" width="32" description="">
		<bitfield id="PHY_GATE_SMPL2_SLV_DLY_ENC_OBS_1" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing gate sample2 slave delay encoded values for slice 1. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_GATE_SMPL1_SLV_DLY_ENC_OBS_1" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing gate sample1 slave delay encoded values for slice 1. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_309" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_309" offset="0x44D4" width="32" description="">
		<bitfield id="PHY_GTLVL_HARD1_DELAY_OBS_1" width="14" begin="29" end="16" resetval="0x0" description="Observation register containing gate training last hard 1 DQS slave delay for slice 1. READ-ONLY" range="29 - 16" rwaccess="R"/> 
		<bitfield id="PHY_GTLVL_HARD0_DELAY_OBS_1" width="14" begin="13" end="0" resetval="0x0" description="Observation register containing gate training first hard 0 DQS slave delay for slice 1. READ-ONLY" range="13 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_310" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_310" offset="0x44D8" width="32" description="">
		<bitfield id="PHY_GTLVL_STATUS_OBS_1" width="18" begin="17" end="0" resetval="0x0" description="Observation register containing gate training status for slice 1. READ-ONLY" range="17 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_311" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_311" offset="0x44DC" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_TE_DLY_OBS_1" width="10" begin="25" end="16" resetval="0x0" description="Observation register containing read leveling data window trailing edge slave delay setting for slice 1. READ-ONLY" range="25 - 16" rwaccess="R"/> 
		<bitfield id="PHY_RDLVL_RDDQS_DQ_LE_DLY_OBS_1" width="10" begin="9" end="0" resetval="0x0" description="Observation register containing read leveling data window leading edge slave delay setting for slice 1. READ-ONLY" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_312" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_312" offset="0x44E0" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_NUM_WINDOWS_OBS_1" width="2" begin="1" end="0" resetval="0x0" description="Observation register containing read leveling number of windows found for slice 1. READ-ONLY" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_313" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_313" offset="0x44E4" width="32" description="">
		<bitfield id="PHY_RDLVL_STATUS_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing read leveling status for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_314" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_314" offset="0x44E8" width="32" description="">
		<bitfield id="PHY_WDQLVL_DQDM_TE_DLY_OBS_1" width="11" begin="26" end="16" resetval="0x2047" description="Observation register containing write data leveling data window trailing edge slave delay setting for slice 1. READ-ONLY" range="26 - 16" rwaccess="R"/> 
		<bitfield id="PHY_WDQLVL_DQDM_LE_DLY_OBS_1" width="11" begin="10" end="0" resetval="0x0" description="Observation register containing write data leveling data window leading edge slave delay setting for slice 1. READ-ONLY" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_315" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_315" offset="0x44EC" width="32" description="">
		<bitfield id="PHY_WDQLVL_STATUS_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing write data leveling status for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
