IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_316" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_316" offset="0x44F0" width="32" description="">
		<bitfield id="PHY_WDQLVL_PERIODIC_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing periodic write data leveling status for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_317" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_317" offset="0x44F4" width="32" description="">
		<bitfield id="PHY_DDL_MODE_1" width="31" begin="30" end="0" resetval="0x0" description="DDL mode for slice 1." range="30 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_318" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_318" offset="0x44F8" width="32" description="">
		<bitfield id="PHY_DDL_MASK_1" width="6" begin="5" end="0" resetval="0x0" description="DDL mask for slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_319" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_319" offset="0x44FC" width="32" description="">
		<bitfield id="PHY_DDL_TEST_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="DDL test observation for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_320" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_320" offset="0x4500" width="32" description="">
		<bitfield id="PHY_DDL_TEST_MSTR_DLY_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="DDL test observation delays for slice 1 master DDL. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_321" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_321" offset="0x4504" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ0_1" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ0 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_WDQS_OE_EXTEND_1" width="1" begin="8" end="8" resetval="0x0" description="LPDDR4 write preamble extension enable for slice 1." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_DDL_TRACK_UPD_THRESHOLD_1" width="8" begin="7" end="0" resetval="0x0" description="Specify threshold value for PHY init update tracking for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_322" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_322" offset="0x4508" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ2_1" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ2 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ1_1" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ1 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_323" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_323" offset="0x450C" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ4_1" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ4 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ3_1" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ3 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_324" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_324" offset="0x4510" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ6_1" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for DQ6 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQ5_1" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ5 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_325" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_325" offset="0x4514" width="32" description="">
		<bitfield id="PHY_RX_CAL_DQ7_1" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQ7 for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_326" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_326" offset="0x4518" width="32" description="">
		<bitfield id="PHY_RX_CAL_DM_1" width="18" begin="17" end="0" resetval="0x0" description="RX Calibration codes for DM for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_327" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_327" offset="0x451C" width="32" description="">
		<bitfield id="PHY_RX_CAL_FDBK_1" width="9" begin="24" end="16" resetval="0x0" description="RX Calibration codes for FDBK for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_CAL_DQS_1" width="9" begin="8" end="0" resetval="0x0" description="RX Calibration codes for DQS for slice 1. Bits [5:0] contain rx_cal_code_down. Bits [11:6] contain rx_cal_code_up. Bits [17:12] contain rx_cal_code2_down. Bits [23:18] contain rx_cal_code2_up." range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_328" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_328" offset="0x4520" width="32" description="">
		<bitfield id="PHY_FDBK_PWR_CTRL_1" width="3" begin="26" end="24" resetval="0x0" description="Shutoff gate feedback IO to reduce power for slice 1." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_STATIC_TOG_DISABLE_1" width="5" begin="20" end="16" resetval="0x0" description="Control to disable toggle during static activity for slice 1. bit0: Write path delay line disable; bit1: Read path delay line disable; bit2: Read data path disable; bit3: clk_phy disable; bit4: master delay line disable." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_BIAS_EN_1" width="11" begin="10" end="0" resetval="0x0" description="Controls RX_BIAS_EN pin for each pad for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_329" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_329" offset="0x4524" width="32" description="">
		<bitfield id="PHY_SLICE_PWR_RDC_DISABLE_1" width="1" begin="24" end="24" resetval="0x0" description="Data slice power reduction disable for slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_DCC_RXCAL_CTRL_GATE_DISABLE_1" width="1" begin="16" end="16" resetval="0x0" description="Data slice RX_CAL block power reduction disable for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDPATH_GATE_DISABLE_1" width="1" begin="8" end="8" resetval="0x0" description="Data slice read path power reduction disable for slice 1." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_SLV_DLY_CTRL_GATE_DISABLE_1" width="1" begin="0" end="0" resetval="0x0" description="Data slice slv_dly_control block power reduction disable for slice 1." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_330" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_330" offset="0x4528" width="32" description="">
		<bitfield id="PHY_DQS_TSEL_ENABLE_1" width="3" begin="26" end="24" resetval="0x0" description="Operation type tsel enables for DQS signals for slice 1. Bit [0] enables tsel_en during read cycles. Bit [1] enables tsel_en during write cycles. Bit [2] enables tsel_en during idle cycles. Set each bit to 1 to enable." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_SELECT_1" width="16" begin="23" end="8" resetval="0x0" description="Operation type tsel select values for DQ/DM signals for slice 1." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_ENABLE_1" width="3" begin="2" end="0" resetval="0x0" description="Operation type tsel enables for DQ/DM signals for slice 1. Bit [0] enables tsel_en during read cycles. Bit [1] enables tsel_en during write cycles. Bit [2] enables tsel_en during idle cycles. Set each bit to 1 to enable." range="2 - 0" rwaccess="R/W"/>
	</register>
