IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_331" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_331" offset="0x452C" width="32" description="">
		<bitfield id="PHY_VREF_INITIAL_START_POINT_1" width="7" begin="30" end="24" resetval="0x0" description="Data slice initial VREF training start value for slice 1." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_TWO_CYC_PREAMBLE_1" width="2" begin="17" end="16" resetval="0x0" description="2 cycle preamble support for slice 1. Bit [0] controls the 2 cycle read preamble. Bit [1] controls the 2 cycle write preamble. Set each bit to 1 to enable." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_TSEL_SELECT_1" width="16" begin="15" end="0" resetval="0x0" description="Operation type tsel select values for DQS signals for slice 1." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_332" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_332" offset="0x4530" width="32" description="">
		<bitfield id="PHY_NTP_WDQ_STEP_SIZE_1" width="8" begin="31" end="24" resetval="0x0" description="Step size of WR DQ slave delay during No-Topology training for slice 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_TRAIN_EN_1" width="1" begin="16" end="16" resetval="0x0" description="Enable for No-Topology training for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_TRAINING_CTRL_1" width="2" begin="9" end="8" resetval="0x0" description="Data slice vref training enable control for slice 1." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_INITIAL_STOP_POINT_1" width="7" begin="6" end="0" resetval="0x0" description="Data slice initial VREF training stop value for slice 1." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_333" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_333" offset="0x4534" width="32" description="">
		<bitfield id="PHY_NTP_WDQ_STOP_1" width="11" begin="26" end="16" resetval="0x0" description="End of WR DQ slave delay in No-Topology training for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WDQ_START_1" width="11" begin="10" end="0" resetval="0x0" description="Starting WR DQ slave delay in No-Topology training for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_334" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_334" offset="0x4538" width="32" description="">
		<bitfield id="PHY_SW_WDQLVL_DVW_MIN_EN_1" width="1" begin="24" end="24" resetval="0x0" description="SW override to enable use of PHY_WDQLVL_DVW_MIN for slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DVW_MIN_1" width="10" begin="17" end="8" resetval="0x0" description="Minimum data valid window across DQs and ranks for slice 1." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WDQ_BIT_EN_1" width="8" begin="7" end="0" resetval="0x0" description="Enable Bit for WR DQ during No-Topology training for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_335" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_335" offset="0x453C" width="32" description="">
		<bitfield id="PHY_PAD_RX_DCD_0_1" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_TX_DCD_1" width="5" begin="20" end="16" resetval="0x0" description="Controls TX_DCD pin for each pad for slice 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_FAST_LVL_EN_1" width="4" begin="11" end="8" resetval="0x0" description="Enable for fast multi-pattern window search for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_PER_START_OFFSET_1" width="6" begin="5" end="0" resetval="0x0" description="Peridic training start point offset for slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_336" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_336" offset="0x4540" width="32" description="">
		<bitfield id="PHY_PAD_RX_DCD_4_1" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_3_1" width="5" begin="20" end="16" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_2_1" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_1_1" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_337" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_337" offset="0x4544" width="32" description="">
		<bitfield id="PHY_PAD_DM_RX_DCD_1" width="5" begin="28" end="24" resetval="0x0" description="Controls RX_DCD pin for dm pad for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_7_1" width="5" begin="20" end="16" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_6_1" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_RX_DCD_5_1" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for each pad for slice 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_338" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_338" offset="0x4548" width="32" description="">
		<bitfield id="PHY_PAD_DSLICE_IO_CFG_1" width="7" begin="22" end="16" resetval="0x0" description="Controls PCLK/PARK pin for pad for slice 1." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_FDBK_RX_DCD_1" width="5" begin="12" end="8" resetval="0x0" description="Controls RX_DCD pin for fdbk pad for slice 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_DQS_RX_DCD_1" width="5" begin="4" end="0" resetval="0x0" description="Controls RX_DCD pin for dqs pad for slice 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_339" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_339" offset="0x454C" width="32" description="">
		<bitfield id="PHY_RDDQ1_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQ1 slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ0_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DQ0 slave delay setting for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_340" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_340" offset="0x4550" width="32" description="">
		<bitfield id="PHY_RDDQ3_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQ3 slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ2_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DQ2 slave delay setting for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_341" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_341" offset="0x4554" width="32" description="">
		<bitfield id="PHY_RDDQ5_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQ5 slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ4_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DQ4 slave delay setting for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_342" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_342" offset="0x4558" width="32" description="">
		<bitfield id="PHY_RDDQ7_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQ7 slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQ6_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DQ6 slave delay setting for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_343" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_343" offset="0x455C" width="32" description="">
		<bitfield id="PHY_RX_CAL_ALL_DLY_1" width="5" begin="28" end="24" resetval="0x0" description="Defines the number of cycles/half cycles that the rx_cal_all_opad signal should be asserted for. There is a phy_rx_cal_all_dly_X parameter for each of the slices of data sent on the DFI data bus for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RX_PCLK_CLK_SEL_1" width="3" begin="18" end="16" resetval="0x0" description="RX_PCLK clock frequency selection for slice 1." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDM_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Read DM/DBI slave delay setting for slice 1. May be used for data swap." range="9 - 0" rwaccess="R/W"/>
	</register>
