IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_344" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_344" offset="0x4560" width="32" description="">
		<bitfield id="PHY_DQS_OE_TIMING_1" width="8" begin="31" end="24" resetval="0x0" description="Start/end timing values for DQS output enable signals for slice 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_WR_TIMING_1" width="8" begin="23" end="16" resetval="0x0" description="Start/end timing values for DQ/DM write based termination enable and select signals for slice 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_TSEL_RD_TIMING_1" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQ/DM read based termination enable and select signals for slice 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_OE_TIMING_1" width="8" begin="7" end="0" resetval="0x0" description="Start/end timing values for DQ/DM output enable signals for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_345" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_345" offset="0x4564" width="32" description="">
		<bitfield id="PHY_DQS_TSEL_WR_TIMING_1" width="8" begin="31" end="24" resetval="0x0" description="Start/end timing values for DQS write based termination enable and select signals for slice 1." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_OE_RD_TIMING_1" width="8" begin="23" end="16" resetval="0x0" description="Start/end timing values for DQS read based OE extension for slice 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_TSEL_RD_TIMING_1" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQS read based termination enable and select signals for slice 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_IO_PAD_DELAY_TIMING_1" width="4" begin="3" end="0" resetval="0x0" description="Feedback pad's OPAD and IPAD delay timing for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_346" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_346" offset="0x4568" width="32" description="">
		<bitfield id="PHY_PAD_VREF_CTRL_DQ_1" width="12" begin="27" end="16" resetval="0x0" description="Pad VREF control settings for DQ slice 1." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_VREF_SETTING_TIME_1" width="16" begin="15" end="0" resetval="0x0" description="Number of cycles for vref settle after setting is changed for slice 1." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_347" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_347" offset="0x456C" width="32" description="">
		<bitfield id="PHY_IE_MODE_1" width="2" begin="25" end="24" resetval="0x0" description="Input enable mode bits for slice 1. Bit [0] enables the mode where the input enables are always on; set to 1 to enable. Bit [1] disables the input enable on the DM signal; set to 1 to disable." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_IE_DLY_1" width="2" begin="17" end="16" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for input enable generation for slice 1." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DQS_IE_TIMING_1" width="8" begin="15" end="8" resetval="0x0" description="Start/end timing values for DQS input enable signals for slice 1." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DQ_IE_TIMING_1" width="8" begin="7" end="0" resetval="0x0" description="Start/end timing values for DQ/DM input enable signals for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_348" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_348" offset="0x4570" width="32" description="">
		<bitfield id="PHY_WDQLVL_RDDATA_EN_TSEL_DLY_1" width="5" begin="28" end="24" resetval="0x0" description="For WR DQ training, the number of cycles that the dfi_rddata_en signal is earlier than necessary for TSEL enable generation for slice 1." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_RDDATA_EN_DLY_1" width="5" begin="20" end="16" resetval="0x0" description="For WR DQ training, the number of cycles that the dfi_rddata_en signal is early for slice 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_IE_ON_1" width="1" begin="8" end="8" resetval="0x0" description="IE control, 1 meams IE is always on during WR DQ training for slice 1." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_DBI_MODE_1" width="2" begin="1" end="0" resetval="0x0" description="DBI mode for slice 1. Bit [0] enables return of DBI read data." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_349" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_349" offset="0x4574" width="32" description="">
		<bitfield id="PHY_SW_MASTER_MODE_1" width="4" begin="19" end="16" resetval="0x0" description="Master delay line override settings for slice 1. Bit [0] enables software half clock mode. Bit [1] is the software half clock mode value. Bit [2] enables software bypass mode. Bit [3] is the software bypass mode value." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_OE_DLY_1" width="5" begin="12" end="8" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for LP4 OE extension generation for slice 1." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDATA_EN_TSEL_DLY_1" width="5" begin="4" end="0" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is earlier than necessary for TSEL enable generation for slice 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_350" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_350" offset="0x4578" width="32" description="">
		<bitfield id="PHY_MASTER_DELAY_WAIT_1" width="8" begin="31" end="24" resetval="0x0" description="Wait cycles for master delay line locking algorithm for slice 1. Bits [3:0] are the cycle wait count after a calibration clock setting change. Bits [7:4] are the cycle wait count after a master delay setting change." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_MASTER_DELAY_STEP_1" width="6" begin="21" end="16" resetval="0x0" description="Incremental step size for master delay line locking algorithm for slice 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_MASTER_DELAY_START_1" width="11" begin="10" end="0" resetval="0x0" description="Start value for master delay line locking algorithm for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
