IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_351" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_351" offset="0x457C" width="32" description="">
		<bitfield id="PHY_WRLVL_DLY_FINE_STEP_1" width="4" begin="27" end="24" resetval="0x0" description="DQS slave delay fine step size during write leveling for slice 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_DLY_STEP_1" width="8" begin="23" end="16" resetval="0x0" description="DQS slave delay step size during write leveling for slice 1." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RPTR_UPDATE_1" width="4" begin="11" end="8" resetval="0x0" description="Offset in cycles from the dfi_rddata_en signal to release data from the entry FIFO for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_MASTER_DELAY_HALF_MEASURE_1" width="8" begin="7" end="0" resetval="0x0" description="Defines the number of delay line elements to be considered in determing whether to lock to a half clock cycle in the data slice master for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_352" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_352" offset="0x4580" width="32" description="">
		<bitfield id="PHY_GTLVL_RESP_WAIT_CNT_1" width="5" begin="20" end="16" resetval="0x0" description="Number of cycles + 4 to wait between dfi_rddata_en and the sampling of the DQS during gate training for slice 1. The valid range is 0x0 to 0xB." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_DLY_STEP_1" width="4" begin="11" end="8" resetval="0x0" description="DQS slave delay step size during gate training for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_RESP_WAIT_CNT_1" width="6" begin="5" end="0" resetval="0x0" description="Number of cycles to wait between dfi_wrlvl_strobe and the sampling of the DQs during write leveling for slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_353" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_353" offset="0x4584" width="32" description="">
		<bitfield id="PHY_GTLVL_FINAL_STEP_1" width="10" begin="25" end="16" resetval="0x0" description="Final backup step delay used in gate training algorithm for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_BACK_STEP_1" width="10" begin="9" end="0" resetval="0x0" description="Interim backup step delay used in gate training algorithm for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_354" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_354" offset="0x4588" width="32" description="">
		<bitfield id="PHY_WDQLVL_DM_SEARCH_RANGE_1" width="9" begin="24" end="16" resetval="0x0" description="The dm slave delay search range for non-lpddr4 DM training for slice 1." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_QTR_DLY_STEP_1" width="4" begin="11" end="8" resetval="0x0" description="Defines the step granularity for the logic to use once an edge is found for slice 1. When this occurs, the logic jumps back to the previous invalid value and uses this step size to determine a more accurate delay value." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DLY_STEP_1" width="8" begin="7" end="0" resetval="0x0" description="DQ slave delay step size during write data leveling for slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_355" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_355" offset="0x458C" width="32" description="">
		<bitfield id="PHY_RDLVL_DLY_STEP_1" width="4" begin="11" end="8" resetval="0x0" description="DQS slave delay step size during read leveling for slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_TOGGLE_PRE_SUPPORT_1" width="1" begin="0" end="0" resetval="0x0" description="Support the toggle read preamble for LPDDR4 for slice 1." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_356" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_356" offset="0x4590" width="32" description="">
		<bitfield id="PHY_RDLVL_MAX_EDGE_1" width="10" begin="9" end="0" resetval="0x0" description="The maximun rdlvl slave delay search window for read eye training for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_357" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_357" offset="0x4594" width="32" description="">
		<bitfield id="PHY_MEAS_DLY_STEP_ENABLE_1" width="7" begin="30" end="24" resetval="0x0" description="Data slice training step definition using phy_meas_dly_step_value for slice 1." range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQ_OSC_DELTA_1" width="7" begin="22" end="16" resetval="0x0" description=" Slave delay offset that applies to a 1 bit change of dfi_wdq_osc_code for slice 1." range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WRPATH_GATE_TIMING_1" width="3" begin="10" end="8" resetval="0x0" description="Write path clock gating timing for slice 1. it means additional clock number to write path clock gate" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRPATH_GATE_DISABLE_1" width="2" begin="1" end="0" resetval="0x0" description="Write path clock gating disable for slice 1. [0]: disable pull in wrdata_en; [1]: disable write path clock gating, clock always on" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_358" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_358" offset="0x4598" width="32" description="">
		<bitfield id="PHY_RDDATA_EN_DLY_1" width="5" begin="4" end="0" resetval="0x0" description="Number of cycles that the dfi_rddata_en signal is early for slice 1." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_359" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_359" offset="0x459C" width="32" description="">
		<bitfield id="PHY_DQ_DM_SWIZZLE0_1" width="32" begin="31" end="0" resetval="0x0" description="DQ/DM bit swizzling 0 for slice 1. Bits [3:0] inform the PHY which bit in {DM,DQ]} map to DQ0, Bits [7:4] inform the PHY which bit in {DM,DQ} map to DQ1, etc." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_360" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_360" offset="0x45A0" width="32" description="">
		<bitfield id="PHY_DQ_DM_SWIZZLE1_1" width="4" begin="3" end="0" resetval="0x0" description="DQ/DM bit swizzling 1 for slice 1. Bits [3:0] inform the PHY which bit in {DM,DQ]} map to DM." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_361" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_361" offset="0x45A4" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ1_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ1 for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ0_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ0 for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
