IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_362" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_362" offset="0x45A8" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ3_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ3 for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ2_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ2 for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_363" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_363" offset="0x45AC" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ5_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ5 for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ4_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ4 for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_364" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_364" offset="0x45B0" width="32" description="">
		<bitfield id="PHY_CLK_WRDQ7_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Write clock slave delay setting for DQ7 for slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDQ6_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DQ6 for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_365" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_365" offset="0x45B4" width="32" description="">
		<bitfield id="PHY_CLK_WRDQS_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Write clock slave delay setting for DQS for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CLK_WRDM_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Write clock slave delay setting for DM for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_366" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_366" offset="0x45B8" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ0_RISE_SLAVE_DELAY_1" width="10" begin="17" end="8" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ0 for slice 1." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_THRESHOLD_ADJUST_1" width="2" begin="1" end="0" resetval="0x0" description="Write level threshold adjust value based on those thresholds for DQS for slice 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_367" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_367" offset="0x45BC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ1_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ1 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ0_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ0 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_368" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_368" offset="0x45C0" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ2_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ2 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ1_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ1 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_369" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_369" offset="0x45C4" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ3_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ3 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ2_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ2 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_370" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_370" offset="0x45C8" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ4_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ4 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ3_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ3 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_371" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_371" offset="0x45CC" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ5_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ5 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ4_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ4 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_372" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_372" offset="0x45D0" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ6_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ6 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ5_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ5 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_373" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_373" offset="0x45D4" width="32" description="">
		<bitfield id="PHY_RDDQS_DQ7_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DQ7 for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ6_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ6 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_374" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_374" offset="0x45D8" width="32" description="">
		<bitfield id="PHY_RDDQS_DM_RISE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Rising edge read DQS slave delay setting for DM for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DQ7_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DQ7 for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_375" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_375" offset="0x45DC" width="32" description="">
		<bitfield id="PHY_RDDQS_GATE_SLAVE_DELAY_1" width="10" begin="25" end="16" resetval="0x0" description="Read DQS slave delay setting for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_DM_FALL_SLAVE_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Falling edge read DQS slave delay setting for DM for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_376" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_376" offset="0x45E0" width="32" description="">
		<bitfield id="PHY_WRLVL_DELAY_EARLY_THRESHOLD_1" width="10" begin="25" end="16" resetval="0x0" description="Write level delay threshold above which will be considered in previous cycle for slice 1." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WRITE_PATH_LAT_ADD_1" width="3" begin="10" end="8" resetval="0x0" description="Number of cycles to delay the incoming dfi_wrdata_en/dfi_wrdata signals for slice 1." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_RDDQS_LATENCY_ADJUST_1" width="4" begin="3" end="0" resetval="0x0" description="Number of cycles to delay the incoming dfi_rddata_en for read DQS gate generation for slice 1." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_377" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_377" offset="0x45E4" width="32" description="">
		<bitfield id="PHY_WRLVL_EARLY_FORCE_ZERO_1" width="1" begin="16" end="16" resetval="0x0" description="Force the final write level delay value [that meets the early threshold] to 0 for slice 1." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_WRLVL_DELAY_PERIOD_THRESHOLD_1" width="10" begin="9" end="0" resetval="0x0" description="Write level delay threshold below which will add a cycle of write path latency for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_378" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_378" offset="0x45E8" width="32" description="">
		<bitfield id="PHY_GTLVL_LAT_ADJ_START_1" width="4" begin="19" end="16" resetval="0x0" description="Initial read DQS gate cycle delay from dfi_rddata_en during gate training for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GTLVL_RDDQS_SLV_DLY_START_1" width="10" begin="9" end="0" resetval="0x0" description="Initial read DQS gate slave delay setting during gate training for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
