IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_379" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_379" offset="0x45EC" width="32" description="">
		<bitfield id="PHY_NTP_PASS_1" width="1" begin="24" end="24" resetval="0x0" description="Indicates if No-topology training found a passing result for slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_NTP_WRLAT_START_1" width="4" begin="19" end="16" resetval="0x0" description="Initial value for phy_write_path_lat_add for No-topology training and early threshold for slice 1." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_WDQLVL_DQDM_SLV_DLY_START_1" width="11" begin="10" end="0" resetval="0x0" description="Initial DQ/DM slave delay setting during write data leveling for slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_380" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_380" offset="0x45F0" width="32" description="">
		<bitfield id="PHY_RDLVL_RDDQS_DQ_SLV_DLY_START_1" width="10" begin="9" end="0" resetval="0x0" description="Read leveling starting value for the DQS/DQ slave delay settings for slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_381" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_381" offset="0x45F4" width="32" description="">
		<bitfield id="PHY_DSLICE_PAD_RX_CTLE_SETTING_1" width="6" begin="21" end="16" resetval="0x0" description="Setting for RX ctle P/N of pad for slice 1." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_DSLICE_PAD_BOOSTPN_SETTING_1" width="16" begin="15" end="0" resetval="0x0" description="Setting for boost P/N of pad for slice 1." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_512" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_512" offset="0x4800" width="32" description="">
		<bitfield id="SC_PHY_ADR_MANUAL_CLEAR_0" width="3" begin="26" end="24" resetval="0x0" description="Manual reset/clear of internal logic for address slice 0. Bit [0] is reset of master delay min/max lock values. Bit [1] is manual reset of master delay unlock counter. Bit [2] clears the loopback error/results registers. Set each bit to 1 to reset. WRITE-ONLY" range="26 - 24" rwaccess="W"/> 
		<bitfield id="PHY_ADR_CLK_BYPASS_OVERRIDE_0" width="1" begin="16" end="16" resetval="0x0" description="Bypass mode override setting for address slice 0. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CLK_WR_BYPASS_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Command/Address clock bypass mode slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_513" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_513" offset="0x4804" width="32" description="">
		<bitfield id="PHY_ADR_LPBK_RESULT_OBS_0" width="32" begin="31" end="0" resetval="0x4096" description="Observation register containing loopback status/results for address slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_514" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_514" offset="0x4808" width="32" description="">
		<bitfield id="PHY_ADR_MASTER_DLY_LOCK_OBS_SELECT_0" width="4" begin="27" end="24" resetval="0x0" description="Select value to map the internal master delay observation registers to the accessible master delay observation register for address slice 0." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MEAS_DLY_STEP_VALUE_0" width="8" begin="23" end="16" resetval="0x0" description="Contains the fraction of a cycle in 1 delay element numerator with demominator of 512, for address slice 0. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_LPBK_ERROR_COUNT_OBS_0" width="16" begin="15" end="0" resetval="0x0" description="Observation register containing total number of loopback error data for address slice 0. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_515" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_515" offset="0x480C" width="32" description="">
		<bitfield id="PHY_ADR_ADDER_SLV_DLY_ENC_OBS_0" width="8" begin="31" end="24" resetval="0x0" description="Observation register containing addr slave delay for address slice 0. READ-ONLY" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PHY_ADR_BASE_SLV_DLY_ENC_OBS_0" width="7" begin="22" end="16" resetval="0x0" description="Observation register containing base slave delay for address slice 0. READ-ONLY" range="22 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_MASTER_DLY_LOCK_OBS_0" width="11" begin="10" end="0" resetval="0x0" description="Observation register containing master delay results for address slice 0. READ-ONLY" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_516" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_516" offset="0x4810" width="32" description="">
		<bitfield id="PHY_ADR_TSEL_ENABLE_0" width="1" begin="24" end="24" resetval="0x0" description="Enables tsel_en for address slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_SNAP_OBS_REGS_0" width="1" begin="16" end="16" resetval="0x0" description="Initiates a snapshot of the internal observation registers for address slice 0. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_ENC_OBS_SELECT_0" width="3" begin="10" end="8" resetval="0x0" description="Select value to map the addr bits delay observation registers to the accessible delay observation register for address slice 0." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLAVE_LOOP_CNT_UPDATE_0" width="3" begin="2" end="0" resetval="0x0" description="Reserved for address slice 0." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_517" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_517" offset="0x4814" width="32" description="">
		<bitfield id="PHY_ADR_PWR_RDC_DISABLE_0" width="1" begin="24" end="24" resetval="0x0" description="Power reduction disable for address slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_MASK_0" width="5" begin="20" end="16" resetval="0x0" description="PRBS7 mask signal for address slice 0." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_START_0" width="7" begin="14" end="8" resetval="0x1" description="PRBS7 start pattern for address slice 0." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LPBK_CONTROL_0" width="7" begin="6" end="0" resetval="0x0" description="Loopback control bits for address slice 0." range="6 - 0" rwaccess="R/W"/>
	</register>
