IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_518" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_518" offset="0x4818" width="32" description="">
		<bitfield id="PHY_ADR_IE_MODE_0" width="1" begin="24" end="24" resetval="0x0" description="Input enable control for address slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_WRADDR_SHIFT_OBS_0" width="3" begin="18" end="16" resetval="0x0" description="Observation register containing automatic half cycle and cycle shift values for address slice 0. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_TYPE_0" width="2" begin="9" end="8" resetval="0x0" description="DRAM type for address slice 0." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_CTRL_GATE_DISABLE_0" width="1" begin="0" end="0" resetval="0x0" description="Power reduction slv_dly_control block gate disable for address slice 0." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_519" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_519" offset="0x481C" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MODE_0" width="27" begin="26" end="0" resetval="0x0" description="DDL mode for address slice 0." range="26 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_520" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_520" offset="0x4820" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MASK_0" width="6" begin="5" end="0" resetval="0x0" description="DDL mask for address slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_521" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_521" offset="0x4824" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing DDL test bits for address slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_522" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_522" offset="0x4828" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_MSTR_DLY_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing master DDL bits for address slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_523" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_523" offset="0x482C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_COARSE_DLY_0" width="11" begin="26" end="16" resetval="0x0" description="Coarse CA training DDL increment value for address slice 0." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_START_0" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL start value for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_524" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_524" offset="0x4830" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_QTR_0" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL quarter cycle delay value for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_525" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_525" offset="0x4834" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_SWIZZLE0_0" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 0 for address slice 0." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_526" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_526" offset="0x4838" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_RANK_CTRL_0" width="2" begin="25" end="24" resetval="0x0" description="CA training rank aggregation control bits for address slice 0." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_SWIZZLE1_0" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 1 for address slice 0." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_527" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_527" offset="0x483C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_PERIODIC_START_OFFSET_0" width="9" begin="24" end="16" resetval="0x0" description="Relative offset to start periodic CALVL from previous result" range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_RESP_WAIT_CNT_0" width="4" begin="11" end="8" resetval="0x0" description="Number of samples to wait before sampling response during CA training for address slice 0." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_NUM_PATTERNS_0" width="2" begin="1" end="0" resetval="0x0" description="Number of patterns to use during CA training for address slice 0." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_528" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_528" offset="0x4840" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS_SELECT_0" width="3" begin="26" end="24" resetval="0x0" description="CA bit lane to observe result from OBS0 during CA training for address slice 0." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_ERROR_CLR_0" width="1" begin="16" end="16" resetval="0x0" description="Clears the CA training state machine error status for address slice 0. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_DEBUG_CONT_0" width="1" begin="8" end="8" resetval="0x0" description="Allows the CA training state machine to advance [when in debug mode] for address slice 0. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_ADR_CALVL_DEBUG_MODE_0" width="1" begin="0" end="0" resetval="0x0" description="Enables CA training debug mode for address slice 0. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_529" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_529" offset="0x4844" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS0_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains lane specific CA training bits for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_530" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_530" offset="0x4848" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS1_0" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains general CA training bits for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_531" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_531" offset="0x484C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS2_0" width="32" begin="31" end="0" resetval="0x256" description="Observation register contains periodic CA training bits for slice 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_532" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_532" offset="0x4850" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_0_0" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 0 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_533" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_533" offset="0x4854" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_0_0" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 0 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_534" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_534" offset="0x4858" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_1_0" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 1 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_535" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_535" offset="0x485C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_1_0" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 1 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
