IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_536" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_536" offset="0x4860" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_2_0" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 2 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_537" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_537" offset="0x4864" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_2_0" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 2 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_538" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_538" offset="0x4868" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_3_0" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 3 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_539" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_539" offset="0x486C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_3_0" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 3 for address slice 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_540" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_540" offset="0x4870" width="32" description="">
		<bitfield id="PHY_ADR_ADDR_SEL_0" width="30" begin="29" end="0" resetval="0x0" description="Selects which DFI address pins connect to which CA pins for LPDDR3/4 for address slice 0." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_541" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_541" offset="0x4874" width="32" description="">
		<bitfield id="PHY_ADR_SEG_MASK_0" width="6" begin="29" end="24" resetval="0x0" description="Segment mask bit for address slice 0. Set to 1 to indicate that the bit is either CA 4 or CA 9." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_BIT_MASK_0" width="6" begin="21" end="16" resetval="0x0" description="Mask bit for address slice 0. Set to 1 to indicate that the bit is used." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LP4_BOOT_SLV_DELAY_0" width="10" begin="9" end="0" resetval="0x0" description="Address slave delay setting during the LPDDR4 boot frequency operation for address slice 0." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_542" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_542" offset="0x4878" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXIO_CTRL_0" width="6" begin="29" end="24" resetval="0x0" description="Controls address pad output enable for address slice 0. Set to 1 to disable output enable." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_STATIC_TOG_DISABLE_0" width="4" begin="19" end="16" resetval="0x0" description="Toggle control during static activity for address slice 0. Set bit to dsiable toggling, bit0: Write path delay line, bit1: Read path delay line, bit2: Read data path, bit3: clk_phy, bit4: master delay line." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CSLVL_TRAIN_MASK_0" width="6" begin="13" end="8" resetval="0x0" description="Mask bit for CS training participation for address slice 0. Set to 1 to indicate that the bit is participating in CS training." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_TRAIN_MASK_0" width="6" begin="5" end="0" resetval="0x0" description="Mask bit for CA training participation for address slice 0. Set to 1 to indicate that the bit is participating in CA training." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_543" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_543" offset="0x487C" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXPWR_CTRL_0" width="6" begin="5" end="0" resetval="0x0" description="Disable address output enables in deep sleep mode for address slice 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_544" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_544" offset="0x4880" width="32" description="">
		<bitfield id="PHY_PAD_ADR_RX_PCLK_CLK_SEL_0" width="3" begin="26" end="24" resetval="0x0" description="Reserved for address slice 0." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_ADR_IO_CFG_0" width="11" begin="18" end="8" resetval="0x0" description="Controls I/O pads for address pad for address slice 0. Bits [10:5] = Park value, bits [4] park override, bits [2:0] clk divider." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_TSEL_SELECT_0" width="8" begin="7" end="0" resetval="0x0" description="Tsel select values for address slice 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_545" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_545" offset="0x4884" width="32" description="">
		<bitfield id="PHY_ADR1_SW_WRADDR_SHIFT_0" width="5" begin="28" end="24" resetval="0x0" description="Manual override of CA bit 1 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_CLK_WR_SLAVE_DELAY_0" width="11" begin="18" end="8" resetval="0x0" description="CA bit 0 slave delay setting for address slice 0." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_SW_WRADDR_SHIFT_0" width="5" begin="4" end="0" resetval="0x0" description="Manual override of CA bit 0 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_546" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_546" offset="0x4888" width="32" description="">
		<bitfield id="PHY_ADR2_SW_WRADDR_SHIFT_0" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 2 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR1_CLK_WR_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="CA bit 1 slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
