IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_547" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_547" offset="0x488C" width="32" description="">
		<bitfield id="PHY_ADR3_SW_WRADDR_SHIFT_0" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 3 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR2_CLK_WR_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="CA bit 2 slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_548" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_548" offset="0x4890" width="32" description="">
		<bitfield id="PHY_ADR4_SW_WRADDR_SHIFT_0" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 4 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR3_CLK_WR_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="CA bit 3 slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_549" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_549" offset="0x4894" width="32" description="">
		<bitfield id="PHY_ADR5_SW_WRADDR_SHIFT_0" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 5 of automatic half_cycle_shift/cycle_shift for address slice 0. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR4_CLK_WR_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="CA bit 4 slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_550" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_550" offset="0x4898" width="32" description="">
		<bitfield id="PHY_ADR_SW_MASTER_MODE_0" width="4" begin="19" end="16" resetval="0x0" description="Master delay line override settings for address slice 0. Bit [0] enables software half clock mode. Bit [1] is the software half clock mode value. Bit [2] enables software bypass mode. Bit [3] is the software bypass mode value." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR5_CLK_WR_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="CA bit 5 slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_551" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_551" offset="0x489C" width="32" description="">
		<bitfield id="PHY_ADR_MASTER_DELAY_WAIT_0" width="8" begin="31" end="24" resetval="0x0" description="Wait cycles for master delay line locking algorithm for address slice 0. Bits [3:0] is the cycle wait count after a calibration clock setting change. Bits [7:4] is the cycle wait count after a master delay setting change." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_STEP_0" width="6" begin="21" end="16" resetval="0x0" description="Incremental step size for master delay line locking algorithm for address slice 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_START_0" width="11" begin="10" end="0" resetval="0x0" description="Start value for master delay line locking algorithm for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_552" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_552" offset="0x48A0" width="32" description="">
		<bitfield id="PHY_ADR_SW_CALVL_DVW_MIN_EN_0" width="1" begin="24" end="24" resetval="0x0" description="Enables the software override data valid window size during CA training for address slice 0." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SW_CALVL_DVW_MIN_0" width="10" begin="17" end="8" resetval="0x0" description="Sets the software override data valid window size during CA training for address slice 0." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_HALF_MEASURE_0" width="8" begin="7" end="0" resetval="0x0" description="Defines the number of delay line elements to be considered in determing whether to lock to a half clock cycle for the master in address slice 0" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_553" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_553" offset="0x48A4" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_DLY_STEP_0" width="4" begin="3" end="0" resetval="0x0" description="Sets the delay step size plus 1 during CA training for address slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_554" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_554" offset="0x48A8" width="32" description="">
		<bitfield id="PHY_ADR_MEAS_DLY_STEP_ENABLE_0" width="1" begin="8" end="8" resetval="0x0" description="Enables delay parameter setting using phy_adr_meas_dly_step_value for address slice 0." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_CAPTURE_CNT_0" width="4" begin="3" end="0" resetval="0x0" description="Number of samples to take at each ADDR slave delay setting during CA training for address slice 0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_768" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_768" offset="0x4C00" width="32" description="">
		<bitfield id="SC_PHY_ADR_MANUAL_CLEAR_1" width="3" begin="26" end="24" resetval="0x0" description="Manual reset/clear of internal logic for address slice 1. Bit [0] is reset of master delay min/max lock values. Bit [1] is manual reset of master delay unlock counter. Bit [2] clears the loopback error/results registers. Set each bit to 1 to reset. WRITE-ONLY" range="26 - 24" rwaccess="W"/> 
		<bitfield id="PHY_ADR_CLK_BYPASS_OVERRIDE_1" width="1" begin="16" end="16" resetval="0x0" description="Bypass mode override setting for address slice 1. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CLK_WR_BYPASS_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Command/Address clock bypass mode slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_769" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_769" offset="0x4C04" width="32" description="">
		<bitfield id="PHY_ADR_LPBK_RESULT_OBS_1" width="32" begin="31" end="0" resetval="0x4096" description="Observation register containing loopback status/results for address slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_770" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_770" offset="0x4C08" width="32" description="">
		<bitfield id="PHY_ADR_MASTER_DLY_LOCK_OBS_SELECT_1" width="4" begin="27" end="24" resetval="0x0" description="Select value to map the internal master delay observation registers to the accessible master delay observation register for address slice 1." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MEAS_DLY_STEP_VALUE_1" width="8" begin="23" end="16" resetval="0x0" description="Contains the fraction of a cycle in 1 delay element numerator with demominator of 512, for address slice 1. READ-ONLY" range="23 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_LPBK_ERROR_COUNT_OBS_1" width="16" begin="15" end="0" resetval="0x0" description="Observation register containing total number of loopback error data for address slice 1. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_771" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_771" offset="0x4C0C" width="32" description="">
		<bitfield id="PHY_ADR_ADDER_SLV_DLY_ENC_OBS_1" width="8" begin="31" end="24" resetval="0x0" description="Observation register containing addr slave delay for address slice 1. READ-ONLY" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PHY_ADR_BASE_SLV_DLY_ENC_OBS_1" width="7" begin="22" end="16" resetval="0x0" description="Observation register containing base slave delay for address slice 1. READ-ONLY" range="22 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_MASTER_DLY_LOCK_OBS_1" width="11" begin="10" end="0" resetval="0x0" description="Observation register containing master delay results for address slice 1. READ-ONLY" range="10 - 0" rwaccess="R"/>
	</register>
