IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_772" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_772" offset="0x4C10" width="32" description="">
		<bitfield id="PHY_ADR_TSEL_ENABLE_1" width="1" begin="24" end="24" resetval="0x0" description="Enables tsel_en for address slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_SNAP_OBS_REGS_1" width="1" begin="16" end="16" resetval="0x0" description="Initiates a snapshot of the internal observation registers for address slice 1. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_ENC_OBS_SELECT_1" width="3" begin="10" end="8" resetval="0x0" description="Select value to map the addr bits delay observation registers to the accessible delay observation register for address slice 1." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLAVE_LOOP_CNT_UPDATE_1" width="3" begin="2" end="0" resetval="0x0" description="Reserved for address slice 1." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_773" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_773" offset="0x4C14" width="32" description="">
		<bitfield id="PHY_ADR_PWR_RDC_DISABLE_1" width="1" begin="24" end="24" resetval="0x0" description="Power reduction disable for address slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_MASK_1" width="5" begin="20" end="16" resetval="0x0" description="PRBS7 mask signal for address slice 1." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_START_1" width="7" begin="14" end="8" resetval="0x1" description="PRBS7 start pattern for address slice 1." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LPBK_CONTROL_1" width="7" begin="6" end="0" resetval="0x0" description="Loopback control bits for address slice 1." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_774" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_774" offset="0x4C18" width="32" description="">
		<bitfield id="PHY_ADR_IE_MODE_1" width="1" begin="24" end="24" resetval="0x0" description="Input enable control for address slice 1." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_WRADDR_SHIFT_OBS_1" width="3" begin="18" end="16" resetval="0x0" description="Observation register containing automatic half cycle and cycle shift values for address slice 1. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_TYPE_1" width="2" begin="9" end="8" resetval="0x0" description="DRAM type for address slice 1." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_CTRL_GATE_DISABLE_1" width="1" begin="0" end="0" resetval="0x0" description="Power reduction slv_dly_control block gate disable for address slice 1." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_775" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_775" offset="0x4C1C" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MODE_1" width="27" begin="26" end="0" resetval="0x0" description="DDL mode for address slice 1." range="26 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_776" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_776" offset="0x4C20" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MASK_1" width="6" begin="5" end="0" resetval="0x0" description="DDL mask for address slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_777" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_777" offset="0x4C24" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing DDL test bits for address slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_778" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_778" offset="0x4C28" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_MSTR_DLY_OBS_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing master DDL bits for address slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_779" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_779" offset="0x4C2C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_COARSE_DLY_1" width="11" begin="26" end="16" resetval="0x0" description="Coarse CA training DDL increment value for address slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_START_1" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL start value for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_780" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_780" offset="0x4C30" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_QTR_1" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL quarter cycle delay value for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_781" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_781" offset="0x4C34" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_SWIZZLE0_1" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 0 for address slice 1." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_782" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_782" offset="0x4C38" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_RANK_CTRL_1" width="2" begin="25" end="24" resetval="0x0" description="CA training rank aggregation control bits for address slice 1." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_SWIZZLE1_1" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 1 for address slice 1." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_783" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_783" offset="0x4C3C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_PERIODIC_START_OFFSET_1" width="9" begin="24" end="16" resetval="0x0" description="Relative offset to start periodic CALVL from previous result" range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_RESP_WAIT_CNT_1" width="4" begin="11" end="8" resetval="0x0" description="Number of samples to wait before sampling response during CA training for address slice 1." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_NUM_PATTERNS_1" width="2" begin="1" end="0" resetval="0x0" description="Number of patterns to use during CA training for address slice 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_784" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_784" offset="0x4C40" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS_SELECT_1" width="3" begin="26" end="24" resetval="0x0" description="CA bit lane to observe result from OBS0 during CA training for address slice 1." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_ERROR_CLR_1" width="1" begin="16" end="16" resetval="0x0" description="Clears the CA training state machine error status for address slice 1. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_DEBUG_CONT_1" width="1" begin="8" end="8" resetval="0x0" description="Allows the CA training state machine to advance [when in debug mode] for address slice 1. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_ADR_CALVL_DEBUG_MODE_1" width="1" begin="0" end="0" resetval="0x0" description="Enables CA training debug mode for address slice 1. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
