IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_785" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_785" offset="0x4C44" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS0_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains lane specific CA training bits for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_786" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_786" offset="0x4C48" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS1_1" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains general CA training bits for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_787" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_787" offset="0x4C4C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS2_1" width="32" begin="31" end="0" resetval="0x256" description="Observation register contains periodic CA training bits for slice 1. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_788" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_788" offset="0x4C50" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_0_1" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 0 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_789" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_789" offset="0x4C54" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_0_1" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 0 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_790" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_790" offset="0x4C58" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_1_1" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 1 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_791" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_791" offset="0x4C5C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_1_1" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 1 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_792" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_792" offset="0x4C60" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_2_1" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 2 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_793" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_793" offset="0x4C64" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_2_1" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 2 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_794" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_794" offset="0x4C68" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_3_1" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 3 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_795" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_795" offset="0x4C6C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_3_1" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 3 for address slice 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_796" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_796" offset="0x4C70" width="32" description="">
		<bitfield id="PHY_ADR_ADDR_SEL_1" width="30" begin="29" end="0" resetval="0x0" description="Selects which DFI address pins connect to which CA pins for LPDDR3/4 for address slice 1." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_797" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_797" offset="0x4C74" width="32" description="">
		<bitfield id="PHY_ADR_SEG_MASK_1" width="6" begin="29" end="24" resetval="0x0" description="Segment mask bit for address slice 1. Set to 1 to indicate that the bit is either CA 4 or CA 9." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_BIT_MASK_1" width="6" begin="21" end="16" resetval="0x0" description="Mask bit for address slice 1. Set to 1 to indicate that the bit is used." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LP4_BOOT_SLV_DELAY_1" width="10" begin="9" end="0" resetval="0x0" description="Address slave delay setting during the LPDDR4 boot frequency operation for address slice 1." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_798" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_798" offset="0x4C78" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXIO_CTRL_1" width="6" begin="29" end="24" resetval="0x0" description="Controls address pad output enable for address slice 1. Set to 1 to disable output enable." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_STATIC_TOG_DISABLE_1" width="4" begin="19" end="16" resetval="0x0" description="Toggle control during static activity for address slice 1. Set bit to dsiable toggling, bit0: Write path delay line, bit1: Read path delay line, bit2: Read data path, bit3: clk_phy, bit4: master delay line." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CSLVL_TRAIN_MASK_1" width="6" begin="13" end="8" resetval="0x0" description="Mask bit for CS training participation for address slice 1. Set to 1 to indicate that the bit is participating in CS training." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_TRAIN_MASK_1" width="6" begin="5" end="0" resetval="0x0" description="Mask bit for CA training participation for address slice 1. Set to 1 to indicate that the bit is participating in CA training." range="5 - 0" rwaccess="R/W"/>
	</register>
