IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_799" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_799" offset="0x4C7C" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXPWR_CTRL_1" width="6" begin="5" end="0" resetval="0x0" description="Disable address output enables in deep sleep mode for address slice 1." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_800" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_800" offset="0x4C80" width="32" description="">
		<bitfield id="PHY_PAD_ADR_RX_PCLK_CLK_SEL_1" width="3" begin="26" end="24" resetval="0x0" description="Reserved for address slice 1." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_ADR_IO_CFG_1" width="11" begin="18" end="8" resetval="0x0" description="Controls I/O pads for address pad for address slice 1. Bits [10:5] = Park value, bits [4] park override, bits [2:0] clk divider." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_TSEL_SELECT_1" width="8" begin="7" end="0" resetval="0x0" description="Tsel select values for address slice 1." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_801" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_801" offset="0x4C84" width="32" description="">
		<bitfield id="PHY_ADR1_SW_WRADDR_SHIFT_1" width="5" begin="28" end="24" resetval="0x0" description="Manual override of CA bit 1 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_CLK_WR_SLAVE_DELAY_1" width="11" begin="18" end="8" resetval="0x0" description="CA bit 0 slave delay setting for address slice 1." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_SW_WRADDR_SHIFT_1" width="5" begin="4" end="0" resetval="0x0" description="Manual override of CA bit 0 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_802" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_802" offset="0x4C88" width="32" description="">
		<bitfield id="PHY_ADR2_SW_WRADDR_SHIFT_1" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 2 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR1_CLK_WR_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="CA bit 1 slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_803" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_803" offset="0x4C8C" width="32" description="">
		<bitfield id="PHY_ADR3_SW_WRADDR_SHIFT_1" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 3 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR2_CLK_WR_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="CA bit 2 slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_804" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_804" offset="0x4C90" width="32" description="">
		<bitfield id="PHY_ADR4_SW_WRADDR_SHIFT_1" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 4 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR3_CLK_WR_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="CA bit 3 slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_805" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_805" offset="0x4C94" width="32" description="">
		<bitfield id="PHY_ADR5_SW_WRADDR_SHIFT_1" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 5 of automatic half_cycle_shift/cycle_shift for address slice 1. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR4_CLK_WR_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="CA bit 4 slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_806" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_806" offset="0x4C98" width="32" description="">
		<bitfield id="PHY_ADR_SW_MASTER_MODE_1" width="4" begin="19" end="16" resetval="0x0" description="Master delay line override settings for address slice 1. Bit [0] enables software half clock mode. Bit [1] is the software half clock mode value. Bit [2] enables software bypass mode. Bit [3] is the software bypass mode value." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR5_CLK_WR_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="CA bit 5 slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
