IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1028" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1028" offset="0x5010" width="32" description="">
		<bitfield id="PHY_ADR_TSEL_ENABLE_2" width="1" begin="24" end="24" resetval="0x0" description="Enables tsel_en for address slice 2." range="24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_SNAP_OBS_REGS_2" width="1" begin="16" end="16" resetval="0x0" description="Initiates a snapshot of the internal observation registers for address slice 2. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_ENC_OBS_SELECT_2" width="3" begin="10" end="8" resetval="0x0" description="Select value to map the addr bits delay observation registers to the accessible delay observation register for address slice 2." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLAVE_LOOP_CNT_UPDATE_2" width="3" begin="2" end="0" resetval="0x0" description="Reserved for address slice 2." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1029" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1029" offset="0x5014" width="32" description="">
		<bitfield id="PHY_ADR_PWR_RDC_DISABLE_2" width="1" begin="24" end="24" resetval="0x0" description="Power reduction disable for address slice 2." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_MASK_2" width="5" begin="20" end="16" resetval="0x0" description="PRBS7 mask signal for address slice 2." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_PRBS_PATTERN_START_2" width="7" begin="14" end="8" resetval="0x1" description="PRBS7 start pattern for address slice 2." range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LPBK_CONTROL_2" width="7" begin="6" end="0" resetval="0x0" description="Loopback control bits for address slice 2." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1030" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1030" offset="0x5018" width="32" description="">
		<bitfield id="PHY_ADR_IE_MODE_2" width="1" begin="24" end="24" resetval="0x0" description="Input enable control for address slice 2." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_WRADDR_SHIFT_OBS_2" width="3" begin="18" end="16" resetval="0x0" description="Observation register containing automatic half cycle and cycle shift values for address slice 2. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_ADR_TYPE_2" width="2" begin="9" end="8" resetval="0x0" description="DRAM type for address slice 2." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SLV_DLY_CTRL_GATE_DISABLE_2" width="1" begin="0" end="0" resetval="0x0" description="Power reduction slv_dly_control block gate disable for address slice 2." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1031" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1031" offset="0x501C" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MODE_2" width="27" begin="26" end="0" resetval="0x0" description="DDL mode for address slice 2." range="26 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1032" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1032" offset="0x5020" width="32" description="">
		<bitfield id="PHY_ADR_DDL_MASK_2" width="6" begin="5" end="0" resetval="0x0" description="DDL mask for address slice 2." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1033" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1033" offset="0x5024" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_OBS_2" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing DDL test bits for address slice 2. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1034" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1034" offset="0x5028" width="32" description="">
		<bitfield id="PHY_ADR_DDL_TEST_MSTR_DLY_OBS_2" width="32" begin="31" end="0" resetval="0x0" description="Observation register containing master DDL bits for address slice 2. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1035" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1035" offset="0x502C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_COARSE_DLY_2" width="11" begin="26" end="16" resetval="0x0" description="Coarse CA training DDL increment value for address slice 2." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_START_2" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL start value for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1036" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1036" offset="0x5030" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_QTR_2" width="11" begin="10" end="0" resetval="0x0" description="CA training DDL quarter cycle delay value for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1037" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1037" offset="0x5034" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_SWIZZLE0_2" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 0 for address slice 2." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1038" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1038" offset="0x5038" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_RANK_CTRL_2" width="2" begin="25" end="24" resetval="0x0" description="CA training rank aggregation control bits for address slice 2." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_SWIZZLE1_2" width="24" begin="23" end="0" resetval="0x0" description="CA training RD DQ bit swizzle map 1 for address slice 2." range="23 - 0" rwaccess="R/W"/>
	</register>
