IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1039" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1039" offset="0x503C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_PERIODIC_START_OFFSET_2" width="9" begin="24" end="16" resetval="0x0" description="Relative offset to start periodic CALVL from previous result" range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_RESP_WAIT_CNT_2" width="4" begin="11" end="8" resetval="0x0" description="Number of samples to wait before sampling response during CA training for address slice 2." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_NUM_PATTERNS_2" width="2" begin="1" end="0" resetval="0x0" description="Number of patterns to use during CA training for address slice 2." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1040" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1040" offset="0x5040" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS_SELECT_2" width="3" begin="26" end="24" resetval="0x0" description="CA bit lane to observe result from OBS0 during CA training for address slice 2." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_ERROR_CLR_2" width="1" begin="16" end="16" resetval="0x0" description="Clears the CA training state machine error status for address slice 2. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="SC_PHY_ADR_CALVL_DEBUG_CONT_2" width="1" begin="8" end="8" resetval="0x0" description="Allows the CA training state machine to advance [when in debug mode] for address slice 2. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_ADR_CALVL_DEBUG_MODE_2" width="1" begin="0" end="0" resetval="0x0" description="Enables CA training debug mode for address slice 2. Set to 1 to enable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1041" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1041" offset="0x5044" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS0_2" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains lane specific CA training bits for slice 2. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1042" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1042" offset="0x5048" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS1_2" width="32" begin="31" end="0" resetval="0x0" description="Observation register contains general CA training bits for slice 2. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1043" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1043" offset="0x504C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_OBS2_2" width="32" begin="31" end="0" resetval="0x256" description="Observation register contains periodic CA training bits for slice 2. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1044" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1044" offset="0x5050" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_0_2" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 0 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1045" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1045" offset="0x5054" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_0_2" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 0 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1046" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1046" offset="0x5058" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_1_2" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 1 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1047" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1047" offset="0x505C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_1_2" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 1 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1048" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1048" offset="0x5060" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_2_2" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 2 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1049" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1049" offset="0x5064" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_2_2" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 2 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1050" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1050" offset="0x5068" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_FG_3_2" width="20" begin="19" end="0" resetval="0x0" description="CA training foreground pattern 3 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1051" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1051" offset="0x506C" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_BG_3_2" width="20" begin="19" end="0" resetval="0x0" description="CA training background pattern 3 for address slice 2." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1052" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1052" offset="0x5070" width="32" description="">
		<bitfield id="PHY_ADR_ADDR_SEL_2" width="30" begin="29" end="0" resetval="0x0" description="Selects which DFI address pins connect to which CA pins for LPDDR3/4 for address slice 2." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1053" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1053" offset="0x5074" width="32" description="">
		<bitfield id="PHY_ADR_SEG_MASK_2" width="6" begin="29" end="24" resetval="0x0" description="Segment mask bit for address slice 2. Set to 1 to indicate that the bit is either CA 4 or CA 9." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_BIT_MASK_2" width="6" begin="21" end="16" resetval="0x0" description="Mask bit for address slice 2. Set to 1 to indicate that the bit is used." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_LP4_BOOT_SLV_DELAY_2" width="10" begin="9" end="0" resetval="0x0" description="Address slave delay setting during the LPDDR4 boot frequency operation for address slice 2." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1054" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1054" offset="0x5078" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXIO_CTRL_2" width="6" begin="29" end="24" resetval="0x0" description="Controls address pad output enable for address slice 2. Set to 1 to disable output enable." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_STATIC_TOG_DISABLE_2" width="4" begin="19" end="16" resetval="0x0" description="Toggle control during static activity for address slice 2. Set bit to dsiable toggling, bit0: Write path delay line, bit1: Read path delay line, bit2: Read data path, bit3: clk_phy, bit4: master delay line." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CSLVL_TRAIN_MASK_2" width="6" begin="13" end="8" resetval="0x0" description="Mask bit for CS training participation for address slice 2. Set to 1 to indicate that the bit is participating in CS training." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_TRAIN_MASK_2" width="6" begin="5" end="0" resetval="0x0" description="Mask bit for CA training participation for address slice 2. Set to 1 to indicate that the bit is participating in CA training." range="5 - 0" rwaccess="R/W"/>
	</register>
