IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1055" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1055" offset="0x507C" width="32" description="">
		<bitfield id="PHY_ADR_SW_TXPWR_CTRL_2" width="6" begin="5" end="0" resetval="0x0" description="Disable address output enables in deep sleep mode for address slice 2." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1056" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1056" offset="0x5080" width="32" description="">
		<bitfield id="PHY_PAD_ADR_RX_PCLK_CLK_SEL_2" width="3" begin="26" end="24" resetval="0x0" description="Reserved for address slice 2." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_ADR_IO_CFG_2" width="11" begin="18" end="8" resetval="0x0" description="Controls I/O pads for address pad for address slice 2. Bits [10:5] = Park value, bits [4] park override, bits [2:0] clk divider." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_TSEL_SELECT_2" width="8" begin="7" end="0" resetval="0x0" description="Tsel select values for address slice 2." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1057" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1057" offset="0x5084" width="32" description="">
		<bitfield id="PHY_ADR1_SW_WRADDR_SHIFT_2" width="5" begin="28" end="24" resetval="0x0" description="Manual override of CA bit 1 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_CLK_WR_SLAVE_DELAY_2" width="11" begin="18" end="8" resetval="0x0" description="CA bit 0 slave delay setting for address slice 2." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR0_SW_WRADDR_SHIFT_2" width="5" begin="4" end="0" resetval="0x0" description="Manual override of CA bit 0 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1058" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1058" offset="0x5088" width="32" description="">
		<bitfield id="PHY_ADR2_SW_WRADDR_SHIFT_2" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 2 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR1_CLK_WR_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="CA bit 1 slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1059" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1059" offset="0x508C" width="32" description="">
		<bitfield id="PHY_ADR3_SW_WRADDR_SHIFT_2" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 3 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR2_CLK_WR_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="CA bit 2 slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1060" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1060" offset="0x5090" width="32" description="">
		<bitfield id="PHY_ADR4_SW_WRADDR_SHIFT_2" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 4 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR3_CLK_WR_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="CA bit 3 slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1061" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1061" offset="0x5094" width="32" description="">
		<bitfield id="PHY_ADR5_SW_WRADDR_SHIFT_2" width="5" begin="20" end="16" resetval="0x0" description="Manual override of CA bit 5 of automatic half_cycle_shift/cycle_shift for address slice 2. Bit [0] enables override of half_cycle_shift. Bit [1] is the half_cycle_shift value. Bit [2] enables override of cycle shift. Bits [4:3] is the cycle_shift value. For bits [4:3], clear to 0x0 for no offset, program to 0x1 for -1 cycle, program to 0x2 for +1 cycle, or program to 0x3 for -2 cycles." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR4_CLK_WR_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="CA bit 4 slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1062" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1062" offset="0x5098" width="32" description="">
		<bitfield id="PHY_ADR_SW_MASTER_MODE_2" width="4" begin="19" end="16" resetval="0x0" description="Master delay line override settings for address slice 2. Bit [0] enables software half clock mode. Bit [1] is the software half clock mode value. Bit [2] enables software bypass mode. Bit [3] is the software bypass mode value." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR5_CLK_WR_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="CA bit 5 slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1063" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1063" offset="0x509C" width="32" description="">
		<bitfield id="PHY_ADR_MASTER_DELAY_WAIT_2" width="8" begin="31" end="24" resetval="0x0" description="Wait cycles for master delay line locking algorithm for address slice 2. Bits [3:0] is the cycle wait count after a calibration clock setting change. Bits [7:4] is the cycle wait count after a master delay setting change." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_STEP_2" width="6" begin="21" end="16" resetval="0x0" description="Incremental step size for master delay line locking algorithm for address slice 2." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_START_2" width="11" begin="10" end="0" resetval="0x0" description="Start value for master delay line locking algorithm for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1064" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1064" offset="0x50A0" width="32" description="">
		<bitfield id="PHY_ADR_SW_CALVL_DVW_MIN_EN_2" width="1" begin="24" end="24" resetval="0x0" description="Enables the software override data valid window size during CA training for address slice 2." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_SW_CALVL_DVW_MIN_2" width="10" begin="17" end="8" resetval="0x0" description="Sets the software override data valid window size during CA training for address slice 2." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_MASTER_DELAY_HALF_MEASURE_2" width="8" begin="7" end="0" resetval="0x0" description="Defines the number of delay line elements to be considered in determing whether to lock to a half clock cycle for the master in address slice 2" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1065" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1065" offset="0x50A4" width="32" description="">
		<bitfield id="PHY_ADR_CALVL_DLY_STEP_2" width="4" begin="3" end="0" resetval="0x0" description="Sets the delay step size plus 1 during CA training for address slice 2." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1066" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1066" offset="0x50A8" width="32" description="">
		<bitfield id="PHY_ADR_MEAS_DLY_STEP_ENABLE_2" width="1" begin="8" end="8" resetval="0x0" description="Enables delay parameter setting using phy_adr_meas_dly_step_value for address slice 2." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_CALVL_CAPTURE_CNT_2" width="4" begin="3" end="0" resetval="0x0" description="Number of samples to take at each ADDR slave delay setting during CA training for address slice 2." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1280" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1280" offset="0x5400" width="32" description="">
		<bitfield id="PHY_FREQ_SEL" width="2" begin="1" end="0" resetval="0x0" description="Specifies which copy of the frequency-dependent timing parameters will be used by the PHY." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1281" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1281" offset="0x5404" width="32" description="">
		<bitfield id="PHY_SW_GRP0_SHIFT_0" width="5" begin="28" end="24" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_FREQ_SEL_INDEX" width="2" begin="17" end="16" resetval="0x0" description="Selects which frequency set to update when PHY_FREQ_SEL_MULTICAST_EN is not set." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_FREQ_SEL_MULTICAST_EN" width="1" begin="8" end="8" resetval="0x1" description="When set, a register write will update parameters for all frequency sets simultaneously. Set to 1 to enable." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_FREQ_SEL_FROM_REGIF" width="1" begin="0" end="0" resetval="0x0" description="Indicates which source is used to select the frequency copy. When set to 1, the frequency select source is given by parameter PHY_FREQ_SEL from register I/F. When cleared to 0, the frequency select source is the PHY input signal dfi_frequency" range="0" rwaccess="R/W"/>
	</register>
