IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1282" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1282" offset="0x5408" width="32" description="">
		<bitfield id="PHY_SW_GRP0_SHIFT_1" width="5" begin="28" end="24" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP3_SHIFT_0" width="5" begin="20" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP2_SHIFT_0" width="5" begin="12" end="8" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP1_SHIFT_0" width="5" begin="4" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1283" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1283" offset="0x540C" width="32" description="">
		<bitfield id="PHY_SW_GRP0_SHIFT_2" width="5" begin="28" end="24" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP3_SHIFT_1" width="5" begin="20" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP2_SHIFT_1" width="5" begin="12" end="8" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP1_SHIFT_1" width="5" begin="4" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1284" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1284" offset="0x5410" width="32" description="">
		<bitfield id="PHY_SW_GRP0_SHIFT_3" width="5" begin="28" end="24" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP3_SHIFT_2" width="5" begin="20" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP2_SHIFT_2" width="5" begin="12" end="8" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP1_SHIFT_2" width="5" begin="4" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1285" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1285" offset="0x5414" width="32" description="">
		<bitfield id="PHY_SW_GRP3_SHIFT_3" width="5" begin="20" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP2_SHIFT_3" width="5" begin="12" end="8" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP1_SHIFT_3" width="5" begin="4" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 4." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1286" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1286" offset="0x5418" width="32" description="">
		<bitfield id="PHY_GRP_BYPASS_OVERRIDE" width="1" begin="24" end="24" resetval="0x0" description="Address/control group slice bypass mode override setting." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_GRP_BYPASS_SHIFT" width="5" begin="20" end="16" resetval="0x0" description="Address/control group slice bypass mode shift settings." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP_BYPASS_SLAVE_DELAY" width="11" begin="10" end="0" resetval="0x0" description="Address/control group slice bypass mode slave delay setting." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1287" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1287" offset="0x541C" width="32" description="">
		<bitfield id="PHY_CSLVL_START" width="11" begin="26" end="16" resetval="0x0" description="Defines the CS training DDL start value." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_MANUAL_UPDATE_PHYUPD_ENABLE" width="1" begin="8" end="8" resetval="0x1" description="Manual update selection of all slave delay line settings. Set 1 to assert phyupd_req and wait phyupd_ack to update delay line, set 0 to update delay line directly." range="8" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_MANUAL_UPDATE" width="1" begin="0" end="0" resetval="0x0" description="Manual update of all slave delay line settings. Set to 1 to trigger. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1288" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1288" offset="0x5420" width="32" description="">
		<bitfield id="SC_PHY_CSLVL_DEBUG_CONT" width="1" begin="24" end="24" resetval="0x0" description="Allows the CS training state machine to advance [when in debug mode]. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PHY_CSLVL_DEBUG_MODE" width="1" begin="16" end="16" resetval="0x0" description="Enables CS training debug mode. Set to 1 to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_COARSE_DLY" width="11" begin="10" end="0" resetval="0x0" description="Defines the CS training DDL coarse cycle delay value." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1289" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1289" offset="0x5424" width="32" description="">
		<bitfield id="SC_PHY_CSLVL_ERROR_CLR" width="1" begin="0" end="0" resetval="0x0" description="Clears the CS training state machine error status. Set to 1 to trigger. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1290" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1290" offset="0x5428" width="32" description="">
		<bitfield id="PHY_CSLVL_OBS0" width="32" begin="31" end="0" resetval="0x109051904" description="Observation register for CS training delay values. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1291" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1291" offset="0x542C" width="32" description="">
		<bitfield id="PHY_CSLVL_OBS1" width="32" begin="31" end="0" resetval="0x0" description="Observation register for CS training algorithm status. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1292" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1292" offset="0x5430" width="32" description="">
		<bitfield id="PHY_CSLVL_OBS2" width="32" begin="31" end="0" resetval="0x0" description="Observation register for periodic CS training delay values. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1293" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1293" offset="0x5434" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_DISABLE" width="1" begin="24" end="24" resetval="0x0" description="Controls the handling of the DFI frequency. When set to 1, DFI frequency 0 is considered the first operational frequency. When cleared to 0, DFI frequency 0 is the boot frequency and other DFI frequency values are operational frequencies. Must be cleared to 0 for LPDDR3 devices operating in an LPDDR4 capable configuration." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_PERIODIC_START_OFFSET" width="9" begin="16" end="8" resetval="0x0" description="Defines the relative offset from previous LE and TE to start periodic CSLVL with." range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="CS training enable. Set to 1 to enable CS training during CA training." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1294" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1294" offset="0x5438" width="32" description="">
		<bitfield id="PHY_CSLVL_QTR" width="11" begin="18" end="8" resetval="0x0" description="Defines the CS training DDL 1/4 cycle delay value." range="18 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_CS_MAP" width="2" begin="1" end="0" resetval="0x0" description="CS training map. Set each CS bit to 1 to allow that CS to participate in CS training results. NOT CURRENTLY USED." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1295" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1295" offset="0x543C" width="32" description="">
		<bitfield id="PHY_ADRCTL_SLAVE_LOOP_CNT_UPDATE" width="3" begin="26" end="24" resetval="0x0" description="Reserved for the address/control master." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_COARSE_CAPTURE_CNT" width="4" begin="19" end="16" resetval="0x0" description="Defines the number of samples to take at each GRP slave delay setting during CS training coarse CA training." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_COARSE_CHK" width="11" begin="10" end="0" resetval="0x0" description="Defines the CS training coarse CA training DDL 1/16th cycle delay value." range="10 - 0" rwaccess="R/W"/>
	</register>
