IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1296" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1296" offset="0x5440" width="32" description="">
		<bitfield id="PHY_LP4_ACTIVE" width="1" begin="24" end="24" resetval="0x0" description="Indicates an LPDDR4 device is connected to the PHY." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_LPDDR" width="1" begin="16" end="16" resetval="0x0" description="Adds a cycle of delay for the address/control slices to match the address slice." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_DFI_PHYUPD_TYPE" width="2" begin="9" end="8" resetval="0x0" description="Defines the value of the dfi_phyupd_type output signal to MC." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_SNAP_OBS_REGS" width="1" begin="0" end="0" resetval="0x0" description="Initiates a snapshot of the internal observation registers for the address/control block. Set to 1 to trigger. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1297" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1297" offset="0x5444" width="32" description="">
		<bitfield id="PHY_SW_TXIO_CTRL_0" width="4" begin="27" end="24" resetval="0x0" description="This register is used to control if command pad [CS/RAS...] should be shutoff for TX mode." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CONTINUOUS_CLK_CAL_UPDATE" width="1" begin="16" end="16" resetval="0x0" description="Continuous update of all latest PVTP,PVTN and PVTR values to the CLK IO pads. Set to 1 to keep this enabled." range="16" rwaccess="R/W"/> 
		<bitfield id="SC_PHY_UPDATE_CLK_CAL_VALUES" width="1" begin="8" end="8" resetval="0x0" description="Manual update of all latest PVTP,PVTN and PVTR values to the CLK IO pads. Set to 1 to trigger. WRITE-ONLY" range="8" rwaccess="W"/> 
		<bitfield id="PHY_LPDDR3_CS" width="1" begin="0" end="0" resetval="0x1" description="Alters reset state polarity for LPDDR chip selects." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1298" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1298" offset="0x5448" width="32" description="">
		<bitfield id="PHY_MEMCLK_SW_TXIO_CTRL" width="1" begin="24" end="24" resetval="0x0" description="This register is used to control if clk pads should be shutoff for TX mode." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_TXIO_CTRL_3" width="4" begin="19" end="16" resetval="0x0" description="This register is used to control if command pad [CS/RAS...] should be shutoff for TX mode." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_TXIO_CTRL_2" width="4" begin="11" end="8" resetval="0x0" description="This register is used to control if command pad [CS/RAS...] should be shutoff for TX mode." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_TXIO_CTRL_1" width="4" begin="3" end="0" resetval="0x0" description="This register is used to control if command pad [CS/RAS...] should be shutoff for TX mode." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1299" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1299" offset="0x544C" width="32" description="">
		<bitfield id="PHY_ADRCTL_SW_TXPWR_CTRL_3" width="4" begin="27" end="24" resetval="0x0" description="This register is used to control if address/command pad [address/CS/RAS...] should be shutoff for TX mode in deep sleep mode." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_SW_TXPWR_CTRL_2" width="4" begin="19" end="16" resetval="0x0" description="This register is used to control if address/command pad [address/CS/RAS...] should be shutoff for TX mode in deep sleep mode." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_SW_TXPWR_CTRL_1" width="4" begin="11" end="8" resetval="0x0" description="This register is used to control if address/command pad [address/CS/RAS...] should be shutoff for TX mode in deep sleep mode." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_SW_TXPWR_CTRL_0" width="4" begin="3" end="0" resetval="0x0" description="This register is used to control if address/command pad [address/CS/RAS...] should be shutoff for TX mode in deep sleep mode." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1300" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1300" offset="0x5450" width="32" description="">
		<bitfield id="PHY_BYTE_DISABLE_STATIC_TOG_DISABLE" width="1" begin="16" end="16" resetval="0x0" description="Control to disable the toggle signal for data slice during static activity when dfi_data_byte_disable is asserted." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_TOP_STATIC_TOG_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="Disables the generation of the toggle for static clock based paths in the PHY to prevent assymetric aging." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_MEMCLK_SW_TXPWR_CTRL" width="1" begin="0" end="0" resetval="0x0" description="This register is used to control if clk pads should be shutoff for TX mode in deep sleep mode." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1301" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1301" offset="0x5454" width="32" description="">
		<bitfield id="PHY_MEMCLK_STATIC_TOG_DISABLE" width="1" begin="24" end="24" resetval="0x0" description="Control to disable toggle during static activity. bit0: clock disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_STATIC_TOG_DISABLE" width="4" begin="19" end="16" resetval="0x0" description="Control to disable toggle during static activity. bit0: Write path delay line disable; bit1: clock disable; bit2: adrctl master delay line disable [if exists]; bit3: adrctl misc core clk disable.[if exists]" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_STATIC_TOG_CONTROL" width="16" begin="15" end="0" resetval="0x0" description="Clock divider to create toggle signal. Use long counter as the base." range="15 - 0" rwaccess="R/W"/>
	</register>
