IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1302" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1302" offset="0x5458" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_PLL_BYPASS" width="1" begin="0" end="0" resetval="0x0" description="PHY clock PLL bypass select." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1303" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1303" offset="0x545C" width="32" description="">
		<bitfield id="PHY_CLK_SWITCH_OBS" width="32" begin="31" end="0" resetval="0x268969552" description="Observation register for Clock switch state machine READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1304" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1304" offset="0x5460" width="32" description="">
		<bitfield id="PHY_PLL_WAIT" width="16" begin="15" end="0" resetval="0x0" description="PHY clock PLL wait time after locking." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1305" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1305" offset="0x5464" width="32" description="">
		<bitfield id="PHY_SW_PLL_BYPASS" width="1" begin="0" end="0" resetval="0x0" description="PHY clock PLL bypass select." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1306" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1306" offset="0x5468" width="32" description="">
		<bitfield id="PHY_SET_DFI_INPUT_3" width="4" begin="27" end="24" resetval="0x0" description="Used to indicate the default value of the adrctl slice bits." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_SET_DFI_INPUT_2" width="4" begin="19" end="16" resetval="0x0" description="Used to indicate the default value of the adrctl slice bits." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_SET_DFI_INPUT_1" width="4" begin="11" end="8" resetval="0x0" description="Used to indicate the default value of the adrctl slice bits." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_SET_DFI_INPUT_0" width="4" begin="3" end="0" resetval="0x0" description="Used to indicate the default value of the adrctl slice bits." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1307" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1307" offset="0x546C" width="32" description="">
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT3_0" width="2" begin="25" end="24" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 0.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_0 bit3, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_0, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT2_0" width="2" begin="17" end="16" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 0.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_0 bit2 , 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_0, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT1_0" width="2" begin="9" end="8" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 0.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_0 bit1, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_0, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT0_0" width="2" begin="1" end="0" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 0.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_0 bit0, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_0, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1308" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1308" offset="0x5470" width="32" description="">
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT3_1" width="2" begin="25" end="24" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 1.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_1 bit3, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_1, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT2_1" width="2" begin="17" end="16" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 1.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_1 bit2 , 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_1, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT1_1" width="2" begin="9" end="8" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 1.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_1 bit1, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_1, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT0_1" width="2" begin="1" end="0" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 1.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_1 bit0, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_1, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="1 - 0" rwaccess="R/W"/>
	</register>
