IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1309" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1309" offset="0x5474" width="32" description="">
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT3_2" width="2" begin="25" end="24" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 2.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_2 bit3, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_2, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT2_2" width="2" begin="17" end="16" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 2.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_2 bit2 , 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_2, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT1_2" width="2" begin="9" end="8" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 2.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_2 bit1, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_2, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT0_2" width="2" begin="1" end="0" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 2.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_2 bit0, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_2, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1310" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1310" offset="0x5478" width="32" description="">
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT3_3" width="2" begin="25" end="24" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 3.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_3 bit3, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_3, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT2_3" width="2" begin="17" end="16" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 3.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_3 bit2 , 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_3, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT1_3" width="2" begin="9" end="8" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 3.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_3 bit1, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_3, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CS_ACS_ALLOCATION_BIT0_3" width="2" begin="1" end="0" resetval="0x0" description="The map for which chip select is associated with each bit in the adrctl slice 3.  Bit [n], 1 means cs[n]'s signal[CS/CKE/ODT/RST] is allocated on ACS_3 bit0, 0 means cs[n]'s signal[CS/CKE/ODT/RST] is not tranfser on ACS_3, if the accroding cs[n]'s training is not enabled, need to set the value to all 1s." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1311" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1311" offset="0x547C" width="32" description="">
		<bitfield id="PHY_PLL_CTRL_OVERRIDE" width="16" begin="31" end="16" resetval="0x0" description="Individual PHY clock PLL control overrides." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_PLL_CTRL" width="13" begin="12" end="0" resetval="0x0" description="PHY deskew PLL controls for LPDDR4 boot frequency." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1312" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1312" offset="0x5480" width="32" description="">
		<bitfield id="SC_PHY_PLL_SPO_CAL_SNAP_OBS" width="2" begin="17" end="16" resetval="0x0" description="Register command to take a snapshot of PLL output. WRITE-ONLY" range="17 - 16" rwaccess="W"/> 
		<bitfield id="PHY_PLL_SPO_CAL_CTRL" width="8" begin="15" end="8" resetval="0x0" description="PLL SPO Cal controls." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_USE_PLL_DSKEWCALLOCK" width="1" begin="0" end="0" resetval="0x0" description="Use DSKEWCALLOCK or not." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1313" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1313" offset="0x5484" width="32" description="">
		<bitfield id="PHY_PLL_OBS_0" width="16" begin="15" end="0" resetval="0x0" description="PHY TOP level clock PLL_0 observe values. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1314" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1314" offset="0x5488" width="32" description="">
		<bitfield id="PHY_PLL_SPO_CAL_OBS_0" width="17" begin="16" end="0" resetval="0x0" description="PHY TOP level PLL_0 SPO Cal observe values. READ-ONLY" range="16 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1315" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1315" offset="0x548C" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_PLL_DESKEWCALIN_0" width="12" begin="27" end="16" resetval="0x0" description="PHY TOP level PLL_0 lpddr4 boot deskewcal in values." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PLL_DESKEWCALIN_0" width="12" begin="11" end="0" resetval="0x0" description="PHY TOP level PLL_0 deskewcal in values." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1316" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1316" offset="0x5490" width="32" description="">
		<bitfield id="PHY_PLL_OBS_1" width="16" begin="15" end="0" resetval="0x0" description="PHY TOP level clock PLL_1 observe values. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1317" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1317" offset="0x5494" width="32" description="">
		<bitfield id="PHY_PLL_SPO_CAL_OBS_1" width="17" begin="16" end="0" resetval="0x0" description="PHY TOP level PLL_1 SPO Cal observe values. READ-ONLY" range="16 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1318" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1318" offset="0x5498" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_PLL_DESKEWCALIN_1" width="12" begin="27" end="16" resetval="0x0" description="PHY TOP level PLL_1 lpddr4 boot deskewcal in values." range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PLL_DESKEWCALIN_1" width="12" begin="11" end="0" resetval="0x0" description="PHY TOP level PLL_1 deskewcal in values." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1319" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1319" offset="0x549C" width="32" description="">
		<bitfield id="PHY_LP_WAKEUP" width="8" begin="31" end="24" resetval="0x0" description="Specifies the number of cycles the PHY takes to wakeup in low power mode." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_TCKSRE_WAIT" width="4" begin="19" end="16" resetval="0x0" description="Specifies the number of cycles the PHY should wait before turning off the PLL for a deep sleep or DFS event." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_LP4_BOOT_LOW_FREQ_SEL" width="1" begin="8" end="8" resetval="0x0" description="Control the PLL domain enter/exit from the negative clock edge for LPDDR4 boot frequency." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_PLL_REFOUT_SEL" width="1" begin="0" end="0" resetval="0x0" description="PHY PLL refout select." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1320" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1320" offset="0x54A0" width="32" description="">
		<bitfield id="PHY_LP_CTRLUPD_CNTR_CFG" width="10" begin="17" end="8" resetval="0x0" description="Specifies the number of cycles the PHY takes from light sleep req deassert to ack deassert in low power mode." range="17 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_LS_IDLE_EN" width="1" begin="0" end="0" resetval="0x0" description="Indicates the Reduced Idle Power State is enabled in low power mode." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1321" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1321" offset="0x54A4" width="32" description="">
		<bitfield id="PHY_TDFI_PHY_WRDELAY" width="1" begin="24" end="24" resetval="0x0" description="DFI timing parameter TDFI_PHY_WRDELAY." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_DS_EXIT_CTRL" width="17" begin="16" end="0" resetval="0x0" description="Controls to reduce the deep sleep exit latency, when bit 16 is 1 deep sleep exit ack won't wait master delay line lock." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1322" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1322" offset="0x54A8" width="32" description="">
		<bitfield id="PHY_PAD_FDBK_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for gate feedback pads." range="17 - 0" rwaccess="R/W"/>
	</register>
