IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1323" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1323" offset="0x54AC" width="32" description="">
		<bitfield id="PHY_PAD_DATA_TERM" width="17" begin="16" end="0" resetval="0x17424" description="Controls term settings for data pads." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1324" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1324" offset="0x54B0" width="32" description="">
		<bitfield id="PHY_PAD_DQS_TERM" width="17" begin="16" end="0" resetval="0x17424" description="Controls term settings for dqs pads." range="16 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1325" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1325" offset="0x54B4" width="32" description="">
		<bitfield id="PHY_PAD_ADDR_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for the address/control pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1326" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1326" offset="0x54B8" width="32" description="">
		<bitfield id="PHY_PAD_CLK_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for clock pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1327" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1327" offset="0x54BC" width="32" description="">
		<bitfield id="PHY_PAD_ERR_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for error pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1328" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1328" offset="0x54C0" width="32" description="">
		<bitfield id="PHY_PAD_CKE_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for cke pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1329" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1329" offset="0x54C4" width="32" description="">
		<bitfield id="PHY_PAD_RST_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for reset_n pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1330" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1330" offset="0x54C8" width="32" description="">
		<bitfield id="PHY_PAD_CS_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for cs pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1331" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1331" offset="0x54CC" width="32" description="">
		<bitfield id="PHY_PAD_ODT_TERM" width="18" begin="17" end="0" resetval="0x17424" description="Controls term settings for odt pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1332" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1332" offset="0x54D0" width="32" description="">
		<bitfield id="PHY_ADRCTL_LP3_RX_CAL" width="13" begin="28" end="16" resetval="0x0" description="PHY CKE/RESET_N RX calibration controls." range="28 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_RX_CAL" width="10" begin="9" end="0" resetval="0x0" description="PHY address/control RX calibration controls." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1333" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1333" offset="0x54D4" width="32" description="">
		<bitfield id="PHY_CAL_START_0" width="1" begin="24" end="24" resetval="0x0" description="Manual start for the pad calibration state machine for block 0. Set to 1 to trigger. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PHY_CAL_CLEAR_0" width="1" begin="16" end="16" resetval="0x0" description="Clear the pad calibration state machine and results for block 0. Set to 1 to trigger. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PHY_CAL_MODE_0" width="13" begin="12" end="0" resetval="0x0" description="Pad calibration mode bits for block 0. Bit [0] disables pad calibration upon initialization. Bit [1] enables automatic interval based calibration. Bits [3:2] set the base interval for the interval counter. Bits [7:4] are direct connections to pad control signals." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1334" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1334" offset="0x54D8" width="32" description="">
		<bitfield id="PHY_CAL_INTERVAL_COUNT_0" width="32" begin="31" end="0" resetval="0x0" description="Pad calibration interval counter compare value for block 0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1335" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1335" offset="0x54DC" width="32" description="">
		<bitfield id="PHY_LP4_BOOT_CAL_CLK_SELECT_0" width="3" begin="10" end="8" resetval="0x0" description="Pad calibration pad clock frequency select setting for LPDDR4 boot frequency for block 0." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_SAMPLE_WAIT_0" width="8" begin="7" end="0" resetval="0x0" description="Pad calibration state machine wait count in pad clock cycles for block 0." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1336" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1336" offset="0x54E0" width="32" description="">
		<bitfield id="PHY_CAL_RESULT_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration results observation values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1337" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1337" offset="0x54E4" width="32" description="">
		<bitfield id="PHY_CAL_RESULT2_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration results [CKE/RESET_N] observation values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
