IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1338" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1338" offset="0x54E8" width="32" description="">
		<bitfield id="PHY_CAL_RESULT4_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration pass1 shadow results observation values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1339" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1339" offset="0x54EC" width="32" description="">
		<bitfield id="PHY_CAL_RESULT5_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration pass2 shadow results observation values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1340" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1340" offset="0x54F0" width="32" description="">
		<bitfield id="PHY_CAL_RESULT6_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration internal results observation delta values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1341" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1341" offset="0x54F4" width="32" description="">
		<bitfield id="PHY_CAL_CPTR_CNT_0" width="7" begin="30" end="24" resetval="0x0" description="defines sample capture number in pad calibration process" range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RESULT7_OBS_0" width="24" begin="23" end="0" resetval="0x0" description="Pad calibration internal results observation delta values for block 0. READ-ONLY" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1342" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1342" offset="0x54F8" width="32" description="">
		<bitfield id="PHY_CAL_DBG_CFG_0" width="1" begin="24" end="24" resetval="0x0" description="defines debug configuration in pad calibration process" range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RCV_FINE_ADJ_0" width="8" begin="23" end="16" resetval="0x0" description="defines adjustment for RCV code in pad calibration process" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_PD_FINE_ADJ_0" width="8" begin="15" end="8" resetval="0x0" description="defines adjustment for PD code in pad calibration process" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_PU_FINE_ADJ_0" width="8" begin="7" end="0" resetval="0x0" description="defines adjustment for PU code in pad calibration process" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1343" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1343" offset="0x54FC" width="32" description="">
		<bitfield id="SC_PHY_PAD_DBG_CONT_0" width="1" begin="0" end="0" resetval="0x0" description="Allows the pad calibration state machine to advance [when in debug mode] for slice 0. Set to 1 to trigger. WRITE-ONLY" range="0" rwaccess="W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1344" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1344" offset="0x5500" width="32" description="">
		<bitfield id="PHY_CAL_RESULT3_OBS_0" width="32" begin="31" end="0" resetval="0x0" description="Pad calibration results first/last0/1 observation values for block 0. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1345" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1345" offset="0x5504" width="32" description="">
		<bitfield id="PHY_CAL_SLOPE_ADJ_0" width="20" begin="27" end="8" resetval="0x266272" description="defines slope configure in pad calibration process" range="27 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_PVT_MAP_0" width="8" begin="7" end="0" resetval="0x0" description="defines slope configure in pad calibration process" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1346" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1346" offset="0x5508" width="32" description="">
		<bitfield id="PHY_CAL_SLOPE_ADJ_PASS2_0" width="20" begin="19" end="0" resetval="0x266272" description="defines slope configure for pass2 in pad calibration process" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1347" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1347" offset="0x550C" width="32" description="">
		<bitfield id="PHY_CAL_TWO_PASS_CFG_0" width="25" begin="24" end="0" resetval="0x13208728" description="defines cal_en configure in pad calibration process" range="24 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1348" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1348" offset="0x5510" width="32" description="">
		<bitfield id="PHY_CAL_RANGE_PASS1_PU_MAX_DELTA_0" width="6" begin="29" end="24" resetval="0x63" description="Pad calibration pass1 pu results won't update if out of max delta range ." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_SW_CAL_CFG_0" width="23" begin="22" end="0" resetval="0x0" description="defines firmware based pad calibration process" range="22 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1349" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1349" offset="0x5514" width="32" description="">
		<bitfield id="PHY_CAL_RANGE_PASS2_PD_MAX_DELTA_0" width="6" begin="29" end="24" resetval="0x63" description="Pad calibration pass2 pd results won't update if out of max delta range ." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS2_PU_MAX_DELTA_0" width="6" begin="21" end="16" resetval="0x63" description="Pad calibration pass2 pu results won't update if out of max delta range ." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS1_RX_MAX_DELTA_0" width="5" begin="12" end="8" resetval="0x31" description="Pad calibration pass1 rx results won't update if out of max delta range ." range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS1_PD_MAX_DELTA_0" width="6" begin="5" end="0" resetval="0x63" description="Pad calibration pass1 pd results won't update if out of max delta range ." range="5 - 0" rwaccess="R/W"/>
	</register>
