IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1350" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1350" offset="0x5518" width="32" description="">
		<bitfield id="PHY_CAL_RANGE_PASS1_RX_MIN_DELTA_0" width="5" begin="28" end="24" resetval="0x0" description="Pad calibration pass1 rx results won't update if out of min delta range ." range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS1_PD_MIN_DELTA_0" width="6" begin="21" end="16" resetval="0x0" description="Pad calibration pass1 pd results won't update if out of min delta range ." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS1_PU_MIN_DELTA_0" width="6" begin="13" end="8" resetval="0x0" description="Pad calibration pass1 pu results won't update if out of min delta range ." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS2_RX_MAX_DELTA_0" width="5" begin="4" end="0" resetval="0x31" description="Pad calibration pass2 rx results won't update if out of max delta range ." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1351" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1351" offset="0x551C" width="32" description="">
		<bitfield id="PHY_CAL_RANGE_PASS2_RX_MIN_DELTA_0" width="5" begin="20" end="16" resetval="0x0" description="Pad calibration pass2 rx results won't update if out of min delta range ." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS2_PD_MIN_DELTA_0" width="6" begin="13" end="8" resetval="0x0" description="Pad calibration pass2 pd results won't update if out of min delta range ." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_RANGE_PASS2_PU_MIN_DELTA_0" width="6" begin="5" end="0" resetval="0x0" description="Pad calibration pass2 pu results won't update if out of min delta range ." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1352" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1352" offset="0x5520" width="32" description="">
		<bitfield id="PHY_AC_LPBK_ERR_CLEAR" width="1" begin="24" end="24" resetval="0x0" description="Address/control loopback error clear. Set to 1 to clear error. WRITE-ONLY" range="24" rwaccess="W"/> 
		<bitfield id="PHY_ADRCTL_MANUAL_UPDATE" width="1" begin="16" end="16" resetval="0x0" description="Address/control manual update of slave delay lines. Set to 1 to update. WRITE-ONLY" range="16" rwaccess="W"/> 
		<bitfield id="PHY_PAD_ATB_CTRL" width="16" begin="15" end="0" resetval="0x0" description="Pad ATB control settings. Bit [0] is the enable signal. Bits [5:1] are the ATB data signals. Bits [15:8] are the 1 hot select for which pad is selected." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1353" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1353" offset="0x5524" width="32" description="">
		<bitfield id="PHY_AC_LPBK_CONTROL" width="9" begin="24" end="16" resetval="0x0" description="Address/control slice loopback control setting." range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_LPBK_ENABLE" width="4" begin="11" end="8" resetval="0x0" description="Loopback enable for the address/control slices." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_LPBK_OBS_SELECT" width="2" begin="1" end="0" resetval="0x0" description="Select value to map an individual loopback address/control slice observation register to the global observation register." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1354" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1354" offset="0x5528" width="32" description="">
		<bitfield id="PHY_AC_PRBS_PATTERN_MASK" width="4" begin="11" end="8" resetval="0x0" description="PRBS7 mask signal for address/control slice." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_PRBS_PATTERN_START" width="7" begin="6" end="0" resetval="0x1" description="PRBS7 start pattern for address/control slice." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1355" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1355" offset="0x552C" width="32" description="">
		<bitfield id="PHY_AC_LPBK_RESULT_OBS" width="32" begin="31" end="0" resetval="0x0" description="Observation register for the loopback address/control slices. READ-ONLY" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1356" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1356" offset="0x5530" width="32" description="">
		<bitfield id="PHY_AC_CLK_LPBK_CONTROL" width="6" begin="21" end="16" resetval="0x0" description="Mem clk block loopback control setting." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_CLK_LPBK_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Loopback enable for mem clk blocks." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_CLK_LPBK_OBS_SELECT" width="1" begin="0" end="0" resetval="0x0" description="Select value to map an individual loopback mem clk block observation register to the global observation register." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1357" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1357" offset="0x5534" width="32" description="">
		<bitfield id="PHY_TOP_PWR_RDC_DISABLE" width="1" begin="24" end="24" resetval="0x0" description="top param power reduction disable." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_PWR_RDC_DISABLE" width="1" begin="16" end="16" resetval="0x0" description="ac slice power reduction disable." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_AC_CLK_LPBK_RESULT_OBS" width="16" begin="15" end="0" resetval="0x0" description="Observation register for loopback mem clk blocks. READ-ONLY" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1358" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1358" offset="0x5538" width="32" description="">
		<bitfield id="PHY_AC_SLV_DLY_CTRL_GATE_DISABLE" width="1" begin="0" end="0" resetval="0x0" description="ac slice slv_dly_control block power reduction disable." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1359" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1359" offset="0x553C" width="32" description="">
		<bitfield id="PHY_DATA_BYTE_ORDER_SEL" width="32" begin="31" end="0" resetval="0x0" description="Used to define the data slice's byte swap for CA bits 7:0." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1360" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1360" offset="0x5540" width="32" description="">
		<bitfield id="PHY_ADRCTL_MSTR_DLY_ENC_SEL_0" width="2" begin="25" end="24" resetval="0x0" description="Select adrctl_mstr_dly_enc for the address/control slice 0 ." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ADR_DISABLE" width="3" begin="18" end="16" resetval="0x0" description="Disable the unused adr slice to save power." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CALVL_DEVICE_MAP" width="5" begin="12" end="8" resetval="0x0" description="Define which device's DQ feedback data bits should be used during CA training" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DATA_BYTE_ORDER_SEL_HIGH" width="8" begin="7" end="0" resetval="0x0" description="Used to define the data slice's byte swap for CA bits 9:8." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1361" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1361" offset="0x5544" width="32" description="">
		<bitfield id="PHY_ADRCTL_MSTR_DLY_ENC_SEL_3" width="2" begin="17" end="16" resetval="0x0" description="Select adrctl_mstr_dly_enc for the address/control slice 3 ." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_MSTR_DLY_ENC_SEL_2" width="2" begin="9" end="8" resetval="0x0" description="Select adrctl_mstr_dly_enc for the address/control slice 2 ." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_ADRCTL_MSTR_DLY_ENC_SEL_1" width="2" begin="1" end="0" resetval="0x0" description="Select adrctl_mstr_dly_enc for the address/control slice 1 ." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1362" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1362" offset="0x5548" width="32" description="">
		<bitfield id="PHY_DDL_AC_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="PHY Address/Control DDL BIST mode enable." range="31 - 0" rwaccess="R/W"/>
	</register>
