IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1363" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1363" offset="0x554C" width="32" description="">
		<bitfield id="PHY_DDL_AC_MODE" width="26" begin="25" end="0" resetval="0x0" description="PHY Address/Control DDL BIST mode." range="25 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1364" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1364" offset="0x5550" width="32" description="">
		<bitfield id="PHY_DDL_TRACK_UPD_THRESHOLD_AC" width="8" begin="23" end="16" resetval="0x0" description="Specify threshold value for PHY init update tracking for AC slice." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_INIT_UPDATE_CONFIG" width="3" begin="10" end="8" resetval="0x0" description="PHY init update function configuration." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_DDL_AC_MASK" width="6" begin="5" end="0" resetval="0x0" description="PHY Address/Control DDL BIST mask." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1365" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1365" offset="0x5554" width="32" description="">
		<bitfield id="PHY_ERR_STATUS" width="3" begin="26" end="24" resetval="0x0" description="PHY ERROR information." range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_ERR_MASK_EN" width="3" begin="18" end="16" resetval="0x0" description="PHY ERROR information report mask enable." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_CA_PARITY_ERR_PULSE_MIN" width="16" begin="15" end="0" resetval="0x0" description="PHY alert_n pulse width minimux value for CA parity error." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1366" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1366" offset="0x5558" width="32" description="">
		<bitfield id="PHY_DS0_DQS_ERR_COUNTER" width="32" begin="31" end="0" resetval="0x0" description="PHY DATA SLICE 0 DQS ERROR counter." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1367" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1367" offset="0x555C" width="32" description="">
		<bitfield id="PHY_DS1_DQS_ERR_COUNTER" width="32" begin="31" end="0" resetval="0x0" description="PHY DATA SLICE 1 DQS ERROR counter." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1368" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1368" offset="0x5560" width="32" description="">
		<bitfield id="PHY_DS_INIT_COMPLETE_OBS" width="2" begin="25" end="24" resetval="0x0" description="Observation register for dfi_init_complete for data slice. Bit0 is for data_slice0; bit1 is for data_slice 1,... READ-ONLY." range="25 - 24" rwaccess="R"/> 
		<bitfield id="PHY_AC_INIT_COMPLETE_OBS" width="12" begin="19" end="8" resetval="0x0" description="Observation register for dfi_init_complete for adr and ac slice. Bit 0 is for dfi_init_complete for all slices. Bit[7:4] is for adr slice, bit4 is adr_slice0..., if the adr slice number is 3, bit7 is 0. Bit8 is for ac_slice0; bit9 is for ac_slice 1,... READ-ONLY." range="19 - 8" rwaccess="R"/> 
		<bitfield id="PHY_DLL_RST_EN" width="2" begin="1" end="0" resetval="0x2" description="PHY DDL reset software interface enable." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1369" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1369" offset="0x5564" width="32" description="">
		<bitfield id="PHY_GRP_SHIFT_OBS_SELECT" width="4" begin="27" end="24" resetval="0x0" description="Select value to map an individual address/control group slice automatic cycle/half_cycle shift settings to the observation register." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP_SLV_DLY_ENC_OBS_SELECT" width="5" begin="20" end="16" resetval="0x0" description="Select value to map an individual address/control group slice slave delay to the encoded value observation register." range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_ERR_IE" width="1" begin="8" end="8" resetval="0x0" description="Control the IE signal of IO error pad." range="8" rwaccess="R/W"/> 
		<bitfield id="PHY_UPDATE_MASK" width="1" begin="0" end="0" resetval="0x0" description="Control to disable the generation of dfi_phyupd_req and use of dfi_ctrlupd_req. If this is 0 the PHY is normal mode; if this is 1, the PHY will not respond to dfi_ctrlupd_req or not to send dfi_phyupd_req" range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1370" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1370" offset="0x5568" width="32" description="">
		<bitfield id="PHY_GRP_SHIFT_OBS" width="3" begin="18" end="16" resetval="0x0" description="Observation register for the address/control group automatic half cycle and cycle shift values. READ-ONLY" range="18 - 16" rwaccess="R"/> 
		<bitfield id="PHY_GRP_SLV_DLY_ENC_OBS" width="11" begin="10" end="0" resetval="0x0" description="Observation register for all address/control group slice slave delay encoded values. READ-ONLY" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1371" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1371" offset="0x556C" width="32" description="">
		<bitfield id="PHY_PAD_CAL_IO_CFG_0" width="18" begin="17" end="0" resetval="0x0" description="Pad calibration Controls PCLK/PARK pin and vref switch." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1372" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1372" offset="0x5570" width="32" description="">
		<bitfield id="PHY_PAD_ACS_RX_PCLK_CLK_SEL" width="3" begin="18" end="16" resetval="0x0" description="Controls rx_pclk clk selection for acs pad." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_ACS_IO_CFG" width="16" begin="15" end="0" resetval="0x0" description="Controls PCLK/PARK pin for acs pad." range="15 - 0" rwaccess="R/W"/>
	</register>
