IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1373" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1373" offset="0x5574" width="32" description="">
		<bitfield id="PHY_PLL_BYPASS" width="1" begin="0" end="0" resetval="0x0" description="PHY clock PLL bypass select." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1374" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1374" offset="0x5578" width="32" description="">
		<bitfield id="PHY_LOW_FREQ_SEL" width="1" begin="16" end="16" resetval="0x0" description="Enables the PHY to enter/exit the PLL domain from the negative clock edge. Set to 1 at low frequencies to enable." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_PLL_CTRL" width="13" begin="12" end="0" resetval="0x0" description="PHY clock PLL controls." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1375" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1375" offset="0x557C" width="32" description="">
		<bitfield id="PHY_CSLVL_DLY_STEP" width="4" begin="27" end="24" resetval="0x0" description="Sets the delay step size plus 1 during CS training." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CSLVL_CAPTURE_CNT" width="4" begin="19" end="16" resetval="0x0" description="Defines the number of samples to take at each GRP slave delay setting during CS training." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_PAD_VREF_CTRL_AC" width="12" begin="11" end="0" resetval="0x0" description="Pad VREF control settings for the address/control." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1376" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1376" offset="0x5580" width="32" description="">
		<bitfield id="PHY_LVL_MEAS_DLY_STEP_ENABLE" width="1" begin="24" end="24" resetval="0x0" description="Enables the phy_adr_meas_dly_step_value to be used instead of the phy_cslvl_dly_step parameter." range="24" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_CSLVL_DVW_MIN_EN" width="1" begin="16" end="16" resetval="0x0" description="Enables the software override data valid window size during CS training." range="16" rwaccess="R/W"/> 
		<bitfield id="PHY_SW_CSLVL_DVW_MIN" width="10" begin="9" end="0" resetval="0x0" description="Sets the software override data valid window size during CS training." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1377" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1377" offset="0x5584" width="32" description="">
		<bitfield id="PHY_GRP1_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP0_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1378" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1378" offset="0x5588" width="32" description="">
		<bitfield id="PHY_GRP3_SLAVE_DELAY_0" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 3." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP2_SLAVE_DELAY_0" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1379" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1379" offset="0x558C" width="32" description="">
		<bitfield id="PHY_GRP1_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP0_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1380" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1380" offset="0x5590" width="32" description="">
		<bitfield id="PHY_GRP3_SLAVE_DELAY_1" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 3." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP2_SLAVE_DELAY_1" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1381" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1381" offset="0x5594" width="32" description="">
		<bitfield id="PHY_GRP1_SLAVE_DELAY_2" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 1." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP0_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1382" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1382" offset="0x5598" width="32" description="">
		<bitfield id="PHY_GRP3_SLAVE_DELAY_2" width="11" begin="26" end="16" resetval="0x0" description="Address slice slave delay setting for address slice 3." range="26 - 16" rwaccess="R/W"/> 
		<bitfield id="PHY_GRP2_SLAVE_DELAY_2" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1383" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1383" offset="0x559C" width="32" description="">
		<bitfield id="PHY_GRP0_SLAVE_DELAY_3" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 0." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1384" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1384" offset="0x55A0" width="32" description="">
		<bitfield id="PHY_GRP1_SLAVE_DELAY_3" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 1." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1385" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1385" offset="0x55A4" width="32" description="">
		<bitfield id="PHY_GRP2_SLAVE_DELAY_3" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 2." range="10 - 0" rwaccess="R/W"/>
	</register>
