IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DDR16SS0_CTLPHY_WRAP_CTL_CFG_CTLCFG.xml
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1386" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1386" offset="0x55A8" width="32" description="">
		<bitfield id="PHY_GRP3_SLAVE_DELAY_3" width="11" begin="10" end="0" resetval="0x0" description="Address slice slave delay setting for address slice 3." range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1387" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1387" offset="0x55AC" width="32" description="">
		<bitfield id="PHY_PAD_FDBK_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for gate feedback pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1388" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1388" offset="0x55B0" width="32" description="">
		<bitfield id="PHY_PAD_FDBK_DRIVE2" width="18" begin="17" end="0" resetval="0x255" description="Controls drive settings [enslice/boost] for gate feedback pads." range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1389" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1389" offset="0x55B4" width="32" description="">
		<bitfield id="PHY_PAD_DATA_DRIVE" width="31" begin="30" end="0" resetval="0x0" description="Controls drive settings for data pads." range="30 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1390" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1390" offset="0x55B8" width="32" description="">
		<bitfield id="PHY_PAD_DQS_DRIVE" width="32" begin="31" end="0" resetval="0x0" description="Controls drive settings for dqs pads." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1391" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1391" offset="0x55BC" width="32" description="">
		<bitfield id="PHY_PAD_ADDR_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for the address/control pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1392" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1392" offset="0x55C0" width="32" description="">
		<bitfield id="PHY_PAD_ADDR_DRIVE2" width="28" begin="27" end="0" resetval="0x16776960" description="Controls drive settings for the address/control pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1393" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1393" offset="0x55C4" width="32" description="">
		<bitfield id="PHY_PAD_CLK_DRIVE" width="32" begin="31" end="0" resetval="0x255" description="Controls drive settings for clock pads." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1394" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1394" offset="0x55C8" width="32" description="">
		<bitfield id="PHY_PAD_CLK_DRIVE2" width="19" begin="18" end="0" resetval="0x255" description="Controls drive settings for clock pads." range="18 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1395" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1395" offset="0x55CC" width="32" description="">
		<bitfield id="PHY_PAD_ERR_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for error pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1396" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1396" offset="0x55D0" width="32" description="">
		<bitfield id="PHY_PAD_ERR_DRIVE2" width="28" begin="27" end="0" resetval="0x16776960" description="Controls drive settings for error pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1397" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1397" offset="0x55D4" width="32" description="">
		<bitfield id="PHY_PAD_CKE_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for cke pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1398" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1398" offset="0x55D8" width="32" description="">
		<bitfield id="PHY_PAD_CKE_DRIVE2" width="28" begin="27" end="0" resetval="0x33554176" description="Controls drive settings for cke pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1399" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1399" offset="0x55DC" width="32" description="">
		<bitfield id="PHY_PAD_RST_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for reset_n pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1400" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1400" offset="0x55E0" width="32" description="">
		<bitfield id="PHY_PAD_RST_DRIVE2" width="28" begin="27" end="0" resetval="0x33554176" description="Controls drive settings for reset_n pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1401" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1401" offset="0x55E4" width="32" description="">
		<bitfield id="PHY_PAD_CS_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for cs pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1402" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1402" offset="0x55E8" width="32" description="">
		<bitfield id="PHY_PAD_CS_DRIVE2" width="28" begin="27" end="0" resetval="0x33554176" description="Controls drive settings for cs pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1403" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1403" offset="0x55EC" width="32" description="">
		<bitfield id="PHY_PAD_ODT_DRIVE" width="30" begin="29" end="0" resetval="0x255" description="Controls drive settings for odt pads." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1404" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1404" offset="0x55F0" width="32" description="">
		<bitfield id="PHY_PAD_ODT_DRIVE2" width="28" begin="27" end="0" resetval="0x33554176" description="Controls drive settings for odt pads." range="27 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1405" acronym="CTLPHY_WRAP__CTL_CFG__CTLCFG_DENALI_PHY_1405" offset="0x55F4" width="32" description="">
		<bitfield id="PHY_CAL_SETTLING_PRD_0" width="7" begin="30" end="24" resetval="0x0" description="Number of clock cycles to extend dfi_phyupd_req after the ack is received for settling of final values" range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_VREF_SWITCH_TIMER_0" width="16" begin="23" end="8" resetval="0x0" description="The settling time for a switch in VREF during IO pad calibration." range="23 - 8" rwaccess="R/W"/> 
		<bitfield id="PHY_CAL_CLK_SELECT_0" width="3" begin="2" end="0" resetval="0x0" description="Pad calibration pad clock frequency select setting for block 0." range="2 - 0" rwaccess="R/W"/>
	</register>
</module>